Repository: cannasif-ship-it/verii_crm_api
Catalog: Resources/Messages.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, it_it, tr_tr

# DemandExchangeRateService.RateDeleted
source: Demand Exchange Rate deleted successfully.
ar_sa: طلب Exchange Rate تم حذفه بنجاح.
de_de: Bedarf Exchange Rate erfolgreich gelöscht.
es_es: Demanda Exchange Rate eliminado con éxito.
it_it: Richiesta Exchange Rate eliminato/a con successo.
tr_tr: Demand Exchange Rate başarıyla silindi.

# DemandExchangeRateService.RateNotFound
source: Demand Exchange Rate not found.
ar_sa: طلب Exchange Rate غير موجود.
de_de: Bedarf Exchange Rate nicht gefunden.
es_es: Demanda Exchange Rate no encontrado.
it_it: Richiesta Exchange Rate non trovato/a.
tr_tr: Demand Exchange Rate bulunamadı.

# DemandExchangeRateService.RateRetrieved
source: Demand Exchange Rate retrieved successfully.
ar_sa: طلب Exchange Rate تم استرجاعه بنجاح.
de_de: Bedarf Exchange Rate erfolgreich abgerufen.
es_es: Demanda Exchange Rate recuperado con éxito.
it_it: Richiesta Exchange Rate recuperato/a con successo.
tr_tr: Demand Exchange Rate başarıyla getirildi.

# DemandExchangeRateService.RateUpdated
source: Demand Exchange Rate updated successfully.
ar_sa: طلب Exchange Rate تم تحديثه بنجاح.
de_de: Bedarf Exchange Rate erfolgreich aktualisiert.
es_es: Demanda Exchange Rate actualizado con éxito.
it_it: Richiesta Exchange Rate aggiornato/a con successo.
tr_tr: Demand Exchange Rate başarıyla güncellendi.

# DemandExchangeRateService.RatesRetrieved
source: Demand Exchange Rates retrieved successfully.
ar_sa: طلب Exchange Rates تم استرجاعه بنجاح.
de_de: Bedarf Exchange Rates erfolgreich abgerufen.
es_es: Demanda Exchange Rates recuperado con éxito.
it_it: Richiesta Exchange Rates recuperato/a con successo.
tr_tr: Demand Exchange Rateler başarıyla getirildi.

# DemandExchangeRateService.UpdateRateExceptionMessage
source: An error occurred while updating the Demand Exchange Rate: {0}
ar_sa: حدث خطأ أثناء تحديث the طلب Exchange Rate: {0}
de_de: Fehler beim Aktualisieren von the Bedarf Exchange Rate: {0}
es_es: Ocurrió un error al actualizar the Demanda Exchange Rate: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Richiesta Exchange Rate: {0}
tr_tr: Demand Exchange Rate güncellenirken bir hata oluştu: {0}

# OrderExchangeRateService.CreateRateExceptionMessage
source: An error occurred while creating the Order Exchange Rate: {0}
ar_sa: حدث خطأ أثناء إنشاء the أمر Exchange Rate: {0}
de_de: Fehler beim Erstellen von the Bestellung Exchange Rate: {0}
es_es: Ocurrió un error al crear the Pedido Exchange Rate: {0}
it_it: Si è verificato un errore durante la creazione di the Ordine Exchange Rate: {0}
tr_tr: Order Exchange Rate oluşturulurken bir hata oluştu: {0}

# OrderExchangeRateService.DeleteRateExceptionMessage
source: An error occurred while deleting the Order Exchange Rate: {0}
ar_sa: حدث خطأ أثناء حذف the أمر Exchange Rate: {0}
de_de: Fehler beim Löschen von the Bestellung Exchange Rate: {0}
es_es: Ocurrió un error al eliminar the Pedido Exchange Rate: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Ordine Exchange Rate: {0}
tr_tr: Order Exchange Rate silinirken bir hata oluştu: {0}

# OrderExchangeRateService.GetAllRatesExceptionMessage
source: An error occurred while retrieving Order Exchange Rates: {0}
ar_sa: حدث خطأ أثناء استرجاع أمر Exchange Rates: {0}
de_de: Fehler beim Abrufen von Bestellung Exchange Rates: {0}
es_es: Ocurrió un error al recuperar Pedido Exchange Rates: {0}
it_it: Si è verificato un errore durante il recupero di Ordine Exchange Rates: {0}
tr_tr: Order Exchange Rateler getirilirken bir hata oluştu: {0}

# OrderExchangeRateService.GetRateByIdExceptionMessage
source: An error occurred while retrieving the Order Exchange Rate: {0}
ar_sa: حدث خطأ أثناء استرجاع the أمر Exchange Rate: {0}
de_de: Fehler beim Abrufen von the Bestellung Exchange Rate: {0}
es_es: Ocurrió un error al recuperar the Pedido Exchange Rate: {0}
it_it: Si è verificato un errore durante il recupero di the Ordine Exchange Rate: {0}
tr_tr: Order Exchange Rate getirilirken bir hata oluştu: {0}

# OrderExchangeRateService.GetRatesByOrderIdExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# OrderExchangeRateService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# OrderExchangeRateService.RateCreated
source: Order Exchange Rate created successfully.
ar_sa: أمر Exchange Rate تم إنشاؤه بنجاح.
de_de: Bestellung Exchange Rate erfolgreich erstellt.
es_es: Pedido Exchange Rate creado con éxito.
it_it: Ordine Exchange Rate creato/a con successo.
tr_tr: Order Exchange Rate başarıyla oluşturuldu.

# OrderExchangeRateService.RateDeleted
source: Order Exchange Rate deleted successfully.
ar_sa: أمر Exchange Rate تم حذفه بنجاح.
de_de: Bestellung Exchange Rate erfolgreich gelöscht.
es_es: Pedido Exchange Rate eliminado con éxito.
it_it: Ordine Exchange Rate eliminato/a con successo.
tr_tr: Order Exchange Rate başarıyla silindi.

# OrderExchangeRateService.RateNotFound
source: Order Exchange Rate not found.
ar_sa: أمر Exchange Rate غير موجود.
de_de: Bestellung Exchange Rate nicht gefunden.
es_es: Pedido Exchange Rate no encontrado.
it_it: Ordine Exchange Rate non trovato/a.
tr_tr: Order Exchange Rate bulunamadı.

# OrderExchangeRateService.RateRetrieved
source: Order Exchange Rate retrieved successfully.
ar_sa: أمر Exchange Rate تم استرجاعه بنجاح.
de_de: Bestellung Exchange Rate erfolgreich abgerufen.
es_es: Pedido Exchange Rate recuperado con éxito.
it_it: Ordine Exchange Rate recuperato/a con successo.
tr_tr: Order Exchange Rate başarıyla getirildi.

# OrderExchangeRateService.RateUpdated
source: Order Exchange Rate updated successfully.
ar_sa: أمر Exchange Rate تم تحديثه بنجاح.
de_de: Bestellung Exchange Rate erfolgreich aktualisiert.
es_es: Pedido Exchange Rate actualizado con éxito.
it_it: Ordine Exchange Rate aggiornato/a con successo.
tr_tr: Order Exchange Rate başarıyla güncellendi.

# OrderExchangeRateService.RatesRetrieved
source: Order Exchange Rates retrieved successfully.
ar_sa: أمر Exchange Rates تم استرجاعه بنجاح.
de_de: Bestellung Exchange Rates erfolgreich abgerufen.
es_es: Pedido Exchange Rates recuperado con éxito.
it_it: Ordine Exchange Rates recuperato/a con successo.
tr_tr: Order Exchange Rateler başarıyla getirildi.

# OrderExchangeRateService.UpdateRateExceptionMessage
source: An error occurred while updating the Order Exchange Rate: {0}
ar_sa: حدث خطأ أثناء تحديث the أمر Exchange Rate: {0}
de_de: Fehler beim Aktualisieren von the Bestellung Exchange Rate: {0}
es_es: Ocurrió un error al actualizar the Pedido Exchange Rate: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Ordine Exchange Rate: {0}
tr_tr: Order Exchange Rate güncellenirken bir hata oluştu: {0}

# DemandDocumentTypeService.DemandDocumentTypesRetrieved
source: Demand document types retrieved successfully.
ar_sa: عرض سعر document types تم استرجاعه بنجاح.
es_es: Cotización document types recuperado con éxito.
it_it: Preventivo document types recuperato/a con successo.
tr_tr: Talep doküman tipleri başarıyla getirildi.

# OrderDocumentTypeService.OrderDocumentTypesRetrieved
source: Order document types retrieved successfully.
ar_sa: عرض سعر document types تم استرجاعه بنجاح.
es_es: Cotización document types recuperado con éxito.
it_it: Preventivo document types recuperato/a con successo.
tr_tr: Sipariş doküman tipleri başarıyla getirildi.

# DemandDocumentTypeService.DemandDocumentTypeNotFound
source: Demand document type not found.
ar_sa: عرض سعر document type غير موجود.
es_es: Cotización document type no encontrado.
it_it: Preventivo document type non trovato/a.
tr_tr: Talep doküman tipi bulunamadı.

# OrderDocumentTypeService.OrderDocumentTypeNotFound
source: Order document type not found.
ar_sa: عرض سعر document type غير موجود.
es_es: Cotización document type no encontrado.
it_it: Preventivo document type non trovato/a.
tr_tr: Sipariş doküman tipi bulunamadı.

# DemandDocumentTypeService.DemandDocumentTypeRetrieved
source: Demand document type retrieved successfully.
ar_sa: عرض سعر document type تم استرجاعه بنجاح.
es_es: Cotización document type recuperado con éxito.
it_it: Preventivo document type recuperato/a con successo.
tr_tr: Talep doküman tipi başarıyla getirildi.

# OrderDocumentTypeService.OrderDocumentTypeRetrieved
source: Order document type retrieved successfully.
ar_sa: عرض سعر document type تم استرجاعه بنجاح.
es_es: Cotización document type recuperado con éxito.
it_it: Preventivo document type recuperato/a con successo.
tr_tr: Sipariş doküman tipi başarıyla getirildi.

# DemandDocumentTypeService.DemandDocumentTypeCreated
source: Demand document type created successfully.
ar_sa: عرض سعر document type تم إنشاؤه بنجاح.
es_es: Cotización document type creado con éxito.
it_it: Preventivo document type creato/a con successo.
tr_tr: Talep doküman tipi başarıyla oluşturuldu.

# OrderDocumentTypeService.OrderDocumentTypeCreated
source: Order document type created successfully.
ar_sa: عرض سعر document type تم إنشاؤه بنجاح.
es_es: Cotización document type creado con éxito.
it_it: Preventivo document type creato/a con successo.
tr_tr: Sipariş doküman tipi başarıyla oluşturuldu.

# DemandDocumentTypeService.DemandDocumentTypeUpdated
source: Demand document type updated successfully.
ar_sa: عرض سعر document type تم تحديثه بنجاح.
es_es: Cotización document type actualizado con éxito.
it_it: Preventivo document type aggiornato/a con successo.
tr_tr: Talep doküman tipi başarıyla güncellendi.

# OrderDocumentTypeService.OrderDocumentTypeUpdated
source: Order document type updated successfully.
ar_sa: عرض سعر document type تم تحديثه بنجاح.
es_es: Cotización document type actualizado con éxito.
it_it: Preventivo document type aggiornato/a con successo.
tr_tr: Sipariş doküman tipi başarıyla güncellendi.

# DemandDocumentTypeService.DemandDocumentTypeDeleted
source: Demand document type deleted successfully.
ar_sa: عرض سعر document type تم حذفه بنجاح.
es_es: Cotización document type eliminado con éxito.
it_it: Preventivo document type eliminato/a con successo.
tr_tr: Talep doküman tipi başarıyla silindi.

# OrderDocumentTypeService.OrderDocumentTypeDeleted
source: Order document type deleted successfully.
ar_sa: عرض سعر document type تم حذفه بنجاح.
es_es: Cotización document type eliminado con éxito.
it_it: Preventivo document type eliminato/a con successo.
tr_tr: Sipariş doküman tipi başarıyla silindi.

# DemandDocumentTypeService.DemandNumberGenerated
source: Demand number generated successfully.
tr_tr: Talep numarası başarıyla üretildi.

# OrderDocumentTypeService.OrderNumberGenerated
source: Order number generated successfully.
tr_tr: Sipariş numarası başarıyla üretildi.

# DemandLineApprovalService.DemandLineApprovalsRetrieved
source: Demand line approvals retrieved successfully.
ar_sa: عرض سعر line approvals تم استرجاعه بنجاح.
es_es: Cotización line approvals recuperado con éxito.
it_it: Preventivo line approvals recuperato/a con successo.
tr_tr: Talep satır onayları başarıyla getirildi.

# OrderLineApprovalService.OrderLineApprovalsRetrieved
source: Order line approvals retrieved successfully.
ar_sa: عرض سعر line approvals تم استرجاعه بنجاح.
es_es: Cotización line approvals recuperado con éxito.
it_it: Preventivo line approvals recuperato/a con successo.
tr_tr: Sipariş satır onayları başarıyla getirildi.

# DemandLineApprovalService.DemandLineApprovalNotFound
source: Demand line approval not found.
ar_sa: عرض سعر line approval غير موجود.
es_es: Cotización line approval no encontrado.
it_it: Preventivo line approval non trovato/a.
tr_tr: Talep satır onayı bulunamadı.

# OrderLineApprovalService.OrderLineApprovalNotFound
source: Order line approval not found.
ar_sa: عرض سعر line approval غير موجود.
es_es: Cotización line approval no encontrado.
it_it: Preventivo line approval non trovato/a.
tr_tr: Sipariş satır onayı bulunamadı.

# DemandLineApprovalService.DemandLineApprovalRetrieved
source: Demand line approval retrieved successfully.
ar_sa: عرض سعر line approval تم استرجاعه بنجاح.
es_es: Cotización line approval recuperado con éxito.
it_it: Preventivo line approval recuperato/a con successo.
tr_tr: Talep satır onayı başarıyla getirildi.

# OrderLineApprovalService.OrderLineApprovalRetrieved
source: Order line approval retrieved successfully.
ar_sa: عرض سعر line approval تم استرجاعه بنجاح.
es_es: Cotización line approval recuperado con éxito.
it_it: Preventivo line approval recuperato/a con successo.
tr_tr: Sipariş satır onayı başarıyla getirildi.

# DemandLineApprovalService.DemandLineApprovalCreated
source: Demand line approval created successfully.
ar_sa: عرض سعر line approval تم إنشاؤه بنجاح.
es_es: Cotización line approval creado con éxito.
it_it: Preventivo line approval creato/a con successo.
tr_tr: Talep satır onayı başarıyla oluşturuldu.

# OrderLineApprovalService.OrderLineApprovalCreated
source: Order line approval created successfully.
ar_sa: عرض سعر line approval تم إنشاؤه بنجاح.
es_es: Cotización line approval creado con éxito.
it_it: Preventivo line approval creato/a con successo.
tr_tr: Sipariş satır onayı başarıyla oluşturuldu.

# DemandLineApprovalService.DemandLineApprovalUpdated
source: Demand line approval updated successfully.
ar_sa: عرض سعر line approval تم تحديثه بنجاح.
es_es: Cotización line approval actualizado con éxito.
it_it: Preventivo line approval aggiornato/a con successo.
tr_tr: Talep satır onayı başarıyla güncellendi.

# OrderLineApprovalService.OrderLineApprovalUpdated
source: Order line approval updated successfully.
ar_sa: عرض سعر line approval تم تحديثه بنجاح.
es_es: Cotización line approval actualizado con éxito.
it_it: Preventivo line approval aggiornato/a con successo.
tr_tr: Sipariş satır onayı başarıyla güncellendi.

# DemandLineApprovalService.DemandLineApprovalDeleted
source: Demand line approval deleted successfully.
ar_sa: عرض سعر line approval تم حذفه بنجاح.
es_es: Cotización line approval eliminado con éxito.
it_it: Preventivo line approval eliminato/a con successo.
tr_tr: Talep satır onayı başarıyla silindi.

# OrderLineApprovalService.OrderLineApprovalDeleted
source: Order line approval deleted successfully.
ar_sa: عرض سعر line approval تم حذفه بنجاح.
es_es: Cotización line approval eliminado con éxito.
it_it: Preventivo line approval eliminato/a con successo.
tr_tr: Sipariş satır onayı başarıyla silindi.

# DemandApprovalService.DemandApprovalsRetrieved
source: Demand approvals retrieved successfully.
ar_sa: عرض سعر approvals تم استرجاعه بنجاح.
es_es: Cotización approvals recuperado con éxito.
it_it: Preventivo approvals recuperato/a con successo.
tr_tr: Talep onayları başarıyla getirildi.

# OrderApprovalService.OrderApprovalsRetrieved
source: Order approvals retrieved successfully.
ar_sa: عرض سعر approvals تم استرجاعه بنجاح.
es_es: Cotización approvals recuperado con éxito.
it_it: Preventivo approvals recuperato/a con successo.
tr_tr: Sipariş onayları başarıyla getirildi.

# DemandApprovalService.DemandApprovalNotFound
source: Demand approval not found.
ar_sa: عرض سعر approval غير موجود.
es_es: Cotización approval no encontrado.
it_it: Preventivo approval non trovato/a.
tr_tr: Talep onayı bulunamadı.

# OrderApprovalService.OrderApprovalNotFound
source: Order approval not found.
ar_sa: عرض سعر approval غير موجود.
es_es: Cotización approval no encontrado.
it_it: Preventivo approval non trovato/a.
tr_tr: Sipariş onayı bulunamadı.

# DemandApprovalService.DemandApprovalRetrieved
source: Demand approval retrieved successfully.
ar_sa: عرض سعر approval تم استرجاعه بنجاح.
es_es: Cotización approval recuperado con éxito.
it_it: Preventivo approval recuperato/a con successo.
tr_tr: Talep onayı başarıyla getirildi.

# OrderApprovalService.OrderApprovalRetrieved
source: Order approval retrieved successfully.
ar_sa: عرض سعر approval تم استرجاعه بنجاح.
es_es: Cotización approval recuperado con éxito.
it_it: Preventivo approval recuperato/a con successo.
tr_tr: Sipariş onayı başarıyla getirildi.

# DemandApprovalService.DemandApprovalCreated
source: Demand approval created successfully.
ar_sa: عرض سعر approval تم إنشاؤه بنجاح.
es_es: Cotización approval creado con éxito.
it_it: Preventivo approval creato/a con successo.
tr_tr: Talep onayı başarıyla oluşturuldu.

# OrderApprovalService.OrderApprovalCreated
source: Order approval created successfully.
ar_sa: عرض سعر approval تم إنشاؤه بنجاح.
es_es: Cotización approval creado con éxito.
it_it: Preventivo approval creato/a con successo.
tr_tr: Sipariş onayı başarıyla oluşturuldu.

# DemandApprovalService.DemandApprovalUpdated
source: Demand approval updated successfully.
ar_sa: عرض سعر approval تم تحديثه بنجاح.
es_es: Cotización approval actualizado con éxito.
it_it: Preventivo approval aggiornato/a con successo.
tr_tr: Talep onayı başarıyla güncellendi.

# OrderApprovalService.OrderApprovalUpdated
source: Order approval updated successfully.
ar_sa: عرض سعر approval تم تحديثه بنجاح.
es_es: Cotización approval actualizado con éxito.
it_it: Preventivo approval aggiornato/a con successo.
tr_tr: Sipariş onayı başarıyla güncellendi.

# DemandApprovalService.DemandApprovalDeleted
source: Demand approval deleted successfully.
ar_sa: عرض سعر approval تم حذفه بنجاح.
es_es: Cotización approval eliminado con éxito.
it_it: Preventivo approval eliminato/a con successo.
tr_tr: Talep onayı başarıyla silindi.

# OrderApprovalService.OrderApprovalDeleted
source: Order approval deleted successfully.
ar_sa: عرض سعر approval تم حذفه بنجاح.
es_es: Cotización approval eliminado con éxito.
it_it: Preventivo approval eliminato/a con successo.
tr_tr: Sipariş onayı başarıyla silindi.

source: Demand not found.
ar_sa: عرض سعر غير موجود.
es_es: Cotización no encontrado.
it_it: Preventivo non trovato/a.
tr_tr: Talep bulunamadı.

source: Order not found.
ar_sa: عرض سعر غير موجود.
es_es: Cotización no encontrado.
it_it: Preventivo non trovato/a.
tr_tr: Sipariş bulunamadı.

# Notification.QuotationApproval.Title
source: Quotation Pending Approval
ar_sa: Onay Bekleyen Teklif
es_es: Onay Bekleyen Teklif
tr_tr: Onay Bekleyen Teklif

# Notification.QuotationApproval.Message
source: Quotation {0} is pending approval.
ar_sa: {0} numaralı teklif onay beklemektedir.
es_es: {0} numaralı teklif onay beklemektedir.
tr_tr: {0} numaralı teklif onay beklemektedir.

# Notification.QuotationApproved.Title
source: Quotation Approved
ar_sa: Teklif Onaylandı
es_es: Teklif Onaylandı
tr_tr: Teklif Onaylandı

# Notification.QuotationApproved.Message
source: Quotation {0} has been approved.
ar_sa: {0} numaralı teklif onaylandı.
es_es: {0} numaralı teklif onaylandı.
tr_tr: {0} numaralı teklif onaylandı.

# Notification.OrderApproval.Title
source: Order Pending Approval
ar_sa: Onay Bekleyen Sipariş
es_es: Onay Bekleyen Sipariş
tr_tr: Onay Bekleyen Sipariş

# Notification.OrderApproval.Message
source: Order {0} is pending approval.
ar_sa: {0} numaralı sipariş onay beklemektedir.
es_es: {0} numaralı sipariş onay beklemektedir.
tr_tr: {0} numaralı sipariş onay beklemektedir.

# Notification.OrderApproved.Title
source: Order Approved
ar_sa: Sipariş Onaylandı
es_es: Sipariş Onaylandı
tr_tr: Sipariş Onaylandı

# Notification.OrderApproved.Message
source: Order {0} has been approved.
ar_sa: {0} numaralı sipariş onaylandı.
es_es: {0} numaralı sipariş onaylandı.
tr_tr: {0} numaralı sipariş onaylandı.

# Notification.DemandApproval.Title
source: Demand Pending Approval
ar_sa: Onay Bekleyen Talep
es_es: Onay Bekleyen Talep
tr_tr: Onay Bekleyen Talep

# Notification.DemandApproval.Message
source: Demand {0} is pending approval.
ar_sa: {0} numaralı talep onay beklemektedir.
es_es: {0} numaralı talep onay beklemektedir.
tr_tr: {0} numaralı talep onay beklemektedir.

# Notification.DemandApproved.Title
source: Demand Approved
ar_sa: Talep Onaylandı
es_es: Talep Onaylandı
tr_tr: Talep Onaylandı

# Notification.DemandApproved.Message
source: Demand {0} has been approved.
ar_sa: {0} numaralı talep onaylandı.
es_es: {0} numaralı talep onaylandı.
tr_tr: {0} numaralı talep onaylandı.
