Repository: cannasif-ship-it/verii_crm_api
Catalog: Resources/Messages.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, it_it, tr_tr

# ApprovalWorkflowService.ApprovalWorkflowRetrieved
source: Approval workflow retrieved successfully.
ar_sa: موافقة workflow تم استرجاعه بنجاح.
de_de: Genehmigung workflow erfolgreich abgerufen.
es_es: Aprobación workflow recuperado con éxito.
fr_fr: Approbation workflow récupéré(e) avec succès.
it_it: Approvazione workflow recuperato/a con successo.
tr_tr: Onay iş akışı başarıyla getirildi.

# ApprovalWorkflowService.ApprovalWorkflowCreated
source: Approval workflow created successfully.
ar_sa: موافقة workflow تم إنشاؤه بنجاح.
de_de: Genehmigung workflow erfolgreich erstellt.
es_es: Aprobación workflow creado con éxito.
fr_fr: Approbation workflow créé(e) avec succès.
it_it: Approvazione workflow creato/a con successo.
tr_tr: Onay iş akışı başarıyla oluşturuldu.

# ApprovalWorkflowService.ApprovalWorkflowUpdated
source: Approval workflow updated successfully.
ar_sa: موافقة workflow تم تحديثه بنجاح.
de_de: Genehmigung workflow erfolgreich aktualisiert.
es_es: Aprobación workflow actualizado con éxito.
fr_fr: Approbation workflow mis(e) à jour avec succès.
it_it: Approvazione workflow aggiornato/a con successo.
tr_tr: Onay iş akışı başarıyla güncellendi.

# ApprovalWorkflowService.ApprovalWorkflowDeleted
source: Approval workflow deleted successfully.
ar_sa: موافقة workflow تم حذفه بنجاح.
de_de: Genehmigung workflow erfolgreich gelöscht.
es_es: Aprobación workflow eliminado con éxito.
fr_fr: Approbation workflow supprimé(e) avec succès.
it_it: Approvazione workflow eliminato/a con successo.
tr_tr: Onay iş akışı başarıyla silindi.

# QuotationLineApprovalService.QuotationLineApprovalsRetrieved
source: Quotation line approvals retrieved successfully.
ar_sa: عرض سعر line approvals تم استرجاعه بنجاح.
de_de: Angebot line approvals erfolgreich abgerufen.
es_es: Cotización line approvals recuperado con éxito.
fr_fr: Devis line approvals récupéré(e) avec succès.
it_it: Preventivo line approvals recuperato/a con successo.
tr_tr: Teklif satır onayları başarıyla getirildi.

# QuotationLineApprovalService.QuotationLineApprovalNotFound
source: Quotation line approval not found.
ar_sa: عرض سعر line approval غير موجود.
de_de: Angebot line approval nicht gefunden.
es_es: Cotización line approval no encontrado.
fr_fr: Devis line approval non trouvé(e).
it_it: Preventivo line approval non trovato/a.
tr_tr: Teklif satır onayı bulunamadı.

# QuotationLineApprovalService.QuotationLineApprovalRetrieved
source: Quotation line approval retrieved successfully.
ar_sa: عرض سعر line approval تم استرجاعه بنجاح.
de_de: Angebot line approval erfolgreich abgerufen.
es_es: Cotización line approval recuperado con éxito.
fr_fr: Devis line approval récupéré(e) avec succès.
it_it: Preventivo line approval recuperato/a con successo.
tr_tr: Teklif satır onayı başarıyla getirildi.

# QuotationLineApprovalService.QuotationLineApprovalCreated
source: Quotation line approval created successfully.
ar_sa: عرض سعر line approval تم إنشاؤه بنجاح.
de_de: Angebot line approval erfolgreich erstellt.
es_es: Cotización line approval creado con éxito.
fr_fr: Devis line approval créé(e) avec succès.
it_it: Preventivo line approval creato/a con successo.
tr_tr: Teklif satır onayı başarıyla oluşturuldu.

# QuotationLineApprovalService.QuotationLineApprovalUpdated
source: Quotation line approval updated successfully.
ar_sa: عرض سعر line approval تم تحديثه بنجاح.
de_de: Angebot line approval erfolgreich aktualisiert.
es_es: Cotización line approval actualizado con éxito.
fr_fr: Devis line approval mis(e) à jour avec succès.
it_it: Preventivo line approval aggiornato/a con successo.
tr_tr: Teklif satır onayı başarıyla güncellendi.

# QuotationLineApprovalService.QuotationLineApprovalDeleted
source: Quotation line approval deleted successfully.
ar_sa: عرض سعر line approval تم حذفه بنجاح.
de_de: Angebot line approval erfolgreich gelöscht.
es_es: Cotización line approval eliminado con éxito.
fr_fr: Devis line approval supprimé(e) avec succès.
it_it: Preventivo line approval eliminato/a con successo.
tr_tr: Teklif satır onayı başarıyla silindi.

# QuotationApprovalService.QuotationApprovalsRetrieved
source: Quotation approvals retrieved successfully.
ar_sa: عرض سعر approvals تم استرجاعه بنجاح.
de_de: Angebot approvals erfolgreich abgerufen.
es_es: Cotización approvals recuperado con éxito.
fr_fr: Devis approvals récupéré(e) avec succès.
it_it: Preventivo approvals recuperato/a con successo.
tr_tr: Teklif onayları başarıyla getirildi.

# QuotationApprovalService.QuotationApprovalNotFound
source: Quotation approval not found.
ar_sa: عرض سعر approval غير موجود.
de_de: Angebot approval nicht gefunden.
es_es: Cotización approval no encontrado.
fr_fr: Devis approval non trouvé(e).
it_it: Preventivo approval non trovato/a.
tr_tr: Teklif onayı bulunamadı.

# QuotationApprovalService.QuotationApprovalRetrieved
source: Quotation approval retrieved successfully.
ar_sa: عرض سعر approval تم استرجاعه بنجاح.
de_de: Angebot approval erfolgreich abgerufen.
es_es: Cotización approval recuperado con éxito.
fr_fr: Devis approval récupéré(e) avec succès.
it_it: Preventivo approval recuperato/a con successo.
tr_tr: Teklif onayı başarıyla getirildi.

# QuotationApprovalService.QuotationApprovalCreated
source: Quotation approval created successfully.
ar_sa: عرض سعر approval تم إنشاؤه بنجاح.
de_de: Angebot approval erfolgreich erstellt.
es_es: Cotización approval creado con éxito.
fr_fr: Devis approval créé(e) avec succès.
it_it: Preventivo approval creato/a con successo.
tr_tr: Teklif onayı başarıyla oluşturuldu.

# QuotationApprovalService.QuotationApprovalUpdated
source: Quotation approval updated successfully.
ar_sa: عرض سعر approval تم تحديثه بنجاح.
de_de: Angebot approval erfolgreich aktualisiert.
es_es: Cotización approval actualizado con éxito.
fr_fr: Devis approval mis(e) à jour avec succès.
it_it: Preventivo approval aggiornato/a con successo.
tr_tr: Teklif onayı başarıyla güncellendi.

# QuotationApprovalService.QuotationApprovalDeleted
source: Quotation approval deleted successfully.
ar_sa: عرض سعر approval تم حذفه بنجاح.
de_de: Angebot approval erfolgreich gelöscht.
es_es: Cotización approval eliminado con éxito.
fr_fr: Devis approval supprimé(e) avec succès.
it_it: Preventivo approval eliminato/a con successo.
tr_tr: Teklif onayı başarıyla silindi.

# UserSessionService.UserSessionsRetrieved
source: User sessions retrieved successfully.
ar_sa: مستخدم sessions تم استرجاعه بنجاح.
de_de: Benutzer sessions erfolgreich abgerufen.
es_es: Usuario sessions recuperado con éxito.
fr_fr: Utilisateur sessions récupéré(e) avec succès.
it_it: Utente sessions recuperato/a con successo.
tr_tr: Kullanıcı oturumları başarıyla getirildi.

# UserSessionService.UserSessionNotFound
source: User session not found.
ar_sa: مستخدم session غير موجود.
de_de: Benutzer session nicht gefunden.
es_es: Usuario session no encontrado.
fr_fr: Utilisateur session non trouvé(e).
it_it: Utente session non trovato/a.
tr_tr: Kullanıcı oturumu bulunamadı.

# UserSessionService.UserSessionRetrieved
source: User session retrieved successfully.
ar_sa: مستخدم session تم استرجاعه بنجاح.
de_de: Benutzer session erfolgreich abgerufen.
es_es: Usuario session recuperado con éxito.
fr_fr: Utilisateur session récupéré(e) avec succès.
it_it: Utente session recuperato/a con successo.
tr_tr: Kullanıcı oturumu başarıyla getirildi.

# UserSessionService.UserSessionCreated
source: User session created successfully.
ar_sa: مستخدم session تم إنشاؤه بنجاح.
de_de: Benutzer session erfolgreich erstellt.
es_es: Usuario session creado con éxito.
fr_fr: Utilisateur session créé(e) avec succès.
it_it: Utente session creato/a con successo.
tr_tr: Kullanıcı oturumu başarıyla oluşturuldu.

# UserSessionService.UserSessionRevoked
source: User session revoked successfully.
tr_tr: Kullanıcı oturumu iptal edildi.

# UserSessionService.UserSessionDeleted
source: User session deleted successfully.
ar_sa: مستخدم session تم حذفه بنجاح.
de_de: Benutzer session erfolgreich gelöscht.
es_es: Usuario session eliminado con éxito.
fr_fr: Utilisateur session supprimé(e) avec succès.
it_it: Utente session eliminato/a con successo.
tr_tr: Kullanıcı oturumu başarıyla silindi.

# UserAuthorityService.UserAuthoritiesRetrieved
source: User authorities retrieved successfully.
ar_sa: مستخدم authorities تم استرجاعه بنجاح.
de_de: Benutzer authorities erfolgreich abgerufen.
es_es: Usuario authorities recuperado con éxito.
fr_fr: Utilisateur authorities récupéré(e) avec succès.
it_it: Utente authorities recuperato/a con successo.
tr_tr: Kullanıcı yetkileri başarıyla getirildi.

# UserAuthorityService.UserAuthorityNotFound
source: User authority not found.
ar_sa: مستخدم authority غير موجود.
de_de: Benutzer authority nicht gefunden.
es_es: Usuario authority no encontrado.
fr_fr: Utilisateur authority non trouvé(e).
it_it: Utente authority non trovato/a.
tr_tr: Kullanıcı yetkisi bulunamadı.

# UserAuthorityService.UserAuthorityRetrieved
source: User authority retrieved successfully.
ar_sa: مستخدم authority تم استرجاعه بنجاح.
de_de: Benutzer authority erfolgreich abgerufen.
es_es: Usuario authority recuperado con éxito.
fr_fr: Utilisateur authority récupéré(e) avec succès.
it_it: Utente authority recuperato/a con successo.
tr_tr: Kullanıcı yetkisi başarıyla getirildi.

# UserAuthorityService.UserAuthorityCreated
source: User authority created successfully.
ar_sa: مستخدم authority تم إنشاؤه بنجاح.
de_de: Benutzer authority erfolgreich erstellt.
es_es: Usuario authority creado con éxito.
fr_fr: Utilisateur authority créé(e) avec succès.
it_it: Utente authority creato/a con successo.
tr_tr: Kullanıcı yetkisi başarıyla oluşturuldu.

# UserAuthorityService.UserAuthorityUpdated
source: User authority updated successfully.
ar_sa: مستخدم authority تم تحديثه بنجاح.
de_de: Benutzer authority erfolgreich aktualisiert.
es_es: Usuario authority actualizado con éxito.
fr_fr: Utilisateur authority mis(e) à jour avec succès.
it_it: Utente authority aggiornato/a con successo.
tr_tr: Kullanıcı yetkisi başarıyla güncellendi.

# UserAuthorityService.UserAuthorityDeleted
source: User authority deleted successfully.
ar_sa: مستخدم authority تم حذفه بنجاح.
de_de: Benutzer authority erfolgreich gelöscht.
es_es: Usuario authority eliminado con éxito.
fr_fr: Utilisateur authority supprimé(e) avec succès.
it_it: Utente authority eliminato/a con successo.
tr_tr: Kullanıcı yetkisi başarıyla silindi.

# UserAuthorityService.ErrorRetrievingUserAuthorities
source: An error occurred while retrieving user authorities.
ar_sa: حدث خطأ أثناء استرجاع user authorities.
de_de: Fehler beim Abrufen von user authorities.
es_es: Ocurrió un error al recuperar user authorities.
fr_fr: Une erreur est survenue lors de la récupération de user authorities.
it_it: Si è verificato un errore durante il recupero di user authorities.
tr_tr: Kullanıcı yetkileri getirilirken bir hata oluştu.

# UserAuthorityService.ErrorRetrievingUserAuthority
source: An error occurred while retrieving the user authority.
ar_sa: حدث خطأ أثناء استرجاع the user authority.
de_de: Fehler beim Abrufen von the user authority.
es_es: Ocurrió un error al recuperar the user authority.
fr_fr: Une erreur est survenue lors de la récupération de the user authority.
it_it: Si è verificato un errore durante il recupero di the user authority.
tr_tr: Kullanıcı yetkisi getirilirken bir hata oluştu.

# UserAuthorityService.ErrorCreatingUserAuthority
source: An error occurred while creating the user authority.
ar_sa: حدث خطأ أثناء إنشاء the user authority.
de_de: Fehler beim Erstellen von the user authority.
es_es: Ocurrió un error al crear the user authority.
fr_fr: Une erreur est survenue lors de la création de the user authority.
it_it: Si è verificato un errore durante la creazione di the user authority.
tr_tr: Kullanıcı yetkisi oluşturulurken bir hata oluştu.

# UserAuthorityService.ErrorUpdatingUserAuthority
source: An error occurred while updating the user authority.
ar_sa: حدث خطأ أثناء تحديث the user authority.
de_de: Fehler beim Aktualisieren von the user authority.
es_es: Ocurrió un error al actualizar the user authority.
fr_fr: Une erreur est survenue lors de la mise à jour de the user authority.
it_it: Si è verificato un errore durante l'aggiornamento di the user authority.
tr_tr: Kullanıcı yetkisi güncellenirken bir hata oluştu.

# UserAuthorityService.ErrorDeletingUserAuthority
source: An error occurred while deleting the user authority.
ar_sa: حدث خطأ أثناء حذف the user authority.
de_de: Fehler beim Löschen von the user authority.
es_es: Ocurrió un error al eliminar the user authority.
fr_fr: Une erreur est survenue lors de la suppression de the user authority.
it_it: Si è verificato un errore durante l'eliminazione di the user authority.
tr_tr: Kullanıcı yetkisi silinirken bir hata oluştu.

# UserAuthorityService.ErrorCheckingExists
source: An error occurred while checking user authority existence.
tr_tr: Kullanıcı yetkisi varlığı kontrol edilirken bir hata oluştu.

# UserAuthorityService.CreateExceptionMessage
source: An error occurred while creating the User Authority: {0}
ar_sa: حدث خطأ أثناء إنشاء the مستخدم صلاحية: {0}
de_de: Fehler beim Erstellen von the Benutzer Berechtigung: {0}
es_es: Ocurrió un error al crear the Usuario Autoridad: {0}
fr_fr: Une erreur est survenue lors de la création de the Utilisateur Autorité: {0}
it_it: Si è verificato un errore durante la creazione di the Utente Autorità: {0}
tr_tr: User Authority oluşturulurken bir hata oluştu: {0}

# UserAuthorityService.ExistsExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# UserAuthorityService.GetAllExceptionMessage
source: An error occurred while retrieving User Authoritys: {0}
ar_sa: حدث خطأ أثناء استرجاع مستخدم Authoritys: {0}
de_de: Fehler beim Abrufen von Benutzer Authoritys: {0}
es_es: Ocurrió un error al recuperar Usuario Authoritys: {0}
fr_fr: Une erreur est survenue lors de la récupération de Utilisateur Authoritys: {0}
it_it: Si è verificato un errore durante il recupero di Utente Authoritys: {0}
tr_tr: User Authorityler getirilirken bir hata oluştu: {0}

# UserAuthorityService.GetByIdExceptionMessage
source: An error occurred while retrieving the User Authority: {0}
ar_sa: حدث خطأ أثناء استرجاع the مستخدم صلاحية: {0}
de_de: Fehler beim Abrufen von the Benutzer Berechtigung: {0}
es_es: Ocurrió un error al recuperar the Usuario Autoridad: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Utilisateur Autorité: {0}
it_it: Si è verificato un errore durante il recupero di the Utente Autorità: {0}
tr_tr: User Authority getirilirken bir hata oluştu: {0}

# UserAuthorityService.SoftDeleteExceptionMessage
source: An error occurred while deleting the User Authority: {0}
ar_sa: حدث خطأ أثناء حذف the مستخدم صلاحية: {0}
de_de: Fehler beim Löschen von the Benutzer Berechtigung: {0}
es_es: Ocurrió un error al eliminar the Usuario Autoridad: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Utilisateur Autorité: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Utente Autorità: {0}
tr_tr: User Authority silinirken bir hata oluştu: {0}

# UserAuthorityService.UpdateExceptionMessage
source: An error occurred while updating the User Authority: {0}
ar_sa: حدث خطأ أثناء تحديث the مستخدم صلاحية: {0}
de_de: Fehler beim Aktualisieren von the Benutzer Berechtigung: {0}
es_es: Ocurrió un error al actualizar the Usuario Autoridad: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Utilisateur Autorité: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Utente Autorità: {0}
tr_tr: User Authority güncellenirken bir hata oluştu: {0}

# FileUploadService.FileRequired
source: File is required.
tr_tr: Dosya gereklidir.

# FileUploadService.FileSizeExceeded
source: File size cannot exceed {0} MB.
tr_tr: Dosya boyutu {0} MB'dan büyük olamaz.

# FileUploadService.InvalidFileFormat
source: Invalid file format. Allowed formats: {0}
tr_tr: Geçersiz dosya formatı. İzin verilen formatlar: {0}

# FileUploadService.FileUploadedSuccessfully
source: File uploaded successfully.
tr_tr: Dosya başarıyla yüklendi.

# FileUploadService.FileUploadError
source: File upload error.
tr_tr: Dosya yükleme hatası.

# FileUploadService.FileUploadExceptionMessage
source: An error occurred while uploading the file: {0}
tr_tr: Dosya yüklenirken bir hata oluştu: {0}

# FileUploadService.NoFileToDelete
source: No file to delete.
tr_tr: Silinecek dosya bulunamadı.

# FileUploadService.InvalidFileUrl
source: Invalid file URL. Expected format: {0}, Received: {1}
tr_tr: Geçersiz dosya URL'i. Beklenen format: {0}, Alınan: {1}

# FileUploadService.FileDeletedSuccessfully
source: File deleted successfully.
ar_sa: ملف تم حذفه بنجاح.
de_de: Datei erfolgreich gelöscht.
es_es: Archivo eliminado con éxito.
fr_fr: Fichier supprimé(e) avec succès.
it_it: File eliminato/a con successo.
tr_tr: Dosya başarıyla silindi.

# FileUploadService.FileDeletionError
source: File deletion error.
tr_tr: Dosya silme hatası.

# FileUploadService.FileDeletionExceptionMessage
source: An error occurred while deleting the file: {0}
ar_sa: حدث خطأ أثناء حذف the file: {0}
de_de: Fehler beim Löschen von the file: {0}
es_es: Ocurrió un error al eliminar the file: {0}
fr_fr: Une erreur est survenue lors de la suppression de the file: {0}
it_it: Si è verificato un errore durante l'eliminazione di the file: {0}
tr_tr: Dosya silinirken bir hata oluştu: {0}

# UserDetailService.UserDetailNotFound
source: User detail not found.
ar_sa: مستخدم detail غير موجود.
de_de: Benutzer detail nicht gefunden.
es_es: Usuario detail no encontrado.
fr_fr: Utilisateur detail non trouvé(e).
it_it: Utente detail non trovato/a.
tr_tr: Kullanıcı detayı bulunamadı.

# UserDetailService.UserDetailRetrievedSuccessfully
source: User detail retrieved successfully.
ar_sa: مستخدم detail تم استرجاعه بنجاح.
de_de: Benutzer detail erfolgreich abgerufen.
es_es: Usuario detail recuperado con éxito.
fr_fr: Utilisateur detail récupéré(e) avec succès.
it_it: Utente detail recuperato/a con successo.
tr_tr: Kullanıcı detayı başarıyla getirildi.

# UserDetailService.UserDetailRetrievalError
source: User detail retrieval error.
tr_tr: Kullanıcı detayı getirme hatası.

# UserDetailService.UserDetailRetrievalExceptionMessage
source: An error occurred while retrieving user detail: {0}
ar_sa: حدث خطأ أثناء استرجاع user detail: {0}
de_de: Fehler beim Abrufen von user detail: {0}
es_es: Ocurrió un error al recuperar user detail: {0}
fr_fr: Une erreur est survenue lors de la récupération de user detail: {0}
it_it: Si è verificato un errore durante il recupero di user detail: {0}
tr_tr: Kullanıcı detayı getirilirken bir hata oluştu: {0}

# UserDetailService.ProfilePictureUploadExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# UserDetailService.UserDetailAlreadyExists
source: User Detail already exists.
tr_tr: User Detail zaten mevcut.

# UserDetailService.UserDetailCreatedSuccessfully
source: User Detail created successfully.
ar_sa: مستخدم Detail تم إنشاؤه بنجاح.
de_de: Benutzer Detail erfolgreich erstellt.
es_es: Usuario Detail creado con éxito.
fr_fr: Utilisateur Detail créé(e) avec succès.
it_it: Utente Detail creato/a con successo.
tr_tr: User Detail başarıyla oluşturuldu.

# UserDetailService.UserDetailCreationExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# UserDetailService.UserDetailDeletedSuccessfully
source: User Detail deleted successfully.
ar_sa: مستخدم Detail تم حذفه بنجاح.
de_de: Benutzer Detail erfolgreich gelöscht.
es_es: Usuario Detail eliminado con éxito.
fr_fr: Utilisateur Detail supprimé(e) avec succès.
it_it: Utente Detail eliminato/a con successo.
tr_tr: User Detail başarıyla silindi.

# UserDetailService.UserDetailDeletionExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# UserDetailService.UserDetailUpdateExceptionMessage
source: An error occurred while updating the User Detail: {0}
ar_sa: حدث خطأ أثناء تحديث the مستخدم Detail: {0}
de_de: Fehler beim Aktualisieren von the Benutzer Detail: {0}
es_es: Ocurrió un error al actualizar the Usuario Detail: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Utilisateur Detail: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Utente Detail: {0}
tr_tr: User Detail güncellenirken bir hata oluştu: {0}

# UserDetailService.UserDetailUpdatedSuccessfully
source: User Detail updated successfully.
ar_sa: مستخدم Detail تم تحديثه بنجاح.
de_de: Benutzer Detail erfolgreich aktualisiert.
es_es: Usuario Detail actualizado con éxito.
fr_fr: Utilisateur Detail mis(e) à jour avec succès.
it_it: Utente Detail aggiornato/a con successo.
tr_tr: User Detail başarıyla güncellendi.

# UserDetailService.UserNotFound
source: User Detail not found.
ar_sa: مستخدم Detail غير موجود.
de_de: Benutzer Detail nicht gefunden.
es_es: Usuario Detail no encontrado.
fr_fr: Utilisateur Detail non trouvé(e).
it_it: Utente Detail non trovato/a.
tr_tr: User Detail bulunamadı.

# UserDetailController.InvalidModelState
source: Invalid model state.
ar_sa: حالة النموذج غير صالحة.
de_de: Ungültiger Modellstatus.
es_es: Estado del modelo no válido.
fr_fr: État du modèle invalide.
it_it: Stato del modello non valido.
tr_tr: Geçersiz model durumu.

# UserDetailController.InvalidModelStateExceptionMessage
source: Model validation error: {0}
ar_sa: خطأ في التحقق من النموذج: {0}
de_de: Modellvalidierungsfehler: {0}
es_es: Error de validación del modelo: {0}
fr_fr: Erreur de validation du modèle: {0}
it_it: Errore di convalida del modello: {0}
tr_tr: Model doğrulama hatası: {0}

# ErpService.GetAllCariExceptionMessage
source: An error occurred while retrieving Cari records: {0}
ar_sa: حدث خطأ أثناء استرجاع Cari records: {0}
de_de: Fehler beim Abrufen von Cari records: {0}
es_es: Ocurrió un error al recuperar Cari records: {0}
fr_fr: Une erreur est survenue lors de la récupération de Cari records: {0}
it_it: Si è verificato un errore durante il recupero di Cari records: {0}
tr_tr: Cari kayıtları getirilirken bir hata oluştu: {0}

# ErpService.GetProductPricingExceptionMessage
source: An error occurred while retrieving product pricing: {0}
ar_sa: حدث خطأ أثناء استرجاع product pricing: {0}
de_de: Fehler beim Abrufen von product pricing: {0}
es_es: Ocurrió un error al recuperar product pricing: {0}
fr_fr: Une erreur est survenue lors de la récupération de product pricing: {0}
it_it: Si è verificato un errore durante il recupero di product pricing: {0}
tr_tr: Ürün fiyatlandırması getirilirken bir hata oluştu: {0}

# ErpService.HealthCheckExceptionMessage
source: An error occurred during health check: {0}
tr_tr: Sağlık kontrolü sırasında bir hata oluştu: {0}

# ErpService.BranchesRetrievedSuccessfully
source: Branch records retrieved successfully.
ar_sa: Branch records تم استرجاعه بنجاح.
de_de: Branch records erfolgreich abgerufen.
es_es: Branch records recuperado con éxito.
fr_fr: Branch records récupéré(e) avec succès.
it_it: Branch records recuperato/a con successo.
tr_tr: Şube kayıtları başarıyla getirildi.

# ErpService.BranchesRetrievalError
source: An error occurred while retrieving branch records: {0}
ar_sa: حدث خطأ أثناء استرجاع branch records: {0}
de_de: Fehler beim Abrufen von branch records: {0}
es_es: Ocurrió un error al recuperar branch records: {0}
fr_fr: Une erreur est survenue lors de la récupération de branch records: {0}
it_it: Si è verificato un errore durante il recupero di branch records: {0}
tr_tr: Şube kayıtları getirilirken bir hata oluştu: {0}

# StockSyncJob.Started
source: ERP stock synchronization started.
tr_tr: ERP stok senkronizasyonu başlatıldı.

# StockSyncJob.Completed
source: ERP stock synchronization completed.
tr_tr: ERP stok senkronizasyonu tamamlandı.

# StockSyncJob.Failed
source: ERP stock synchronization failed.
tr_tr: ERP stok senkronizasyonu başarısız oldu.
