Repository: cannasif-ship-it/verii_crm_api
Catalog: Resources/Messages.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, it_it, tr_tr

# DistrictService.DistrictDeleted
source: District deleted successfully.
ar_sa: منطقة تم حذفه بنجاح.
de_de: Bezirk erfolgreich gelöscht.
es_es: Distrito eliminado con éxito.
fr_fr: District supprimé(e) avec succès.
it_it: Distretto eliminato/a con successo.
tr_tr: İlçe başarıyla silindi.

# DistrictService.ErrorRetrievingDistricts
source: An error occurred while retrieving districts.
ar_sa: حدث خطأ أثناء استرجاع districts.
de_de: Fehler beim Abrufen von districts.
es_es: Ocurrió un error al recuperar districts.
fr_fr: Une erreur est survenue lors de la récupération de districts.
it_it: Si è verificato un errore durante il recupero di districts.
tr_tr: İlçeler getirilirken bir hata oluştu.

# DistrictService.ErrorRetrievingDistrict
source: An error occurred while retrieving the district.
ar_sa: حدث خطأ أثناء استرجاع the district.
de_de: Fehler beim Abrufen von the district.
es_es: Ocurrió un error al recuperar the district.
fr_fr: Une erreur est survenue lors de la récupération de the district.
it_it: Si è verificato un errore durante il recupero di the district.
tr_tr: İlçe getirilirken bir hata oluştu.

# DistrictService.ErrorCreatingDistrict
source: An error occurred while creating the district.
ar_sa: حدث خطأ أثناء إنشاء the district.
de_de: Fehler beim Erstellen von the district.
es_es: Ocurrió un error al crear the district.
fr_fr: Une erreur est survenue lors de la création de the district.
it_it: Si è verificato un errore durante la creazione di the district.
tr_tr: İlçe oluşturulurken bir hata oluştu.

# DistrictService.ErrorUpdatingDistrict
source: An error occurred while updating the district.
ar_sa: حدث خطأ أثناء تحديث the district.
de_de: Fehler beim Aktualisieren von the district.
es_es: Ocurrió un error al actualizar the district.
fr_fr: Une erreur est survenue lors de la mise à jour de the district.
it_it: Si è verificato un errore durante l'aggiornamento di the district.
tr_tr: İlçe güncellenirken bir hata oluştu.

# DistrictService.ErrorDeletingDistrict
source: An error occurred while deleting the district.
ar_sa: حدث خطأ أثناء حذف the district.
de_de: Fehler beim Löschen von the district.
es_es: Ocurrió un error al eliminar the district.
fr_fr: Une erreur est survenue lors de la suppression de the district.
it_it: Si è verificato un errore durante l'eliminazione di the district.
tr_tr: İlçe silinirken bir hata oluştu.

# DistrictService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# DistrictService.GetAllDistrictsExceptionMessage
source: An error occurred while retrieving districts: {0}
ar_sa: حدث خطأ أثناء استرجاع districts: {0}
de_de: Fehler beim Abrufen von districts: {0}
es_es: Ocurrió un error al recuperar districts: {0}
fr_fr: Une erreur est survenue lors de la récupération de districts: {0}
it_it: Si è verificato un errore durante il recupero di districts: {0}
tr_tr: İlçeler getirilirken bir hata oluştu: {0}

# DistrictService.GetDistrictByIdExceptionMessage
source: An error occurred while retrieving the district: {0}
ar_sa: حدث خطأ أثناء استرجاع the district: {0}
de_de: Fehler beim Abrufen von the district: {0}
es_es: Ocurrió un error al recuperar the district: {0}
fr_fr: Une erreur est survenue lors de la récupération de the district: {0}
it_it: Si è verificato un errore durante il recupero di the district: {0}
tr_tr: İlçe getirilirken bir hata oluştu: {0}

# DistrictService.CreateDistrictExceptionMessage
source: An error occurred while creating the district: {0}
ar_sa: حدث خطأ أثناء إنشاء the district: {0}
de_de: Fehler beim Erstellen von the district: {0}
es_es: Ocurrió un error al crear the district: {0}
fr_fr: Une erreur est survenue lors de la création de the district: {0}
it_it: Si è verificato un errore durante la creazione di the district: {0}
tr_tr: İlçe oluşturulurken bir hata oluştu: {0}

# DistrictService.UpdateDistrictExceptionMessage
source: An error occurred while updating the district: {0}
ar_sa: حدث خطأ أثناء تحديث the district: {0}
de_de: Fehler beim Aktualisieren von the district: {0}
es_es: Ocurrió un error al actualizar the district: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the district: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the district: {0}
tr_tr: İlçe güncellenirken bir hata oluştu: {0}

# DistrictService.DeleteDistrictExceptionMessage
source: An error occurred while deleting the district: {0}
ar_sa: حدث خطأ أثناء حذف the district: {0}
de_de: Fehler beim Löschen von the district: {0}
es_es: Ocurrió un error al eliminar the district: {0}
fr_fr: Une erreur est survenue lors de la suppression de the district: {0}
it_it: Si è verificato un errore durante l'eliminazione di the district: {0}
tr_tr: İlçe silinirken bir hata oluştu: {0}

# DistrictController.InvalidModelState
source: Invalid model state.
ar_sa: حالة النموذج غير صالحة.
de_de: Ungültiger Modellstatus.
es_es: Estado del modelo no válido.
fr_fr: État du modèle invalide.
it_it: Stato del modello non valido.
tr_tr: Geçersiz model durumu.

# DistrictController.InvalidModelStateExceptionMessage
source: Model validation error: {0}
ar_sa: خطأ في التحقق من النموذج: {0}
de_de: Modellvalidierungsfehler: {0}
es_es: Error de validación del modelo: {0}
fr_fr: Erreur de validation du modèle: {0}
it_it: Errore di convalida del modello: {0}
tr_tr: Model doğrulama hatası: {0}

# TitleService.TitlesRetrieved
source: Titles retrieved successfully.
ar_sa: Titles تم استرجاعه بنجاح.
de_de: Titles erfolgreich abgerufen.
es_es: Titles recuperado con éxito.
fr_fr: Titles récupéré(e) avec succès.
it_it: Titles recuperato/a con successo.
tr_tr: Unvanlar başarıyla getirildi.

# TitleService.TitleNotFound
source: Title not found.
ar_sa: Title غير موجود.
de_de: Title nicht gefunden.
es_es: Title no encontrado.
fr_fr: Title non trouvé(e).
it_it: Title non trovato/a.
tr_tr: Unvan bulunamadı.

# TitleService.TitleRetrieved
source: Title retrieved successfully.
ar_sa: Title تم استرجاعه بنجاح.
de_de: Title erfolgreich abgerufen.
es_es: Title recuperado con éxito.
fr_fr: Title récupéré(e) avec succès.
it_it: Title recuperato/a con successo.
tr_tr: Unvan başarıyla getirildi.

# TitleService.TitleCreated
source: Title created successfully.
ar_sa: Title تم إنشاؤه بنجاح.
de_de: Title erfolgreich erstellt.
es_es: Title creado con éxito.
fr_fr: Title créé(e) avec succès.
it_it: Title creato/a con successo.
tr_tr: Unvan başarıyla oluşturuldu.

# TitleService.TitleUpdated
source: Title updated successfully.
ar_sa: Title تم تحديثه بنجاح.
de_de: Title erfolgreich aktualisiert.
es_es: Title actualizado con éxito.
fr_fr: Title mis(e) à jour avec succès.
it_it: Title aggiornato/a con successo.
tr_tr: Unvan başarıyla güncellendi.

# TitleService.TitleDeleted
source: Title deleted successfully.
ar_sa: Title تم حذفه بنجاح.
de_de: Title erfolgreich gelöscht.
es_es: Title eliminado con éxito.
fr_fr: Title supprimé(e) avec succès.
it_it: Title eliminato/a con successo.
tr_tr: Unvan başarıyla silindi.

# TitleService.ErrorRetrievingTitles
source: An error occurred while retrieving titles.
ar_sa: حدث خطأ أثناء استرجاع titles.
de_de: Fehler beim Abrufen von titles.
es_es: Ocurrió un error al recuperar titles.
fr_fr: Une erreur est survenue lors de la récupération de titles.
it_it: Si è verificato un errore durante il recupero di titles.
tr_tr: Unvanlar getirilirken bir hata oluştu.

# TitleService.ErrorRetrievingTitle
source: An error occurred while retrieving the title.
ar_sa: حدث خطأ أثناء استرجاع the title.
de_de: Fehler beim Abrufen von the title.
es_es: Ocurrió un error al recuperar the title.
fr_fr: Une erreur est survenue lors de la récupération de the title.
it_it: Si è verificato un errore durante il recupero di the title.
tr_tr: Unvan getirilirken bir hata oluştu.

# TitleService.ErrorCreatingTitle
source: An error occurred while creating the title.
ar_sa: حدث خطأ أثناء إنشاء the title.
de_de: Fehler beim Erstellen von the title.
es_es: Ocurrió un error al crear the title.
fr_fr: Une erreur est survenue lors de la création de the title.
it_it: Si è verificato un errore durante la creazione di the title.
tr_tr: Unvan oluşturulurken bir hata oluştu.

# TitleService.ErrorUpdatingTitle
source: An error occurred while updating the title.
ar_sa: حدث خطأ أثناء تحديث the title.
de_de: Fehler beim Aktualisieren von the title.
es_es: Ocurrió un error al actualizar the title.
fr_fr: Une erreur est survenue lors de la mise à jour de the title.
it_it: Si è verificato un errore durante l'aggiornamento di the title.
tr_tr: Unvan güncellenirken bir hata oluştu.

# TitleService.ErrorDeletingTitle
source: An error occurred while deleting the title.
ar_sa: حدث خطأ أثناء حذف the title.
de_de: Fehler beim Löschen von the title.
es_es: Ocurrió un error al eliminar the title.
fr_fr: Une erreur est survenue lors de la suppression de the title.
it_it: Si è verificato un errore durante l'eliminazione di the title.
tr_tr: Unvan silinirken bir hata oluştu.

# TitleService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# TitleService.GetAllTitlesExceptionMessage
source: An error occurred while retrieving titles: {0}
ar_sa: حدث خطأ أثناء استرجاع titles: {0}
de_de: Fehler beim Abrufen von titles: {0}
es_es: Ocurrió un error al recuperar titles: {0}
fr_fr: Une erreur est survenue lors de la récupération de titles: {0}
it_it: Si è verificato un errore durante il recupero di titles: {0}
tr_tr: Ünvanlar getirilirken bir hata oluştu: {0}

# TitleService.GetTitleByIdExceptionMessage
source: An error occurred while retrieving the title: {0}
ar_sa: حدث خطأ أثناء استرجاع the title: {0}
de_de: Fehler beim Abrufen von the title: {0}
es_es: Ocurrió un error al recuperar the title: {0}
fr_fr: Une erreur est survenue lors de la récupération de the title: {0}
it_it: Si è verificato un errore durante il recupero di the title: {0}
tr_tr: Ünvan getirilirken bir hata oluştu: {0}

# TitleService.CreateTitleExceptionMessage
source: An error occurred while creating the title: {0}
ar_sa: حدث خطأ أثناء إنشاء the title: {0}
de_de: Fehler beim Erstellen von the title: {0}
es_es: Ocurrió un error al crear the title: {0}
fr_fr: Une erreur est survenue lors de la création de the title: {0}
it_it: Si è verificato un errore durante la creazione di the title: {0}
tr_tr: Ünvan oluşturulurken bir hata oluştu: {0}

# TitleService.UpdateTitleExceptionMessage
source: An error occurred while updating the title: {0}
ar_sa: حدث خطأ أثناء تحديث the title: {0}
de_de: Fehler beim Aktualisieren von the title: {0}
es_es: Ocurrió un error al actualizar the title: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the title: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the title: {0}
tr_tr: Ünvan güncellenirken bir hata oluştu: {0}

# TitleService.DeleteTitleExceptionMessage
source: An error occurred while deleting the title: {0}
ar_sa: حدث خطأ أثناء حذف the title: {0}
de_de: Fehler beim Löschen von the title: {0}
es_es: Ocurrió un error al eliminar the title: {0}
fr_fr: Une erreur est survenue lors de la suppression de the title: {0}
it_it: Si è verificato un errore durante l'eliminazione di the title: {0}
tr_tr: Ünvan silinirken bir hata oluştu: {0}

# TitleController.InvalidModelState
source: Invalid model state.
ar_sa: حالة النموذج غير صالحة.
de_de: Ungültiger Modellstatus.
es_es: Estado del modelo no válido.
fr_fr: État du modèle invalide.
it_it: Stato del modello non valido.
tr_tr: Geçersiz model durumu.

# TitleController.InvalidModelStateExceptionMessage
source: Model validation error: {0}
ar_sa: خطأ في التحقق من النموذج: {0}
de_de: Modellvalidierungsfehler: {0}
es_es: Error de validación del modelo: {0}
fr_fr: Erreur de validation du modèle: {0}
it_it: Errore di convalida del modello: {0}
tr_tr: Model doğrulama hatası: {0}

# CustomerService.CustomersRetrieved
source: Customers retrieved successfully.
ar_sa: عملاء تم استرجاعه بنجاح.
de_de: Kunden erfolgreich abgerufen.
es_es: Clientes recuperado con éxito.
fr_fr: Clients récupéré(e) avec succès.
it_it: Clienti recuperato/a con successo.
tr_tr: Müşteriler başarıyla getirildi.

# CustomerService.CustomerNotFound
source: Customer not found.
ar_sa: عميل غير موجود.
de_de: Kunde nicht gefunden.
es_es: Cliente no encontrado.
fr_fr: Client non trouvé(e).
it_it: Cliente non trovato/a.
tr_tr: Müşteri bulunamadı.

# CustomerService.CustomerRetrieved
source: Customer retrieved successfully.
ar_sa: عميل تم استرجاعه بنجاح.
de_de: Kunde erfolgreich abgerufen.
es_es: Cliente recuperado con éxito.
fr_fr: Client récupéré(e) avec succès.
it_it: Cliente recuperato/a con successo.
tr_tr: Müşteri başarıyla getirildi.

# CustomerService.CustomerCreated
source: Customer created successfully.
ar_sa: عميل تم إنشاؤه بنجاح.
de_de: Kunde erfolgreich erstellt.
es_es: Cliente creado con éxito.
fr_fr: Client créé(e) avec succès.
it_it: Cliente creato/a con successo.
tr_tr: Müşteri başarıyla oluşturuldu.

# CustomerService.CustomerUpdated
source: Customer updated successfully.
ar_sa: عميل تم تحديثه بنجاح.
de_de: Kunde erfolgreich aktualisiert.
es_es: Cliente actualizado con éxito.
fr_fr: Client mis(e) à jour avec succès.
it_it: Cliente aggiornato/a con successo.
tr_tr: Müşteri başarıyla güncellendi.

# CustomerService.CustomerDeleted
source: Customer deleted successfully.
ar_sa: عميل تم حذفه بنجاح.
de_de: Kunde erfolgreich gelöscht.
es_es: Cliente eliminado con éxito.
fr_fr: Client supprimé(e) avec succès.
it_it: Cliente eliminato/a con successo.
tr_tr: Müşteri başarıyla silindi.

# CustomerService.ErrorRetrievingCustomers
source: An error occurred while retrieving customers.
ar_sa: حدث خطأ أثناء استرجاع customers.
de_de: Fehler beim Abrufen von customers.
es_es: Ocurrió un error al recuperar customers.
fr_fr: Une erreur est survenue lors de la récupération de customers.
it_it: Si è verificato un errore durante il recupero di customers.
tr_tr: Müşteriler getirilirken bir hata oluştu.

# CustomerService.ErrorRetrievingCustomer
source: An error occurred while retrieving the customer.
ar_sa: حدث خطأ أثناء استرجاع the customer.
de_de: Fehler beim Abrufen von the customer.
es_es: Ocurrió un error al recuperar the customer.
fr_fr: Une erreur est survenue lors de la récupération de the customer.
it_it: Si è verificato un errore durante il recupero di the customer.
tr_tr: Müşteri getirilirken bir hata oluştu.

# CustomerService.ErrorCreatingCustomer
source: An error occurred while creating the customer.
ar_sa: حدث خطأ أثناء إنشاء the customer.
de_de: Fehler beim Erstellen von the customer.
es_es: Ocurrió un error al crear the customer.
fr_fr: Une erreur est survenue lors de la création de the customer.
it_it: Si è verificato un errore durante la creazione di the customer.
tr_tr: Müşteri oluşturulurken bir hata oluştu.

# CustomerService.ErrorUpdatingCustomer
source: An error occurred while updating the customer.
ar_sa: حدث خطأ أثناء تحديث the customer.
de_de: Fehler beim Aktualisieren von the customer.
es_es: Ocurrió un error al actualizar the customer.
fr_fr: Une erreur est survenue lors de la mise à jour de the customer.
it_it: Si è verificato un errore durante l'aggiornamento di the customer.
tr_tr: Müşteri güncellenirken bir hata oluştu.

# CustomerService.ErrorDeletingCustomer
source: An error occurred while deleting the customer.
ar_sa: حدث خطأ أثناء حذف the customer.
de_de: Fehler beim Löschen von the customer.
es_es: Ocurrió un error al eliminar the customer.
fr_fr: Une erreur est survenue lors de la suppression de the customer.
it_it: Si è verificato un errore durante l'eliminazione di the customer.
tr_tr: Müşteri silinirken bir hata oluştu.

# CustomerService.CreateCustomerExceptionMessage
source: An error occurred while creating the Customer: {0}
ar_sa: حدث خطأ أثناء إنشاء the عميل: {0}
de_de: Fehler beim Erstellen von the Kunde: {0}
es_es: Ocurrió un error al crear the Cliente: {0}
fr_fr: Une erreur est survenue lors de la création de the Client: {0}
it_it: Si è verificato un errore durante la creazione di the Cliente: {0}
tr_tr: Customer oluşturulurken bir hata oluştu: {0}

# CustomerService.DeleteCustomerExceptionMessage
source: An error occurred while deleting the Customer: {0}
ar_sa: حدث خطأ أثناء حذف the عميل: {0}
de_de: Fehler beim Löschen von the Kunde: {0}
es_es: Ocurrió un error al eliminar the Cliente: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Client: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Cliente: {0}
tr_tr: Customer silinirken bir hata oluştu: {0}

# CustomerService.GetAllCustomersExceptionMessage
source: An error occurred while retrieving Customers: {0}
ar_sa: حدث خطأ أثناء استرجاع عملاء: {0}
de_de: Fehler beim Abrufen von Kunden: {0}
es_es: Ocurrió un error al recuperar Clientes: {0}
fr_fr: Une erreur est survenue lors de la récupération de Clients: {0}
it_it: Si è verificato un errore durante il recupero di Clienti: {0}
tr_tr: Customerler getirilirken bir hata oluştu: {0}

# CustomerService.GetCustomerByIdExceptionMessage
source: An error occurred while retrieving the Customer: {0}
ar_sa: حدث خطأ أثناء استرجاع the عميل: {0}
de_de: Fehler beim Abrufen von the Kunde: {0}
es_es: Ocurrió un error al recuperar the Cliente: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Client: {0}
it_it: Si è verificato un errore durante il recupero di the Cliente: {0}
tr_tr: Customer getirilirken bir hata oluştu: {0}

# CustomerService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# CustomerService.UpdateCustomerExceptionMessage
source: An error occurred while updating the Customer: {0}
ar_sa: حدث خطأ أثناء تحديث the عميل: {0}
de_de: Fehler beim Aktualisieren von the Kunde: {0}
es_es: Ocurrió un error al actualizar the Cliente: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Client: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Cliente: {0}
tr_tr: Customer güncellenirken bir hata oluştu: {0}

# CustomerTypeService.CustomerTypesRetrieved
source: Customer types retrieved successfully.
ar_sa: عميل types تم استرجاعه بنجاح.
de_de: Kunde types erfolgreich abgerufen.
es_es: Cliente types recuperado con éxito.
fr_fr: Client types récupéré(e) avec succès.
it_it: Cliente types recuperato/a con successo.
tr_tr: Müşteri türleri başarıyla getirildi.

# CustomerTypeService.CustomerTypeNotFound
source: Customer type not found.
ar_sa: عميل type غير موجود.
de_de: Kunde type nicht gefunden.
es_es: Cliente type no encontrado.
fr_fr: Client type non trouvé(e).
it_it: Cliente type non trovato/a.
tr_tr: Müşteri türü bulunamadı.

# CustomerTypeService.CustomerTypeRetrieved
source: Customer type retrieved successfully.
ar_sa: عميل type تم استرجاعه بنجاح.
de_de: Kunde type erfolgreich abgerufen.
es_es: Cliente type recuperado con éxito.
fr_fr: Client type récupéré(e) avec succès.
it_it: Cliente type recuperato/a con successo.
tr_tr: Müşteri türü başarıyla getirildi.

# CustomerTypeService.CustomerTypeCreated
source: Customer type created successfully.
ar_sa: عميل type تم إنشاؤه بنجاح.
de_de: Kunde type erfolgreich erstellt.
es_es: Cliente type creado con éxito.
fr_fr: Client type créé(e) avec succès.
it_it: Cliente type creato/a con successo.
tr_tr: Müşteri türü başarıyla oluşturuldu.

# CustomerTypeService.CustomerTypeUpdated
source: Customer type updated successfully.
ar_sa: عميل type تم تحديثه بنجاح.
de_de: Kunde type erfolgreich aktualisiert.
es_es: Cliente type actualizado con éxito.
fr_fr: Client type mis(e) à jour avec succès.
it_it: Cliente type aggiornato/a con successo.
tr_tr: Müşteri türü başarıyla güncellendi.

# CustomerTypeService.CustomerTypeDeleted
source: Customer type deleted successfully.
ar_sa: عميل type تم حذفه بنجاح.
de_de: Kunde type erfolgreich gelöscht.
es_es: Cliente type eliminado con éxito.
fr_fr: Client type supprimé(e) avec succès.
it_it: Cliente type eliminato/a con successo.
tr_tr: Müşteri türü başarıyla silindi.

# CustomerTypeService.ErrorRetrievingCustomerTypes
source: An error occurred while retrieving customer types.
ar_sa: حدث خطأ أثناء استرجاع customer types.
de_de: Fehler beim Abrufen von customer types.
es_es: Ocurrió un error al recuperar customer types.
fr_fr: Une erreur est survenue lors de la récupération de customer types.
it_it: Si è verificato un errore durante il recupero di customer types.
tr_tr: Müşteri türleri getirilirken bir hata oluştu.

# CustomerTypeService.ErrorRetrievingCustomerType
source: An error occurred while retrieving the customer type.
ar_sa: حدث خطأ أثناء استرجاع the customer type.
de_de: Fehler beim Abrufen von the customer type.
es_es: Ocurrió un error al recuperar the customer type.
fr_fr: Une erreur est survenue lors de la récupération de the customer type.
it_it: Si è verificato un errore durante il recupero di the customer type.
tr_tr: Müşteri türü getirilirken bir hata oluştu.

# CustomerTypeService.ErrorCreatingCustomerType
source: An error occurred while creating the customer type.
ar_sa: حدث خطأ أثناء إنشاء the customer type.
de_de: Fehler beim Erstellen von the customer type.
es_es: Ocurrió un error al crear the customer type.
fr_fr: Une erreur est survenue lors de la création de the customer type.
it_it: Si è verificato un errore durante la creazione di the customer type.
tr_tr: Müşteri türü oluşturulurken bir hata oluştu.

# CustomerTypeService.ErrorUpdatingCustomerType
source: An error occurred while updating the customer type.
ar_sa: حدث خطأ أثناء تحديث the customer type.
de_de: Fehler beim Aktualisieren von the customer type.
es_es: Ocurrió un error al actualizar the customer type.
fr_fr: Une erreur est survenue lors de la mise à jour de the customer type.
it_it: Si è verificato un errore durante l'aggiornamento di the customer type.
tr_tr: Müşteri türü güncellenirken bir hata oluştu.

# CustomerTypeService.ErrorDeletingCustomerType
source: An error occurred while deleting the customer type.
ar_sa: حدث خطأ أثناء حذف the customer type.
de_de: Fehler beim Löschen von the customer type.
es_es: Ocurrió un error al eliminar the customer type.
fr_fr: Une erreur est survenue lors de la suppression de the customer type.
it_it: Si è verificato un errore durante l'eliminazione di the customer type.
tr_tr: Müşteri türü silinirken bir hata oluştu.

# CustomerTypeService.CreateCustomerTypeExceptionMessage
source: An error occurred while creating the Customer Type: {0}
ar_sa: حدث خطأ أثناء إنشاء the عميل نوع: {0}
de_de: Fehler beim Erstellen von the Kunde Typ: {0}
es_es: Ocurrió un error al crear the Cliente Tipo: {0}
fr_fr: Une erreur est survenue lors de la création de the Client Type: {0}
it_it: Si è verificato un errore durante la creazione di the Cliente Tipo: {0}
tr_tr: Customer Type oluşturulurken bir hata oluştu: {0}
