Repository: cannasif-ship-it/verii_crm_api
Catalog: Resources/Messages.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, it_it, tr_tr

# ApprovalFlowStepService.UpdateApprovalFlowStepExceptionMessage
source: An error occurred while updating approval flow step: {0}
ar_sa: حدث خطأ أثناء تحديث approval flow step: {0}
de_de: Fehler beim Aktualisieren von approval flow step: {0}
es_es: Ocurrió un error al actualizar approval flow step: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de approval flow step: {0}
it_it: Si è verificato un errore durante l'aggiornamento di approval flow step: {0}
tr_tr: Onay akış adımı güncellenirken bir hata oluştu: {0}

# ApprovalFlowStepService.DeleteApprovalFlowStepExceptionMessage
source: An error occurred while deleting approval flow step: {0}
ar_sa: حدث خطأ أثناء حذف approval flow step: {0}
de_de: Fehler beim Löschen von approval flow step: {0}
es_es: Ocurrió un error al eliminar approval flow step: {0}
fr_fr: Une erreur est survenue lors de la suppression de approval flow step: {0}
it_it: Si è verificato un errore durante l'eliminazione di approval flow step: {0}
tr_tr: Onay akış adımı silinirken bir hata oluştu: {0}

# ApprovalRequestService.ApprovalRequestsRetrieved
source: Approval requests retrieved successfully.
ar_sa: موافقة requests تم استرجاعه بنجاح.
de_de: Genehmigung requests erfolgreich abgerufen.
es_es: Aprobación requests recuperado con éxito.
fr_fr: Approbation requests récupéré(e) avec succès.
it_it: Approvazione requests recuperato/a con successo.
tr_tr: Onay talepleri başarıyla getirildi.

# ApprovalRequestService.ApprovalRequestRetrieved
source: Approval request retrieved successfully.
ar_sa: موافقة request تم استرجاعه بنجاح.
de_de: Genehmigung request erfolgreich abgerufen.
es_es: Aprobación request recuperado con éxito.
fr_fr: Approbation request récupéré(e) avec succès.
it_it: Approvazione request recuperato/a con successo.
tr_tr: Onay talebi başarıyla getirildi.

# ApprovalRequestService.ApprovalRequestNotFound
source: Approval request not found.
ar_sa: موافقة request غير موجود.
de_de: Genehmigung request nicht gefunden.
es_es: Aprobación request no encontrado.
fr_fr: Approbation request non trouvé(e).
it_it: Approvazione request non trovato/a.
tr_tr: Onay talebi bulunamadı.

# ApprovalRequestService.ApprovalRequestCreated
source: Approval request created successfully.
ar_sa: موافقة request تم إنشاؤه بنجاح.
de_de: Genehmigung request erfolgreich erstellt.
es_es: Aprobación request creado con éxito.
fr_fr: Approbation request créé(e) avec succès.
it_it: Approvazione request creato/a con successo.
tr_tr: Onay talebi başarıyla oluşturuldu.

# ApprovalRequestService.ApprovalRequestUpdated
source: Approval request updated successfully.
ar_sa: موافقة request تم تحديثه بنجاح.
de_de: Genehmigung request erfolgreich aktualisiert.
es_es: Aprobación request actualizado con éxito.
fr_fr: Approbation request mis(e) à jour avec succès.
it_it: Approvazione request aggiornato/a con successo.
tr_tr: Onay talebi başarıyla güncellendi.

# ApprovalRequestService.ApprovalRequestDeleted
source: Approval request deleted successfully.
ar_sa: موافقة request تم حذفه بنجاح.
de_de: Genehmigung request erfolgreich gelöscht.
es_es: Aprobación request eliminado con éxito.
fr_fr: Approbation request supprimé(e) avec succès.
it_it: Approvazione request eliminato/a con successo.
tr_tr: Onay talebi başarıyla silindi.

# ApprovalRequestService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# ApprovalRequestService.GetAllApprovalRequestsExceptionMessage
source: An error occurred while retrieving approval requests: {0}
ar_sa: حدث خطأ أثناء استرجاع approval requests: {0}
de_de: Fehler beim Abrufen von approval requests: {0}
es_es: Ocurrió un error al recuperar approval requests: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval requests: {0}
it_it: Si è verificato un errore durante il recupero di approval requests: {0}
tr_tr: Onay talepleri getirilirken bir hata oluştu: {0}

# ApprovalRequestService.GetApprovalRequestByIdExceptionMessage
source: An error occurred while retrieving approval request: {0}
ar_sa: حدث خطأ أثناء استرجاع approval request: {0}
de_de: Fehler beim Abrufen von approval request: {0}
es_es: Ocurrió un error al recuperar approval request: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval request: {0}
it_it: Si è verificato un errore durante il recupero di approval request: {0}
tr_tr: Onay talebi getirilirken bir hata oluştu: {0}

# ApprovalRequestService.CreateApprovalRequestExceptionMessage
source: An error occurred while creating approval request: {0}
ar_sa: حدث خطأ أثناء إنشاء approval request: {0}
de_de: Fehler beim Erstellen von approval request: {0}
es_es: Ocurrió un error al crear approval request: {0}
fr_fr: Une erreur est survenue lors de la création de approval request: {0}
it_it: Si è verificato un errore durante la creazione di approval request: {0}
tr_tr: Onay talebi oluşturulurken bir hata oluştu: {0}

# ApprovalRequestService.UpdateApprovalRequestExceptionMessage
source: An error occurred while updating approval request: {0}
ar_sa: حدث خطأ أثناء تحديث approval request: {0}
de_de: Fehler beim Aktualisieren von approval request: {0}
es_es: Ocurrió un error al actualizar approval request: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de approval request: {0}
it_it: Si è verificato un errore durante l'aggiornamento di approval request: {0}
tr_tr: Onay talebi güncellenirken bir hata oluştu: {0}

# ApprovalRequestService.DeleteApprovalRequestExceptionMessage
source: An error occurred while deleting approval request: {0}
ar_sa: حدث خطأ أثناء حذف approval request: {0}
de_de: Fehler beim Löschen von approval request: {0}
es_es: Ocurrió un error al eliminar approval request: {0}
fr_fr: Une erreur est survenue lors de la suppression de approval request: {0}
it_it: Si è verificato un errore durante l'eliminazione di approval request: {0}
tr_tr: Onay talebi silinirken bir hata oluştu: {0}

# ApprovalRoleGroupService.ApprovalRoleGroupsRetrieved
source: Approval role groups retrieved successfully.
ar_sa: موافقة role groups تم استرجاعه بنجاح.
de_de: Genehmigung role groups erfolgreich abgerufen.
es_es: Aprobación role groups recuperado con éxito.
fr_fr: Approbation role groups récupéré(e) avec succès.
it_it: Approvazione role groups recuperato/a con successo.
tr_tr: Onay rol grupları başarıyla getirildi.

# ApprovalRoleGroupService.ApprovalRoleGroupRetrieved
source: Approval role group retrieved successfully.
ar_sa: موافقة role group تم استرجاعه بنجاح.
de_de: Genehmigung role group erfolgreich abgerufen.
es_es: Aprobación role group recuperado con éxito.
fr_fr: Approbation role group récupéré(e) avec succès.
it_it: Approvazione role group recuperato/a con successo.
tr_tr: Onay rol grubu başarıyla getirildi.

# ApprovalRoleGroupService.ApprovalRoleGroupNotFound
source: Approval role group not found.
ar_sa: موافقة role group غير موجود.
de_de: Genehmigung role group nicht gefunden.
es_es: Aprobación role group no encontrado.
fr_fr: Approbation role group non trouvé(e).
it_it: Approvazione role group non trovato/a.
tr_tr: Onay rol grubu bulunamadı.

# ApprovalRoleGroupService.ApprovalRoleGroupCreated
source: Approval role group created successfully.
ar_sa: موافقة role group تم إنشاؤه بنجاح.
de_de: Genehmigung role group erfolgreich erstellt.
es_es: Aprobación role group creado con éxito.
fr_fr: Approbation role group créé(e) avec succès.
it_it: Approvazione role group creato/a con successo.
tr_tr: Onay rol grubu başarıyla oluşturuldu.

# ApprovalRoleGroupService.ApprovalRoleGroupUpdated
source: Approval role group updated successfully.
ar_sa: موافقة role group تم تحديثه بنجاح.
de_de: Genehmigung role group erfolgreich aktualisiert.
es_es: Aprobación role group actualizado con éxito.
fr_fr: Approbation role group mis(e) à jour avec succès.
it_it: Approvazione role group aggiornato/a con successo.
tr_tr: Onay rol grubu başarıyla güncellendi.

# ApprovalRoleGroupService.ApprovalRoleGroupDeleted
source: Approval role group deleted successfully.
ar_sa: موافقة role group تم حذفه بنجاح.
de_de: Genehmigung role group erfolgreich gelöscht.
es_es: Aprobación role group eliminado con éxito.
fr_fr: Approbation role group supprimé(e) avec succès.
it_it: Approvazione role group eliminato/a con successo.
tr_tr: Onay rol grubu başarıyla silindi.

# ApprovalRoleGroupService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# ApprovalRoleGroupService.GetAllApprovalRoleGroupsExceptionMessage
source: An error occurred while retrieving approval role groups: {0}
ar_sa: حدث خطأ أثناء استرجاع approval role groups: {0}
de_de: Fehler beim Abrufen von approval role groups: {0}
es_es: Ocurrió un error al recuperar approval role groups: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval role groups: {0}
it_it: Si è verificato un errore durante il recupero di approval role groups: {0}
tr_tr: Onay rol grupları getirilirken bir hata oluştu: {0}

# ApprovalRoleGroupService.GetApprovalRoleGroupByIdExceptionMessage
source: An error occurred while retrieving approval role group: {0}
ar_sa: حدث خطأ أثناء استرجاع approval role group: {0}
de_de: Fehler beim Abrufen von approval role group: {0}
es_es: Ocurrió un error al recuperar approval role group: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval role group: {0}
it_it: Si è verificato un errore durante il recupero di approval role group: {0}
tr_tr: Onay rol grubu getirilirken bir hata oluştu: {0}

# ApprovalRoleGroupService.CreateApprovalRoleGroupExceptionMessage
source: An error occurred while creating approval role group: {0}
ar_sa: حدث خطأ أثناء إنشاء approval role group: {0}
de_de: Fehler beim Erstellen von approval role group: {0}
es_es: Ocurrió un error al crear approval role group: {0}
fr_fr: Une erreur est survenue lors de la création de approval role group: {0}
it_it: Si è verificato un errore durante la creazione di approval role group: {0}
tr_tr: Onay rol grubu oluşturulurken bir hata oluştu: {0}

# ApprovalRoleGroupService.UpdateApprovalRoleGroupExceptionMessage
source: An error occurred while updating approval role group: {0}
ar_sa: حدث خطأ أثناء تحديث approval role group: {0}
de_de: Fehler beim Aktualisieren von approval role group: {0}
es_es: Ocurrió un error al actualizar approval role group: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de approval role group: {0}
it_it: Si è verificato un errore durante l'aggiornamento di approval role group: {0}
tr_tr: Onay rol grubu güncellenirken bir hata oluştu: {0}

# ApprovalRoleGroupService.DeleteApprovalRoleGroupExceptionMessage
source: An error occurred while deleting approval role group: {0}
ar_sa: حدث خطأ أثناء حذف approval role group: {0}
de_de: Fehler beim Löschen von approval role group: {0}
es_es: Ocurrió un error al eliminar approval role group: {0}
fr_fr: Une erreur est survenue lors de la suppression de approval role group: {0}
it_it: Si è verificato un errore durante l'eliminazione di approval role group: {0}
tr_tr: Onay rol grubu silinirken bir hata oluştu: {0}

# ApprovalRoleService.ApprovalRolesRetrieved
source: Approval roles retrieved successfully.
ar_sa: موافقة roles تم استرجاعه بنجاح.
de_de: Genehmigung roles erfolgreich abgerufen.
es_es: Aprobación roles recuperado con éxito.
fr_fr: Approbation roles récupéré(e) avec succès.
it_it: Approvazione roles recuperato/a con successo.
tr_tr: Onay rolleri başarıyla getirildi.

# ApprovalRoleService.ApprovalRoleRetrieved
source: Approval role retrieved successfully.
ar_sa: موافقة role تم استرجاعه بنجاح.
de_de: Genehmigung role erfolgreich abgerufen.
es_es: Aprobación role recuperado con éxito.
fr_fr: Approbation role récupéré(e) avec succès.
it_it: Approvazione role recuperato/a con successo.
tr_tr: Onay rolü başarıyla getirildi.

# ApprovalRoleService.ApprovalRoleNotFound
source: Approval role not found.
ar_sa: موافقة role غير موجود.
de_de: Genehmigung role nicht gefunden.
es_es: Aprobación role no encontrado.
fr_fr: Approbation role non trouvé(e).
it_it: Approvazione role non trovato/a.
tr_tr: Onay rolü bulunamadı.

# ApprovalRoleService.ApprovalRoleCreated
source: Approval role created successfully.
ar_sa: موافقة role تم إنشاؤه بنجاح.
de_de: Genehmigung role erfolgreich erstellt.
es_es: Aprobación role creado con éxito.
fr_fr: Approbation role créé(e) avec succès.
it_it: Approvazione role creato/a con successo.
tr_tr: Onay rolü başarıyla oluşturuldu.

# ApprovalRoleService.ApprovalRoleUpdated
source: Approval role updated successfully.
ar_sa: موافقة role تم تحديثه بنجاح.
de_de: Genehmigung role erfolgreich aktualisiert.
es_es: Aprobación role actualizado con éxito.
fr_fr: Approbation role mis(e) à jour avec succès.
it_it: Approvazione role aggiornato/a con successo.
tr_tr: Onay rolü başarıyla güncellendi.

# ApprovalRoleService.ApprovalRoleDeleted
source: Approval role deleted successfully.
ar_sa: موافقة role تم حذفه بنجاح.
de_de: Genehmigung role erfolgreich gelöscht.
es_es: Aprobación role eliminado con éxito.
fr_fr: Approbation role supprimé(e) avec succès.
it_it: Approvazione role eliminato/a con successo.
tr_tr: Onay rolü başarıyla silindi.

# ApprovalRoleService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# ApprovalRoleService.GetAllApprovalRolesExceptionMessage
source: An error occurred while retrieving approval roles: {0}
ar_sa: حدث خطأ أثناء استرجاع approval roles: {0}
de_de: Fehler beim Abrufen von approval roles: {0}
es_es: Ocurrió un error al recuperar approval roles: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval roles: {0}
it_it: Si è verificato un errore durante il recupero di approval roles: {0}
tr_tr: Onay rolleri getirilirken bir hata oluştu: {0}

# ApprovalRoleService.GetApprovalRoleByIdExceptionMessage
source: An error occurred while retrieving approval role: {0}
ar_sa: حدث خطأ أثناء استرجاع approval role: {0}
de_de: Fehler beim Abrufen von approval role: {0}
es_es: Ocurrió un error al recuperar approval role: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval role: {0}
it_it: Si è verificato un errore durante il recupero di approval role: {0}
tr_tr: Onay rolü getirilirken bir hata oluştu: {0}

# ApprovalRoleService.CreateApprovalRoleExceptionMessage
source: An error occurred while creating approval role: {0}
ar_sa: حدث خطأ أثناء إنشاء approval role: {0}
de_de: Fehler beim Erstellen von approval role: {0}
es_es: Ocurrió un error al crear approval role: {0}
fr_fr: Une erreur est survenue lors de la création de approval role: {0}
it_it: Si è verificato un errore durante la creazione di approval role: {0}
tr_tr: Onay rolü oluşturulurken bir hata oluştu: {0}

# ApprovalRoleService.UpdateApprovalRoleExceptionMessage
source: An error occurred while updating approval role: {0}
ar_sa: حدث خطأ أثناء تحديث approval role: {0}
de_de: Fehler beim Aktualisieren von approval role: {0}
es_es: Ocurrió un error al actualizar approval role: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de approval role: {0}
it_it: Si è verificato un errore durante l'aggiornamento di approval role: {0}
tr_tr: Onay rolü güncellenirken bir hata oluştu: {0}

# ApprovalRoleService.DeleteApprovalRoleExceptionMessage
source: An error occurred while deleting approval role: {0}
ar_sa: حدث خطأ أثناء حذف approval role: {0}
de_de: Fehler beim Löschen von approval role: {0}
es_es: Ocurrió un error al eliminar approval role: {0}
fr_fr: Une erreur est survenue lors de la suppression de approval role: {0}
it_it: Si è verificato un errore durante l'eliminazione di approval role: {0}
tr_tr: Onay rolü silinirken bir hata oluştu: {0}

# ApprovalUserRoleService.ApprovalUserRolesRetrieved
source: Approval user roles retrieved successfully.
ar_sa: موافقة user roles تم استرجاعه بنجاح.
de_de: Genehmigung user roles erfolgreich abgerufen.
es_es: Aprobación user roles recuperado con éxito.
fr_fr: Approbation user roles récupéré(e) avec succès.
it_it: Approvazione user roles recuperato/a con successo.
tr_tr: Onay kullanıcı rolleri başarıyla getirildi.

# ApprovalUserRoleService.ApprovalUserRoleRetrieved
source: Approval user role retrieved successfully.
ar_sa: موافقة user role تم استرجاعه بنجاح.
de_de: Genehmigung user role erfolgreich abgerufen.
es_es: Aprobación user role recuperado con éxito.
fr_fr: Approbation user role récupéré(e) avec succès.
it_it: Approvazione user role recuperato/a con successo.
tr_tr: Onay kullanıcı rolü başarıyla getirildi.

# ApprovalUserRoleService.ApprovalUserRoleNotFound
source: Approval user role not found.
ar_sa: موافقة user role غير موجود.
de_de: Genehmigung user role nicht gefunden.
es_es: Aprobación user role no encontrado.
fr_fr: Approbation user role non trouvé(e).
it_it: Approvazione user role non trovato/a.
tr_tr: Onay kullanıcı rolü bulunamadı.

# ApprovalUserRoleService.ApprovalUserRoleCreated
source: Approval user role created successfully.
ar_sa: موافقة user role تم إنشاؤه بنجاح.
de_de: Genehmigung user role erfolgreich erstellt.
es_es: Aprobación user role creado con éxito.
fr_fr: Approbation user role créé(e) avec succès.
it_it: Approvazione user role creato/a con successo.
tr_tr: Onay kullanıcı rolü başarıyla oluşturuldu.

# ApprovalUserRoleService.ApprovalUserRoleUpdated
source: Approval user role updated successfully.
ar_sa: موافقة user role تم تحديثه بنجاح.
de_de: Genehmigung user role erfolgreich aktualisiert.
es_es: Aprobación user role actualizado con éxito.
fr_fr: Approbation user role mis(e) à jour avec succès.
it_it: Approvazione user role aggiornato/a con successo.
tr_tr: Onay kullanıcı rolü başarıyla güncellendi.

# ApprovalUserRoleService.ApprovalUserRoleDeleted
source: Approval user role deleted successfully.
ar_sa: موافقة user role تم حذفه بنجاح.
de_de: Genehmigung user role erfolgreich gelöscht.
es_es: Aprobación user role eliminado con éxito.
fr_fr: Approbation user role supprimé(e) avec succès.
it_it: Approvazione user role eliminato/a con successo.
tr_tr: Onay kullanıcı rolü başarıyla silindi.

# ApprovalUserRoleService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# ApprovalUserRoleService.GetAllApprovalUserRolesExceptionMessage
source: An error occurred while retrieving approval user roles: {0}
ar_sa: حدث خطأ أثناء استرجاع approval user roles: {0}
de_de: Fehler beim Abrufen von approval user roles: {0}
es_es: Ocurrió un error al recuperar approval user roles: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval user roles: {0}
it_it: Si è verificato un errore durante il recupero di approval user roles: {0}
tr_tr: Onay kullanıcı rolleri getirilirken bir hata oluştu: {0}

# ApprovalUserRoleService.GetApprovalUserRoleByIdExceptionMessage
source: An error occurred while retrieving approval user role: {0}
ar_sa: حدث خطأ أثناء استرجاع approval user role: {0}
de_de: Fehler beim Abrufen von approval user role: {0}
es_es: Ocurrió un error al recuperar approval user role: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval user role: {0}
it_it: Si è verificato un errore durante il recupero di approval user role: {0}
tr_tr: Onay kullanıcı rolü getirilirken bir hata oluştu: {0}

# ApprovalUserRoleService.CreateApprovalUserRoleExceptionMessage
source: An error occurred while creating approval user role: {0}
ar_sa: حدث خطأ أثناء إنشاء approval user role: {0}
de_de: Fehler beim Erstellen von approval user role: {0}
es_es: Ocurrió un error al crear approval user role: {0}
fr_fr: Une erreur est survenue lors de la création de approval user role: {0}
it_it: Si è verificato un errore durante la creazione di approval user role: {0}
tr_tr: Onay kullanıcı rolü oluşturulurken bir hata oluştu: {0}

# ApprovalUserRoleService.UpdateApprovalUserRoleExceptionMessage
source: An error occurred while updating approval user role: {0}
ar_sa: حدث خطأ أثناء تحديث approval user role: {0}
de_de: Fehler beim Aktualisieren von approval user role: {0}
es_es: Ocurrió un error al actualizar approval user role: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de approval user role: {0}
it_it: Si è verificato un errore durante l'aggiornamento di approval user role: {0}
tr_tr: Onay kullanıcı rolü güncellenirken bir hata oluştu: {0}

# ApprovalUserRoleService.DeleteApprovalUserRoleExceptionMessage
source: An error occurred while deleting approval user role: {0}
ar_sa: حدث خطأ أثناء حذف approval user role: {0}
de_de: Fehler beim Löschen von approval user role: {0}
es_es: Ocurrió un error al eliminar approval user role: {0}
fr_fr: Une erreur est survenue lors de la suppression de approval user role: {0}
it_it: Si è verificato un errore durante l'eliminazione di approval user role: {0}
tr_tr: Onay kullanıcı rolü silinirken bir hata oluştu: {0}

# ActivityTypeService.ActivityTypeCreated
source: Activity Type created successfully.
ar_sa: نوع النشاط تم إنشاؤه بنجاح.
de_de: Aktivitätstyp erfolgreich erstellt.
es_es: Tipo de actividad creado con éxito.
fr_fr: Type d'activité créé(e) avec succès.
it_it: Tipo di attività creato/a con successo.
tr_tr: Activity Type başarıyla oluşturuldu.

# ActivityTypeService.ActivityTypeDeleted
source: Activity Type deleted successfully.
ar_sa: نوع النشاط تم حذفه بنجاح.
de_de: Aktivitätstyp erfolgreich gelöscht.
es_es: Tipo de actividad eliminado con éxito.
fr_fr: Type d'activité supprimé(e) avec succès.
it_it: Tipo di attività eliminato/a con successo.
tr_tr: Activity Type başarıyla silindi.

# ActivityTypeService.ActivityTypeNotFound
source: Activity Type not found.
ar_sa: نوع النشاط غير موجود.
de_de: Aktivitätstyp nicht gefunden.
es_es: Tipo de actividad no encontrado.
fr_fr: Type d'activité non trouvé(e).
it_it: Tipo di attività non trovato/a.
tr_tr: Activity Type bulunamadı.

# ActivityTypeService.ActivityTypeRetrieved
source: Activity Type retrieved successfully.
ar_sa: نوع النشاط تم استرجاعه بنجاح.
de_de: Aktivitätstyp erfolgreich abgerufen.
es_es: Tipo de actividad recuperado con éxito.
fr_fr: Type d'activité récupéré(e) avec succès.
it_it: Tipo di attività recuperato/a con successo.
tr_tr: Activity Type başarıyla getirildi.

# ActivityTypeService.ActivityTypeUpdated
source: Activity Type updated successfully.
ar_sa: نوع النشاط تم تحديثه بنجاح.
de_de: Aktivitätstyp erfolgreich aktualisiert.
es_es: Tipo de actividad actualizado con éxito.
fr_fr: Type d'activité mis(e) à jour avec succès.
it_it: Tipo di attività aggiornato/a con successo.
tr_tr: Activity Type başarıyla güncellendi.

# ActivityTypeService.ActivityTypesRetrieved
source: Activity Types retrieved successfully.
ar_sa: نشاط Types تم استرجاعه بنجاح.
de_de: Aktivität Types erfolgreich abgerufen.
es_es: Actividad Types recuperado con éxito.
fr_fr: Activité Types récupéré(e) avec succès.
it_it: Attività Types recuperato/a con successo.
tr_tr: Activity Typeler başarıyla getirildi.
