Repository: cannasif-ship-it/verii_crm_api
Catalog: Resources/Messages.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, it_it, tr_tr

# OrderService.OrderCreated
source: Order created successfully.
ar_sa: أمر تم إنشاؤه بنجاح.
de_de: Bestellung erfolgreich erstellt.
es_es: Pedido creado con éxito.
it_it: Ordine creato/a con successo.
tr_tr: Sipariş başarıyla oluşturuldu.

# OrderService.OrderUpdated
source: Order updated successfully.
ar_sa: أمر تم تحديثه بنجاح.
de_de: Bestellung erfolgreich aktualisiert.
es_es: Pedido actualizado con éxito.
it_it: Ordine aggiornato/a con successo.
tr_tr: Sipariş başarıyla güncellendi.

# OrderService.OrderDeleted
source: Order deleted successfully.
ar_sa: أمر تم حذفه بنجاح.
de_de: Bestellung erfolgreich gelöscht.
es_es: Pedido eliminado con éxito.
it_it: Ordine eliminato/a con successo.
tr_tr: Sipariş başarıyla silindi.

# OrderService.OrdersByPotentialCustomerRetrieved
source: Orders by potential customer retrieved successfully.
ar_sa: عروض أسعار by potential customer تم استرجاعه بنجاح.
de_de: Bestellunge by potential customer erfolgreich abgerufen.
es_es: Cotizaciones by potential customer recuperado con éxito.
it_it: Preventivi by potential customer recuperato/a con successo.
tr_tr: Potansiyel müşteri teklifleri başarıyla getirildi.

# OrderService.OrdersByRepresentativeRetrieved
source: Orders by representative retrieved successfully.
ar_sa: عروض أسعار by representative تم استرجاعه بنجاح.
de_de: Bestellunge by representative erfolgreich abgerufen.
es_es: Cotizaciones by representative recuperado con éxito.
it_it: Preventivi by representative recuperato/a con successo.
tr_tr: Temsilci teklifleri başarıyla getirildi.

# OrderService.OrdersByStatusRetrieved
source: Orders by status retrieved successfully.
ar_sa: عروض أسعار by status تم استرجاعه بنجاح.
de_de: Bestellunge by status erfolgreich abgerufen.
es_es: Cotizaciones by status recuperado con éxito.
it_it: Preventivi by status recuperato/a con successo.
tr_tr: Durum teklifleri başarıyla getirildi.

# OrderService.PendingApprovalEmailSubject
source: You Have a Record Pending Approval
tr_tr: Onay Bekleyen Kaydınız Bulunmaktadır

# OrderService.ApprovalActionNotFound
source: Order not found.
ar_sa: أمر غير موجود.
de_de: Bestellung nicht gefunden.
es_es: Pedido no encontrado.
it_it: Ordine non trovato/a.
tr_tr: Order bulunamadı.

# OrderService.ApprovalFlowAlreadyExists
source: Order already exists.
tr_tr: Order zaten mevcut.

# OrderService.ApprovalFlowNotFound
source: Order not found.
ar_sa: أمر غير موجود.
de_de: Bestellung nicht gefunden.
es_es: Pedido no encontrado.
it_it: Ordine non trovato/a.
tr_tr: Order bulunamadı.

# OrderService.ApprovalFlowStepsNotFound
source: Order not found.
ar_sa: أمر غير موجود.
de_de: Bestellung nicht gefunden.
es_es: Pedido no encontrado.
it_it: Ordine non trovato/a.
tr_tr: Order bulunamadı.

# OrderService.ApprovalRequestNotFound
source: Order not found.
ar_sa: أمر غير موجود.
de_de: Bestellung nicht gefunden.
es_es: Pedido no encontrado.
it_it: Ordine non trovato/a.
tr_tr: Order bulunamadı.

# OrderService.ApprovalRoleNotFound
source: Order not found.
ar_sa: أمر غير موجود.
de_de: Bestellung nicht gefunden.
es_es: Pedido no encontrado.
it_it: Ordine non trovato/a.
tr_tr: Order bulunamadı.

# OrderService.ApprovalUsersNotFound
source: Order not found.
ar_sa: أمر غير موجود.
de_de: Bestellung nicht gefunden.
es_es: Pedido no encontrado.
it_it: Ordine non trovato/a.
tr_tr: Order bulunamadı.

# OrderService.ApproveExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# OrderService.CreateOrderBulkExceptionMessage
source: An error occurred while creating the Order: {0}
ar_sa: حدث خطأ أثناء إنشاء the أمر: {0}
de_de: Fehler beim Erstellen von the Bestellung: {0}
es_es: Ocurrió un error al crear the Pedido: {0}
it_it: Si è verificato un errore durante la creazione di the Ordine: {0}
tr_tr: Order oluşturulurken bir hata oluştu: {0}

# OrderService.CreateOrderExceptionMessage
source: An error occurred while creating the Order: {0}
ar_sa: حدث خطأ أثناء إنشاء the أمر: {0}
de_de: Fehler beim Erstellen von the Bestellung: {0}
es_es: Ocurrió un error al crear the Pedido: {0}
it_it: Si è verificato un errore durante la creazione di the Ordine: {0}
tr_tr: Order oluşturulurken bir hata oluştu: {0}

# OrderService.CreateRevisionOfOrderExceptionMessage
source: An error occurred while creating the Order: {0}
ar_sa: حدث خطأ أثناء إنشاء the أمر: {0}
de_de: Fehler beim Erstellen von the Bestellung: {0}
es_es: Ocurrió un error al crear the Pedido: {0}
it_it: Si è verificato un errore durante la creazione di the Ordine: {0}
tr_tr: Order oluşturulurken bir hata oluştu: {0}

# OrderService.DeleteOrderExceptionMessage
source: An error occurred while deleting the Order: {0}
ar_sa: حدث خطأ أثناء حذف the أمر: {0}
de_de: Fehler beim Löschen von the Bestellung: {0}
es_es: Ocurrió un error al eliminar the Pedido: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Ordine: {0}
tr_tr: Order silinirken bir hata oluştu: {0}

# OrderService.GetAllOrdersExceptionMessage
source: An error occurred while retrieving Orders: {0}
ar_sa: حدث خطأ أثناء استرجاع عروض أسعار: {0}
de_de: Fehler beim Abrufen von Bestellunge: {0}
es_es: Ocurrió un error al recuperar Cotizaciones: {0}
it_it: Si è verificato un errore durante il recupero di Preventivi: {0}
tr_tr: Orderler getirilirken bir hata oluştu: {0}

# OrderService.GetPriceOfProductExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# OrderService.GetPriceRuleOfOrderExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# OrderService.GetOrderByIdExceptionMessage
source: An error occurred while retrieving the Order: {0}
ar_sa: حدث خطأ أثناء استرجاع the أمر: {0}
de_de: Fehler beim Abrufen von the Bestellung: {0}
es_es: Ocurrió un error al recuperar the Pedido: {0}
it_it: Si è verificato un errore durante il recupero di the Ordine: {0}
tr_tr: Order getirilirken bir hata oluştu: {0}

# OrderService.GetOrdersByPotentialCustomerExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# OrderService.GetOrdersByRepresentativeExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# OrderService.GetOrdersByStatusExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# OrderService.GetWaitingApprovalsExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# OrderService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# OrderService.PriceOfProductRetrieved
source: Order retrieved successfully.
ar_sa: أمر تم استرجاعه بنجاح.
de_de: Bestellung erfolgreich abgerufen.
es_es: Pedido recuperado con éxito.
it_it: Ordine recuperato/a con successo.
tr_tr: Order başarıyla getirildi.

# OrderService.OrderExistsExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# OrderService.OrderRevisionCreated
source: Order created successfully.
ar_sa: أمر تم إنشاؤه بنجاح.
de_de: Bestellung erfolgreich erstellt.
es_es: Pedido creado con éxito.
it_it: Ordine creato/a con successo.
tr_tr: Order başarıyla oluşturuldu.

# OrderService.RejectExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# OrderService.StartApprovalFlowExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# OrderService.UpdateOrderExceptionMessage
source: An error occurred while updating the Order: {0}
ar_sa: حدث خطأ أثناء تحديث the أمر: {0}
de_de: Fehler beim Aktualisieren von the Bestellung: {0}
es_es: Ocurrió un error al actualizar the Pedido: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Ordine: {0}
tr_tr: Order güncellenirken bir hata oluştu: {0}

# OrderService.UserNotFound
source: Order not found.
ar_sa: أمر غير موجود.
de_de: Bestellung nicht gefunden.
es_es: Pedido no encontrado.
it_it: Ordine non trovato/a.
tr_tr: Order bulunamadı.

# OrderService.WaitingApprovalsRetrieved
source: Orders retrieved successfully.
ar_sa: عروض أسعار تم استرجاعه بنجاح.
de_de: Bestellunge erfolgreich abgerufen.
es_es: Cotizaciones recuperado con éxito.
it_it: Preventivi recuperato/a con successo.
tr_tr: Orderler başarıyla getirildi.

# DemandLineService.DemandLinesRetrieved
source: Demand lines retrieved successfully.
ar_sa: طلب lines تم استرجاعه بنجاح.
de_de: Bedarf lines erfolgreich abgerufen.
es_es: Demanda lines recuperado con éxito.
it_it: Richiesta lines recuperato/a con successo.
tr_tr: Talep satırları başarıyla getirildi.

# DemandLineService.DemandLineNotFound
source: Demand line not found.
ar_sa: طلب line غير موجود.
de_de: Bedarf line nicht gefunden.
es_es: Demanda line no encontrado.
it_it: Richiesta line non trovato/a.
tr_tr: Talep satırı bulunamadı.

# DemandLineService.DemandLineRetrieved
source: Demand line retrieved successfully.
ar_sa: طلب line تم استرجاعه بنجاح.
de_de: Bedarf line erfolgreich abgerufen.
es_es: Demanda line recuperado con éxito.
it_it: Richiesta line recuperato/a con successo.
tr_tr: Talep satırı başarıyla getirildi.

# DemandLineService.DemandLineCreated
source: Demand line created successfully.
ar_sa: طلب line تم إنشاؤه بنجاح.
de_de: Bedarf line erfolgreich erstellt.
es_es: Demanda line creado con éxito.
it_it: Richiesta line creato/a con successo.
tr_tr: Talep satırı başarıyla oluşturuldu.

# DemandLineService.DemandLineUpdated
source: Demand line updated successfully.
ar_sa: طلب line تم تحديثه بنجاح.
de_de: Bedarf line erfolgreich aktualisiert.
es_es: Demanda line actualizado con éxito.
it_it: Richiesta line aggiornato/a con successo.
tr_tr: Talep satırı başarıyla güncellendi.

# DemandLineService.DemandLineDeleted
source: Demand line deleted successfully.
ar_sa: طلب line تم حذفه بنجاح.
de_de: Bedarf line erfolgreich gelöscht.
es_es: Demanda line eliminado con éxito.
it_it: Richiesta line eliminato/a con successo.
tr_tr: Talep satırı başarıyla silindi.

# DemandLineService.ErrorRetrievingDemandLines
source: An error occurred while retrieving quotation lines.
ar_sa: حدث خطأ أثناء استرجاع quotation lines.
de_de: Fehler beim Abrufen von quotation lines.
es_es: Ocurrió un error al recuperar quotation lines.
it_it: Si è verificato un errore durante il recupero di quotation lines.
tr_tr: Talep satırları getirilirken bir hata oluştu.

# DemandLineService.ErrorRetrievingDemandLine
source: An error occurred while retrieving the quotation line.
ar_sa: حدث خطأ أثناء استرجاع the quotation line.
de_de: Fehler beim Abrufen von the quotation line.
es_es: Ocurrió un error al recuperar the quotation line.
it_it: Si è verificato un errore durante il recupero di the quotation line.
tr_tr: Talep satırı getirilirken bir hata oluştu.

# DemandLineService.ErrorCreatingDemandLine
source: An error occurred while creating the quotation line.
ar_sa: حدث خطأ أثناء إنشاء the quotation line.
de_de: Fehler beim Erstellen von the quotation line.
es_es: Ocurrió un error al crear the quotation line.
it_it: Si è verificato un errore durante la creazione di the quotation line.
tr_tr: Talep satırı oluşturulurken bir hata oluştu.

# DemandLineService.ErrorUpdatingDemandLine
source: An error occurred while updating the quotation line.
ar_sa: حدث خطأ أثناء تحديث the quotation line.
de_de: Fehler beim Aktualisieren von the quotation line.
es_es: Ocurrió un error al actualizar the quotation line.
it_it: Si è verificato un errore durante l'aggiornamento di the quotation line.
tr_tr: Talep satırı güncellenirken bir hata oluştu.

# DemandLineService.ErrorDeletingDemandLine
source: An error occurred while deleting the quotation line.
ar_sa: حدث خطأ أثناء حذف the quotation line.
de_de: Fehler beim Löschen von the quotation line.
es_es: Ocurrió un error al eliminar the quotation line.
it_it: Si è verificato un errore durante l'eliminazione di the quotation line.
tr_tr: Talep satırı silinirken bir hata oluştu.

# DemandLineService.DemandLinesByDemandRetrieved
source: Demand lines by quotation retrieved successfully.
ar_sa: طلب lines by quotation تم استرجاعه بنجاح.
de_de: Bedarf lines by quotation erfolgreich abgerufen.
es_es: Demanda lines by quotation recuperado con éxito.
it_it: Richiesta lines by quotation recuperato/a con successo.
tr_tr: Talepe göre teklif satırları başarıyla getirildi.

# DemandLineService.CreateExceptionMessage
source: An error occurred while creating the Demand Line: {0}
ar_sa: حدث خطأ أثناء إنشاء the طلب Line: {0}
de_de: Fehler beim Erstellen von the Bedarf Line: {0}
es_es: Ocurrió un error al crear the Demanda Line: {0}
it_it: Si è verificato un errore durante la creazione di the Richiesta Line: {0}
tr_tr: Demand Line oluşturulurken bir hata oluştu: {0}

# DemandLineService.DeleteExceptionMessage
source: An error occurred while deleting the Demand Line: {0}
ar_sa: حدث خطأ أثناء حذف the طلب Line: {0}
de_de: Fehler beim Löschen von the Bedarf Line: {0}
es_es: Ocurrió un error al eliminar the Demanda Line: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Richiesta Line: {0}
tr_tr: Demand Line silinirken bir hata oluştu: {0}

# DemandLineService.GetAllExceptionMessage
source: An error occurred while retrieving Demand Lines: {0}
ar_sa: حدث خطأ أثناء استرجاع طلب Lines: {0}
de_de: Fehler beim Abrufen von Bedarf Lines: {0}
es_es: Ocurrió un error al recuperar Demanda Lines: {0}
it_it: Si è verificato un errore durante il recupero di Richiesta Lines: {0}
tr_tr: Demand Lineler getirilirken bir hata oluştu: {0}

# DemandLineService.GetByIdExceptionMessage
source: An error occurred while retrieving the Demand Line: {0}
ar_sa: حدث خطأ أثناء استرجاع the طلب Line: {0}
de_de: Fehler beim Abrufen von the Bedarf Line: {0}
es_es: Ocurrió un error al recuperar the Demanda Line: {0}
it_it: Si è verificato un errore durante il recupero di the Richiesta Line: {0}
tr_tr: Demand Line getirilirken bir hata oluştu: {0}

# DemandLineService.GetByDemandIdExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# DemandLineService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# DemandLineService.UpdateExceptionMessage
source: An error occurred while updating the Demand Line: {0}
ar_sa: حدث خطأ أثناء تحديث the طلب Line: {0}
de_de: Fehler beim Aktualisieren von the Bedarf Line: {0}
es_es: Ocurrió un error al actualizar the Demanda Line: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Richiesta Line: {0}
tr_tr: Demand Line güncellenirken bir hata oluştu: {0}

# OrderLineService.OrderLinesRetrieved
source: Order lines retrieved successfully.
ar_sa: أمر lines تم استرجاعه بنجاح.
de_de: Bestellung lines erfolgreich abgerufen.
es_es: Pedido lines recuperado con éxito.
it_it: Ordine lines recuperato/a con successo.
tr_tr: Sipariş satırları başarıyla getirildi.

# OrderLineService.OrderLineNotFound
source: Order line not found.
ar_sa: أمر line غير موجود.
de_de: Bestellung line nicht gefunden.
es_es: Pedido line no encontrado.
it_it: Ordine line non trovato/a.
tr_tr: Sipariş satırı bulunamadı.

# OrderLineService.OrderLineRetrieved
source: Order line retrieved successfully.
ar_sa: أمر line تم استرجاعه بنجاح.
de_de: Bestellung line erfolgreich abgerufen.
es_es: Pedido line recuperado con éxito.
it_it: Ordine line recuperato/a con successo.
tr_tr: Sipariş satırı başarıyla getirildi.

# OrderLineService.OrderLineCreated
source: Order line created successfully.
ar_sa: أمر line تم إنشاؤه بنجاح.
de_de: Bestellung line erfolgreich erstellt.
es_es: Pedido line creado con éxito.
it_it: Ordine line creato/a con successo.
tr_tr: Sipariş satırı başarıyla oluşturuldu.

# OrderLineService.OrderLineUpdated
source: Order line updated successfully.
ar_sa: أمر line تم تحديثه بنجاح.
de_de: Bestellung line erfolgreich aktualisiert.
es_es: Pedido line actualizado con éxito.
it_it: Ordine line aggiornato/a con successo.
tr_tr: Sipariş satırı başarıyla güncellendi.

# OrderLineService.OrderLineDeleted
source: Order line deleted successfully.
ar_sa: أمر line تم حذفه بنجاح.
de_de: Bestellung line erfolgreich gelöscht.
es_es: Pedido line eliminado con éxito.
it_it: Ordine line eliminato/a con successo.
tr_tr: Sipariş satırı başarıyla silindi.

# OrderLineService.ErrorRetrievingOrderLines
source: An error occurred while retrieving quotation lines.
ar_sa: حدث خطأ أثناء استرجاع quotation lines.
de_de: Fehler beim Abrufen von quotation lines.
es_es: Ocurrió un error al recuperar quotation lines.
it_it: Si è verificato un errore durante il recupero di quotation lines.
tr_tr: Sipariş satırları getirilirken bir hata oluştu.

# OrderLineService.ErrorRetrievingOrderLine
source: An error occurred while retrieving the quotation line.
ar_sa: حدث خطأ أثناء استرجاع the quotation line.
de_de: Fehler beim Abrufen von the quotation line.
es_es: Ocurrió un error al recuperar the quotation line.
it_it: Si è verificato un errore durante il recupero di the quotation line.
tr_tr: Sipariş satırı getirilirken bir hata oluştu.

# OrderLineService.ErrorCreatingOrderLine
source: An error occurred while creating the quotation line.
ar_sa: حدث خطأ أثناء إنشاء the quotation line.
de_de: Fehler beim Erstellen von the quotation line.
es_es: Ocurrió un error al crear the quotation line.
it_it: Si è verificato un errore durante la creazione di the quotation line.
tr_tr: Sipariş satırı oluşturulurken bir hata oluştu.

# OrderLineService.ErrorUpdatingOrderLine
source: An error occurred while updating the quotation line.
ar_sa: حدث خطأ أثناء تحديث the quotation line.
de_de: Fehler beim Aktualisieren von the quotation line.
es_es: Ocurrió un error al actualizar the quotation line.
it_it: Si è verificato un errore durante l'aggiornamento di the quotation line.
tr_tr: Sipariş satırı güncellenirken bir hata oluştu.

# OrderLineService.ErrorDeletingOrderLine
source: An error occurred while deleting the quotation line.
ar_sa: حدث خطأ أثناء حذف the quotation line.
de_de: Fehler beim Löschen von the quotation line.
es_es: Ocurrió un error al eliminar the quotation line.
it_it: Si è verificato un errore durante l'eliminazione di the quotation line.
tr_tr: Sipariş satırı silinirken bir hata oluştu.

# OrderLineService.OrderLinesByOrderRetrieved
source: Order lines by quotation retrieved successfully.
ar_sa: أمر lines by quotation تم استرجاعه بنجاح.
de_de: Bestellung lines by quotation erfolgreich abgerufen.
es_es: Pedido lines by quotation recuperado con éxito.
it_it: Ordine lines by quotation recuperato/a con successo.
tr_tr: Siparişe göre teklif satırları başarıyla getirildi.

# OrderLineService.CreateExceptionMessage
source: An error occurred while creating the Order Line: {0}
ar_sa: حدث خطأ أثناء إنشاء the أمر Line: {0}
de_de: Fehler beim Erstellen von the Bestellung Line: {0}
es_es: Ocurrió un error al crear the Pedido Line: {0}
it_it: Si è verificato un errore durante la creazione di the Ordine Line: {0}
tr_tr: Order Line oluşturulurken bir hata oluştu: {0}

# OrderLineService.DeleteExceptionMessage
source: An error occurred while deleting the Order Line: {0}
ar_sa: حدث خطأ أثناء حذف the أمر Line: {0}
de_de: Fehler beim Löschen von the Bestellung Line: {0}
es_es: Ocurrió un error al eliminar the Pedido Line: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Ordine Line: {0}
tr_tr: Order Line silinirken bir hata oluştu: {0}

# OrderLineService.GetAllExceptionMessage
source: An error occurred while retrieving Order Lines: {0}
ar_sa: حدث خطأ أثناء استرجاع أمر Lines: {0}
de_de: Fehler beim Abrufen von Bestellung Lines: {0}
es_es: Ocurrió un error al recuperar Pedido Lines: {0}
it_it: Si è verificato un errore durante il recupero di Ordine Lines: {0}
tr_tr: Order Lineler getirilirken bir hata oluştu: {0}

# OrderLineService.GetByIdExceptionMessage
source: An error occurred while retrieving the Order Line: {0}
ar_sa: حدث خطأ أثناء استرجاع the أمر Line: {0}
de_de: Fehler beim Abrufen von the Bestellung Line: {0}
es_es: Ocurrió un error al recuperar the Pedido Line: {0}
it_it: Si è verificato un errore durante il recupero di the Ordine Line: {0}
tr_tr: Order Line getirilirken bir hata oluştu: {0}

# OrderLineService.GetByOrderIdExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# OrderLineService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# OrderLineService.UpdateExceptionMessage
source: An error occurred while updating the Order Line: {0}
ar_sa: حدث خطأ أثناء تحديث the أمر Line: {0}
de_de: Fehler beim Aktualisieren von the Bestellung Line: {0}
es_es: Ocurrió un error al actualizar the Pedido Line: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Ordine Line: {0}
tr_tr: Order Line güncellenirken bir hata oluştu: {0}

# DemandExchangeRateService.CreateRateExceptionMessage
source: An error occurred while creating the Demand Exchange Rate: {0}
ar_sa: حدث خطأ أثناء إنشاء the طلب Exchange Rate: {0}
de_de: Fehler beim Erstellen von the Bedarf Exchange Rate: {0}
es_es: Ocurrió un error al crear the Demanda Exchange Rate: {0}
it_it: Si è verificato un errore durante la creazione di the Richiesta Exchange Rate: {0}
tr_tr: Demand Exchange Rate oluşturulurken bir hata oluştu: {0}

# DemandExchangeRateService.DeleteRateExceptionMessage
source: An error occurred while deleting the Demand Exchange Rate: {0}
ar_sa: حدث خطأ أثناء حذف the طلب Exchange Rate: {0}
de_de: Fehler beim Löschen von the Bedarf Exchange Rate: {0}
es_es: Ocurrió un error al eliminar the Demanda Exchange Rate: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Richiesta Exchange Rate: {0}
tr_tr: Demand Exchange Rate silinirken bir hata oluştu: {0}

# DemandExchangeRateService.GetAllRatesExceptionMessage
source: An error occurred while retrieving Demand Exchange Rates: {0}
ar_sa: حدث خطأ أثناء استرجاع طلب Exchange Rates: {0}
de_de: Fehler beim Abrufen von Bedarf Exchange Rates: {0}
es_es: Ocurrió un error al recuperar Demanda Exchange Rates: {0}
it_it: Si è verificato un errore durante il recupero di Richiesta Exchange Rates: {0}
tr_tr: Demand Exchange Rateler getirilirken bir hata oluştu: {0}

# DemandExchangeRateService.GetRateByIdExceptionMessage
source: An error occurred while retrieving the Demand Exchange Rate: {0}
ar_sa: حدث خطأ أثناء استرجاع the طلب Exchange Rate: {0}
de_de: Fehler beim Abrufen von the Bedarf Exchange Rate: {0}
es_es: Ocurrió un error al recuperar the Demanda Exchange Rate: {0}
it_it: Si è verificato un errore durante il recupero di the Richiesta Exchange Rate: {0}
tr_tr: Demand Exchange Rate getirilirken bir hata oluştu: {0}

# DemandExchangeRateService.GetRatesByDemandIdExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# DemandExchangeRateService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# DemandExchangeRateService.RateCreated
source: Demand Exchange Rate created successfully.
ar_sa: طلب Exchange Rate تم إنشاؤه بنجاح.
de_de: Bedarf Exchange Rate erfolgreich erstellt.
es_es: Demanda Exchange Rate creado con éxito.
it_it: Richiesta Exchange Rate creato/a con successo.
tr_tr: Demand Exchange Rate başarıyla oluşturuldu.
