Repository: cannasif-ship-it/verii_crm_api
Catalog: Resources/Messages.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, it_it, tr_tr

# CustomerTypeService.DeleteCustomerTypeExceptionMessage
source: An error occurred while deleting the Customer Type: {0}
ar_sa: حدث خطأ أثناء حذف the عميل نوع: {0}
de_de: Fehler beim Löschen von the Kunde Typ: {0}
es_es: Ocurrió un error al eliminar the Cliente Tipo: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Client Type: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Cliente Tipo: {0}
tr_tr: Customer Type silinirken bir hata oluştu: {0}

# CustomerTypeService.GetAllCustomerTypesExceptionMessage
source: An error occurred while retrieving Customer Types: {0}
ar_sa: حدث خطأ أثناء استرجاع عميل Types: {0}
de_de: Fehler beim Abrufen von Kunde Types: {0}
es_es: Ocurrió un error al recuperar Cliente Types: {0}
fr_fr: Une erreur est survenue lors de la récupération de Client Types: {0}
it_it: Si è verificato un errore durante il recupero di Cliente Types: {0}
tr_tr: Customer Typeler getirilirken bir hata oluştu: {0}

# CustomerTypeService.GetCustomerTypeByIdExceptionMessage
source: An error occurred while retrieving the Customer Type: {0}
ar_sa: حدث خطأ أثناء استرجاع the عميل نوع: {0}
de_de: Fehler beim Abrufen von the Kunde Typ: {0}
es_es: Ocurrió un error al recuperar the Cliente Tipo: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Client Type: {0}
it_it: Si è verificato un errore durante il recupero di the Cliente Tipo: {0}
tr_tr: Customer Type getirilirken bir hata oluştu: {0}

# CustomerTypeService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# CustomerTypeService.UpdateCustomerTypeExceptionMessage
source: An error occurred while updating the Customer Type: {0}
ar_sa: حدث خطأ أثناء تحديث the عميل نوع: {0}
de_de: Fehler beim Aktualisieren von the Kunde Typ: {0}
es_es: Ocurrió un error al actualizar the Cliente Tipo: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Client Type: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Cliente Tipo: {0}
tr_tr: Customer Type güncellenirken bir hata oluştu: {0}

# ContactService.ContactsRetrieved
source: Contacts retrieved successfully.
ar_sa: جهات اتصال تم استرجاعه بنجاح.
de_de: Kontakte erfolgreich abgerufen.
es_es: Contactos recuperado con éxito.
fr_fr: Contacts récupéré(e) avec succès.
it_it: Contatti recuperato/a con successo.
tr_tr: İletişim bilgileri başarıyla getirildi.

# ContactService.ContactNotFound
source: Contact not found.
ar_sa: جهة اتصال غير موجود.
de_de: Kontakt nicht gefunden.
es_es: Contacto no encontrado.
fr_fr: Contact non trouvé(e).
it_it: Contatto non trovato/a.
tr_tr: İletişim bilgisi bulunamadı.

# ContactService.ContactRetrieved
source: Contact retrieved successfully.
ar_sa: جهة اتصال تم استرجاعه بنجاح.
de_de: Kontakt erfolgreich abgerufen.
es_es: Contacto recuperado con éxito.
fr_fr: Contact récupéré(e) avec succès.
it_it: Contatto recuperato/a con successo.
tr_tr: İletişim bilgisi başarıyla getirildi.

# ContactService.ContactCreated
source: Contact created successfully.
ar_sa: جهة اتصال تم إنشاؤه بنجاح.
de_de: Kontakt erfolgreich erstellt.
es_es: Contacto creado con éxito.
fr_fr: Contact créé(e) avec succès.
it_it: Contatto creato/a con successo.
tr_tr: İletişim bilgisi başarıyla oluşturuldu.

# ContactService.ContactUpdated
source: Contact updated successfully.
ar_sa: جهة اتصال تم تحديثه بنجاح.
de_de: Kontakt erfolgreich aktualisiert.
es_es: Contacto actualizado con éxito.
fr_fr: Contact mis(e) à jour avec succès.
it_it: Contatto aggiornato/a con successo.
tr_tr: İletişim bilgisi başarıyla güncellendi.

# ContactService.ContactDeleted
source: Contact deleted successfully.
ar_sa: جهة اتصال تم حذفه بنجاح.
de_de: Kontakt erfolgreich gelöscht.
es_es: Contacto eliminado con éxito.
fr_fr: Contact supprimé(e) avec succès.
it_it: Contatto eliminato/a con successo.
tr_tr: İletişim bilgisi başarıyla silindi.

# ContactService.ErrorRetrievingContacts
source: An error occurred while retrieving contacts.
ar_sa: حدث خطأ أثناء استرجاع contacts.
de_de: Fehler beim Abrufen von contacts.
es_es: Ocurrió un error al recuperar contacts.
fr_fr: Une erreur est survenue lors de la récupération de contacts.
it_it: Si è verificato un errore durante il recupero di contacts.
tr_tr: İletişim bilgileri getirilirken bir hata oluştu.

# ContactService.ErrorRetrievingContact
source: An error occurred while retrieving the contact.
ar_sa: حدث خطأ أثناء استرجاع the contact.
de_de: Fehler beim Abrufen von the contact.
es_es: Ocurrió un error al recuperar the contact.
fr_fr: Une erreur est survenue lors de la récupération de the contact.
it_it: Si è verificato un errore durante il recupero di the contact.
tr_tr: İletişim bilgisi getirilirken bir hata oluştu.

# ContactService.ErrorCreatingContact
source: An error occurred while creating the contact.
ar_sa: حدث خطأ أثناء إنشاء the contact.
de_de: Fehler beim Erstellen von the contact.
es_es: Ocurrió un error al crear the contact.
fr_fr: Une erreur est survenue lors de la création de the contact.
it_it: Si è verificato un errore durante la creazione di the contact.
tr_tr: İletişim bilgisi oluşturulurken bir hata oluştu.

# ContactService.ErrorUpdatingContact
source: An error occurred while updating the contact.
ar_sa: حدث خطأ أثناء تحديث the contact.
de_de: Fehler beim Aktualisieren von the contact.
es_es: Ocurrió un error al actualizar the contact.
fr_fr: Une erreur est survenue lors de la mise à jour de the contact.
it_it: Si è verificato un errore durante l'aggiornamento di the contact.
tr_tr: İletişim bilgisi güncellenirken bir hata oluştu.

# ContactService.ErrorDeletingContact
source: An error occurred while deleting the contact.
ar_sa: حدث خطأ أثناء حذف the contact.
de_de: Fehler beim Löschen von the contact.
es_es: Ocurrió un error al eliminar the contact.
fr_fr: Une erreur est survenue lors de la suppression de the contact.
it_it: Si è verificato un errore durante l'eliminazione di the contact.
tr_tr: İletişim bilgisi silinirken bir hata oluştu.

# ContactService.CreateContactExceptionMessage
source: An error occurred while creating the Contact: {0}
ar_sa: حدث خطأ أثناء إنشاء the جهة اتصال: {0}
de_de: Fehler beim Erstellen von the Kontakt: {0}
es_es: Ocurrió un error al crear the Contacto: {0}
fr_fr: Une erreur est survenue lors de la création de the Contact: {0}
it_it: Si è verificato un errore durante la creazione di the Contatto: {0}
tr_tr: Contact oluşturulurken bir hata oluştu: {0}

# ContactService.DeleteContactExceptionMessage
source: An error occurred while deleting the Contact: {0}
ar_sa: حدث خطأ أثناء حذف the جهة اتصال: {0}
de_de: Fehler beim Löschen von the Kontakt: {0}
es_es: Ocurrió un error al eliminar the Contacto: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Contact: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Contatto: {0}
tr_tr: Contact silinirken bir hata oluştu: {0}

# ContactService.GetAllContactsExceptionMessage
source: An error occurred while retrieving Contacts: {0}
ar_sa: حدث خطأ أثناء استرجاع جهات اتصال: {0}
de_de: Fehler beim Abrufen von Kontakte: {0}
es_es: Ocurrió un error al recuperar Contactos: {0}
fr_fr: Une erreur est survenue lors de la récupération de Contacts: {0}
it_it: Si è verificato un errore durante il recupero di Contatti: {0}
tr_tr: Contactler getirilirken bir hata oluştu: {0}

# ContactService.GetContactByIdExceptionMessage
source: An error occurred while retrieving the Contact: {0}
ar_sa: حدث خطأ أثناء استرجاع the جهة اتصال: {0}
de_de: Fehler beim Abrufen von the Kontakt: {0}
es_es: Ocurrió un error al recuperar the Contacto: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Contact: {0}
it_it: Si è verificato un errore durante il recupero di the Contatto: {0}
tr_tr: Contact getirilirken bir hata oluştu: {0}

# ContactService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# ContactService.UpdateContactExceptionMessage
source: An error occurred while updating the Contact: {0}
ar_sa: حدث خطأ أثناء تحديث the جهة اتصال: {0}
de_de: Fehler beim Aktualisieren von the Kontakt: {0}
es_es: Ocurrió un error al actualizar the Contacto: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Contact: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Contatto: {0}
tr_tr: Contact güncellenirken bir hata oluştu: {0}

# ActivityService.ActivitiesRetrieved
source: Activities retrieved successfully.
ar_sa: أنشطة تم استرجاعه بنجاح.
de_de: Aktivitäten erfolgreich abgerufen.
es_es: Actividades recuperado con éxito.
fr_fr: Activités récupéré(e) avec succès.
it_it: Attività recuperato/a con successo.
tr_tr: Aktiviteler başarıyla getirildi.

# ActivityService.ActivityNotFound
source: Activity not found.
ar_sa: نشاط غير موجود.
de_de: Aktivität nicht gefunden.
es_es: Actividad no encontrado.
fr_fr: Activité non trouvé(e).
it_it: Attività non trovato/a.
tr_tr: Aktivite bulunamadı.

# ActivityService.ActivityRetrieved
source: Activity retrieved successfully.
ar_sa: نشاط تم استرجاعه بنجاح.
de_de: Aktivität erfolgreich abgerufen.
es_es: Actividad recuperado con éxito.
fr_fr: Activité récupéré(e) avec succès.
it_it: Attività recuperato/a con successo.
tr_tr: Aktivite başarıyla getirildi.

# ActivityService.ActivityCreated
source: Activity created successfully.
ar_sa: نشاط تم إنشاؤه بنجاح.
de_de: Aktivität erfolgreich erstellt.
es_es: Actividad creado con éxito.
fr_fr: Activité créé(e) avec succès.
it_it: Attività creato/a con successo.
tr_tr: Aktivite başarıyla oluşturuldu.

# ActivityService.ActivityUpdated
source: Activity updated successfully.
ar_sa: نشاط تم تحديثه بنجاح.
de_de: Aktivität erfolgreich aktualisiert.
es_es: Actividad actualizado con éxito.
fr_fr: Activité mis(e) à jour avec succès.
it_it: Attività aggiornato/a con successo.
tr_tr: Aktivite başarıyla güncellendi.

# ActivityService.ActivityDeleted
source: Activity deleted successfully.
ar_sa: نشاط تم حذفه بنجاح.
de_de: Aktivität erfolgreich gelöscht.
es_es: Actividad eliminado con éxito.
fr_fr: Activité supprimé(e) avec succès.
it_it: Attività eliminato/a con successo.
tr_tr: Aktivite başarıyla silindi.

# ActivityService.CreateActivityExceptionMessage
source: An error occurred while creating the Activity: {0}
ar_sa: حدث خطأ أثناء إنشاء the نشاط: {0}
de_de: Fehler beim Erstellen von the Aktivität: {0}
es_es: Ocurrió un error al crear the Actividad: {0}
fr_fr: Une erreur est survenue lors de la création de the Activité: {0}
it_it: Si è verificato un errore durante la creazione di the Attività: {0}
tr_tr: Activity oluşturulurken bir hata oluştu: {0}

# ActivityService.DeleteActivityExceptionMessage
source: An error occurred while deleting the Activity: {0}
ar_sa: حدث خطأ أثناء حذف the نشاط: {0}
de_de: Fehler beim Löschen von the Aktivität: {0}
es_es: Ocurrió un error al eliminar the Actividad: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Activité: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Attività: {0}
tr_tr: Activity silinirken bir hata oluştu: {0}

# ActivityService.GetActivityByIdExceptionMessage
source: An error occurred while retrieving the Activity: {0}
ar_sa: حدث خطأ أثناء استرجاع the نشاط: {0}
de_de: Fehler beim Abrufen von the Aktivität: {0}
es_es: Ocurrió un error al recuperar the Actividad: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Activité: {0}
it_it: Si è verificato un errore durante il recupero di the Attività: {0}
tr_tr: Activity getirilirken bir hata oluştu: {0}

# ActivityService.GetAllActivitiesExceptionMessage
source: An error occurred while retrieving Activitys: {0}
ar_sa: حدث خطأ أثناء استرجاع Activitys: {0}
de_de: Fehler beim Abrufen von Activitys: {0}
es_es: Ocurrió un error al recuperar Activitys: {0}
fr_fr: Une erreur est survenue lors de la récupération de Activitys: {0}
it_it: Si è verificato un errore durante il recupero di Activitys: {0}
tr_tr: Activityler getirilirken bir hata oluştu: {0}

# ActivityService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# ActivityService.UpdateActivityExceptionMessage
source: An error occurred while updating the Activity: {0}
ar_sa: حدث خطأ أثناء تحديث the نشاط: {0}
de_de: Fehler beim Aktualisieren von the Aktivität: {0}
es_es: Ocurrió un error al actualizar the Actividad: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Activité: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Attività: {0}
tr_tr: Activity güncellenirken bir hata oluştu: {0}

# ProductPricingService.ProductPricingsRetrieved
source: Product pricings retrieved successfully.
ar_sa: منتج pricings تم استرجاعه بنجاح.
de_de: Produkt pricings erfolgreich abgerufen.
es_es: Producto pricings recuperado con éxito.
fr_fr: Produit pricings récupéré(e) avec succès.
it_it: Prodotto pricings recuperato/a con successo.
tr_tr: Ürün fiyatlandırmaları başarıyla getirildi.

# ProductPricingService.ProductPricingNotFound
source: Product pricing not found.
ar_sa: منتج pricing غير موجود.
de_de: Produkt pricing nicht gefunden.
es_es: Producto pricing no encontrado.
fr_fr: Produit pricing non trouvé(e).
it_it: Prodotto pricing non trovato/a.
tr_tr: Ürün fiyatlandırması bulunamadı.

# ProductPricingService.ProductPricingRetrieved
source: Product pricing retrieved successfully.
ar_sa: منتج pricing تم استرجاعه بنجاح.
de_de: Produkt pricing erfolgreich abgerufen.
es_es: Producto pricing recuperado con éxito.
fr_fr: Produit pricing récupéré(e) avec succès.
it_it: Prodotto pricing recuperato/a con successo.
tr_tr: Ürün fiyatlandırması başarıyla getirildi.

# ProductPricingService.ProductPricingCreated
source: Product pricing created successfully.
ar_sa: منتج pricing تم إنشاؤه بنجاح.
de_de: Produkt pricing erfolgreich erstellt.
es_es: Producto pricing creado con éxito.
fr_fr: Produit pricing créé(e) avec succès.
it_it: Prodotto pricing creato/a con successo.
tr_tr: Ürün fiyatlandırması başarıyla oluşturuldu.

# ProductPricingService.ProductPricingUpdated
source: Product pricing updated successfully.
ar_sa: منتج pricing تم تحديثه بنجاح.
de_de: Produkt pricing erfolgreich aktualisiert.
es_es: Producto pricing actualizado con éxito.
fr_fr: Produit pricing mis(e) à jour avec succès.
it_it: Prodotto pricing aggiornato/a con successo.
tr_tr: Ürün fiyatlandırması başarıyla güncellendi.

# ProductPricingService.ProductPricingDeleted
source: Product pricing deleted successfully.
ar_sa: منتج pricing تم حذفه بنجاح.
de_de: Produkt pricing erfolgreich gelöscht.
es_es: Producto pricing eliminado con éxito.
fr_fr: Produit pricing supprimé(e) avec succès.
it_it: Prodotto pricing eliminato/a con successo.
tr_tr: Ürün fiyatlandırması başarıyla silindi.

# ProductPricingService.CreateProductPricingExceptionMessage
source: An error occurred while creating the Product Pricing: {0}
ar_sa: حدث خطأ أثناء إنشاء the منتج تسعير: {0}
de_de: Fehler beim Erstellen von the Produkt Preisgestaltung: {0}
es_es: Ocurrió un error al crear the Producto Precios: {0}
fr_fr: Une erreur est survenue lors de la création de the Produit Tarification: {0}
it_it: Si è verificato un errore durante la creazione di the Prodotto Prezzi: {0}
tr_tr: Product Pricing oluşturulurken bir hata oluştu: {0}

# ProductPricingService.DeleteProductPricingExceptionMessage
source: An error occurred while deleting the Product Pricing: {0}
ar_sa: حدث خطأ أثناء حذف the منتج تسعير: {0}
de_de: Fehler beim Löschen von the Produkt Preisgestaltung: {0}
es_es: Ocurrió un error al eliminar the Producto Precios: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Produit Tarification: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Prodotto Prezzi: {0}
tr_tr: Product Pricing silinirken bir hata oluştu: {0}

# ProductPricingService.GetAllProductPricingsExceptionMessage
source: An error occurred while retrieving Product Pricings: {0}
ar_sa: حدث خطأ أثناء استرجاع منتج Pricings: {0}
de_de: Fehler beim Abrufen von Produkt Pricings: {0}
es_es: Ocurrió un error al recuperar Producto Pricings: {0}
fr_fr: Une erreur est survenue lors de la récupération de Produit Pricings: {0}
it_it: Si è verificato un errore durante il recupero di Prodotto Pricings: {0}
tr_tr: Product Pricingler getirilirken bir hata oluştu: {0}

# ProductPricingService.GetProductPricingByIdExceptionMessage
source: An error occurred while retrieving the Product Pricing: {0}
ar_sa: حدث خطأ أثناء استرجاع the منتج تسعير: {0}
de_de: Fehler beim Abrufen von the Produkt Preisgestaltung: {0}
es_es: Ocurrió un error al recuperar the Producto Precios: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Produit Tarification: {0}
it_it: Si è verificato un errore durante il recupero di the Prodotto Prezzi: {0}
tr_tr: Product Pricing getirilirken bir hata oluştu: {0}

# ProductPricingService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# ProductPricingService.UpdateProductPricingExceptionMessage
source: An error occurred while updating the Product Pricing: {0}
ar_sa: حدث خطأ أثناء تحديث the منتج تسعير: {0}
de_de: Fehler beim Aktualisieren von the Produkt Preisgestaltung: {0}
es_es: Ocurrió un error al actualizar the Producto Precios: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Produit Tarification: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Prodotto Prezzi: {0}
tr_tr: Product Pricing güncellenirken bir hata oluştu: {0}

# ProductPricingGroupByService.ProductPricingGroupBysRetrieved
source: Product pricing group bys retrieved successfully.
ar_sa: منتج pricing group bys تم استرجاعه بنجاح.
de_de: Produkt pricing group bys erfolgreich abgerufen.
es_es: Producto pricing group bys recuperado con éxito.
fr_fr: Produit pricing group bys récupéré(e) avec succès.
it_it: Prodotto pricing group bys recuperato/a con successo.
tr_tr: Ürün fiyatlandırma grupları başarıyla getirildi.

# ProductPricingGroupByService.ProductPricingGroupByNotFound
source: Product pricing group by not found.
ar_sa: منتج pricing group by غير موجود.
de_de: Produkt pricing group by nicht gefunden.
es_es: Producto pricing group by no encontrado.
fr_fr: Produit pricing group by non trouvé(e).
it_it: Prodotto pricing group by non trovato/a.
tr_tr: Ürün fiyatlandırma grubu bulunamadı.

# ProductPricingGroupByService.ProductPricingGroupByRetrieved
source: Product pricing group by retrieved successfully.
ar_sa: منتج pricing group by تم استرجاعه بنجاح.
de_de: Produkt pricing group by erfolgreich abgerufen.
es_es: Producto pricing group by recuperado con éxito.
fr_fr: Produit pricing group by récupéré(e) avec succès.
it_it: Prodotto pricing group by recuperato/a con successo.
tr_tr: Ürün fiyatlandırma grubu başarıyla getirildi.

# ProductPricingGroupByService.ProductPricingGroupByCreated
source: Product pricing group by created successfully.
ar_sa: منتج pricing group by تم إنشاؤه بنجاح.
de_de: Produkt pricing group by erfolgreich erstellt.
es_es: Producto pricing group by creado con éxito.
fr_fr: Produit pricing group by créé(e) avec succès.
it_it: Prodotto pricing group by creato/a con successo.
tr_tr: Ürün fiyatlandırma grubu başarıyla oluşturuldu.

# ProductPricingGroupByService.ProductPricingGroupByUpdated
source: Product pricing group by updated successfully.
ar_sa: منتج pricing group by تم تحديثه بنجاح.
de_de: Produkt pricing group by erfolgreich aktualisiert.
es_es: Producto pricing group by actualizado con éxito.
fr_fr: Produit pricing group by mis(e) à jour avec succès.
it_it: Prodotto pricing group by aggiornato/a con successo.
tr_tr: Ürün fiyatlandırma grubu başarıyla güncellendi.

# ProductPricingGroupByService.ProductPricingGroupByDeleted
source: Product pricing group by deleted successfully.
ar_sa: منتج pricing group by تم حذفه بنجاح.
de_de: Produkt pricing group by erfolgreich gelöscht.
es_es: Producto pricing group by eliminado con éxito.
fr_fr: Produit pricing group by supprimé(e) avec succès.
it_it: Prodotto pricing group by eliminato/a con successo.
tr_tr: Ürün fiyatlandırma grubu başarıyla silindi.

# ProductPricingGroupByService.CreateProductPricingGroupByExceptionMessage
source: An error occurred while creating the Product Pricing Group By: {0}
ar_sa: حدث خطأ أثناء إنشاء the منتج تسعير مجموعة By: {0}
de_de: Fehler beim Erstellen von the Produkt Preisgestaltung Gruppe By: {0}
es_es: Ocurrió un error al crear the Producto Precios Grupo By: {0}
fr_fr: Une erreur est survenue lors de la création de the Produit Tarification Groupe By: {0}
it_it: Si è verificato un errore durante la creazione di the Prodotto Prezzi Gruppo By: {0}
tr_tr: Product Pricing Group By oluşturulurken bir hata oluştu: {0}

# ProductPricingGroupByService.DeleteProductPricingGroupByExceptionMessage
source: An error occurred while deleting the Product Pricing Group By: {0}
ar_sa: حدث خطأ أثناء حذف the منتج تسعير مجموعة By: {0}
de_de: Fehler beim Löschen von the Produkt Preisgestaltung Gruppe By: {0}
es_es: Ocurrió un error al eliminar the Producto Precios Grupo By: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Produit Tarification Groupe By: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Prodotto Prezzi Gruppo By: {0}
tr_tr: Product Pricing Group By silinirken bir hata oluştu: {0}

# ProductPricingGroupByService.GetAllProductPricingGroupBysExceptionMessage
source: An error occurred while retrieving Product Pricing Group Bys: {0}
ar_sa: حدث خطأ أثناء استرجاع منتج تسعير مجموعة Bys: {0}
de_de: Fehler beim Abrufen von Produkt Preisgestaltung Gruppe Bys: {0}
es_es: Ocurrió un error al recuperar Producto Precios Grupo Bys: {0}
fr_fr: Une erreur est survenue lors de la récupération de Produit Tarification Groupe Bys: {0}
it_it: Si è verificato un errore durante il recupero di Prodotto Prezzi Gruppo Bys: {0}
tr_tr: Product Pricing Group Byler getirilirken bir hata oluştu: {0}

# ProductPricingGroupByService.GetProductPricingGroupByByIdExceptionMessage
source: An error occurred while retrieving the Product Pricing Group By: {0}
ar_sa: حدث خطأ أثناء استرجاع the منتج تسعير مجموعة By: {0}
de_de: Fehler beim Abrufen von the Produkt Preisgestaltung Gruppe By: {0}
es_es: Ocurrió un error al recuperar the Producto Precios Grupo By: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Produit Tarification Groupe By: {0}
it_it: Si è verificato un errore durante il recupero di the Prodotto Prezzi Gruppo By: {0}
tr_tr: Product Pricing Group By getirilirken bir hata oluştu: {0}

# ProductPricingGroupByService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.
