Repository: cannasif-ship-it/verii_crm_api
Catalog: Resources/Messages.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, it_it, tr_tr

# AuthService.InvalidCredentials
source: Invalid email or password.
ar_sa: البريد الإلكتروني أو كلمة المرور غير صالحة.
de_de: Ungültige E-Mail oder Passwort.
es_es: Correo electrónico o contraseña inválidos.
fr_fr: Email ou mot de passe invalide.
it_it: Email o password non validi.
tr_tr: Geçersiz e-posta veya şifre.

# AuthService.LoginSuccessful
source: Login successful.
ar_sa: تم تسجيل الدخول بنجاح.
de_de: Anmeldung erfolgreich.
es_es: Inicio de sesión exitoso.
fr_fr: Connexion réussie.
it_it: Login riuscito.
tr_tr: Giriş başarılı.

# AuthService.UserRegistered
source: User registered successfully.
ar_sa: تم تسجيل المستخدم بنجاح.
de_de: Benutzer erfolgreich registriert.
es_es: Usuario registrado con éxito.
fr_fr: Utilisateur inscrit avec succès.
it_it: Utente registrato con successo.
tr_tr: Kullanıcı başarıyla kaydedildi.

# AuthService.EmailAlreadyExists
source: Email already exists.
ar_sa: البريد الإلكتروني موجود بالفعل.
de_de: E-Mail existiert bereits.
es_es: El correo electrónico ya existe.
fr_fr: L'email existe déjà.
it_it: L'email esiste già.
tr_tr: E-posta adresi zaten mevcut.

# AuthService.UsernameAlreadyExists
source: Username already exists.
ar_sa: اسم المستخدم موجود بالفعل.
de_de: Benutzername existiert bereits.
es_es: El nombre de usuario ya existe.
fr_fr: Le nom d'utilisateur existe déjà.
it_it: Il nome utente esiste già.
tr_tr: Kullanıcı adı zaten mevcut.

# AuthService.AdminUserNotFound
source: Admin user not found.
ar_sa: مستخدم مسؤول غير موجود.
de_de: Admin-Benutzer nicht gefunden.
es_es: Usuario administrador no encontrado.
fr_fr: Utilisateur Admin non trouvé(e).
it_it: Utente Admin non trovato/a.
tr_tr: Admin kullanıcısı bulunamadı.

# AuthService.AdminLoginSuccessful
source: Admin login successful.
ar_sa: تم تسجيل دخول المسؤول بنجاح.
de_de: Admin-Anmeldung erfolgreich.
es_es: Inicio de sesión de administrador exitoso.
fr_fr: Connexion Admin réussie.
it_it: Login Admin riuscito.
tr_tr: Admin girişi başarılı.

# AuthService.AdminLoginFailed
source: Admin login failed.
ar_sa: فشل تسجيل دخول المسؤول.
de_de: Admin-Anmeldung fehlgeschlagen.
es_es: Inicio de sesión de administrador fallido.
fr_fr: Connexion Admin échouée.
it_it: Login Admin fallito.
tr_tr: Admin giriş işlemi başarısız.

# AuthService.UserIdNotFound
source: User ID not found.
ar_sa: مستخدم ID غير موجود.
de_de: Benutzer ID nicht gefunden.
es_es: Usuario ID no encontrado.
fr_fr: Utilisateur ID non trouvé(e).
it_it: Utente ID non trovato/a.
tr_tr: Kullanıcı kimliği bulunamadı.

# AuthService.GetProfileFailed
source: Failed to get profile.
ar_sa: فشل في الحصول على الملف الشخصي.
de_de: Fehler beim Abrufen des Profils.
es_es: Error al obtener el perfil.
fr_fr: Échec de la récupération du profil.
it_it: Impossibile recuperare il profilo.
tr_tr: Profil getirme işlemi başarısız.

# AuthService.UserRegisteredSuccessfully
source: User registered successfully.
ar_sa: تم تسجيل المستخدم بنجاح.
de_de: Benutzer erfolgreich registriert.
es_es: Usuario registrado con éxito.
fr_fr: Utilisateur inscrit avec succès.
it_it: Utente registrato con successo.
tr_tr: Kullanıcı başarıyla kaydedildi.

# AuthService.RegistrationFailed
source: Registration failed.
ar_sa: فشل التسجيل.
de_de: Registrierung fehlgeschlagen.
es_es: Registro fallido.
fr_fr: Inscription échouée.
it_it: Registrazione fallita.
tr_tr: Kayıt işlemi başarısız.

# AuthService.LoginFailed
source: Login failed.
ar_sa: فشل تسجيل الدخول.
de_de: Anmeldung fehlgeschlagen.
es_es: Inicio de sesión fallido.
fr_fr: Connexion échouée.
it_it: Login fallito.
tr_tr: Giriş işlemi başarısız.

# AuthUserNotFound
source: User not found.
ar_sa: مستخدم غير موجود.
de_de: Benutzer nicht gefunden.
es_es: Usuario no encontrado.
fr_fr: Utilisateur non trouvé(e).
it_it: Utente non trovato/a.
tr_tr: Kullanıcı bulunamadı.

# AuthUserRetrievedSuccessfully
source: User retrieved successfully.
ar_sa: مستخدم تم استرجاعه بنجاح.
de_de: Benutzer erfolgreich abgerufen.
es_es: Usuario recuperado con éxito.
fr_fr: Utilisateur récupéré(e) avec succès.
it_it: Utente recuperato/a con successo.
tr_tr: Kullanıcı başarıyla getirildi.

# AuthErrorOccurred
source: An error occurred.
tr_tr: Bir hata oluştu.

# AuthUserAlreadyExists
source: User already exists.
tr_tr: Kullanıcı zaten mevcut.

# AuthUserRegisteredSuccessfully
source: User registered successfully.
ar_sa: تم تسجيل المستخدم بنجاح.
de_de: Benutzer erfolgreich registriert.
es_es: Usuario registrado con éxito.
fr_fr: Utilisateur inscrit avec succès.
it_it: Utente registrato con successo.
tr_tr: Kullanıcı başarıyla kaydedildi.

# AuthRegistrationFailed
source: Registration failed.
ar_sa: فشل التسجيل.
de_de: Registrierung fehlgeschlagen.
es_es: Registro fallido.
fr_fr: Inscription échouée.
it_it: Registrazione fallita.
tr_tr: Kayıt işlemi başarısız.

# Error.User.InvalidCredentials
source: User.
tr_tr: Geçersiz kullanıcı adı veya şifre.

# Error.User.LoginFailed
source: User.
tr_tr: Giriş işlemi başarısız.

# Success.User.LoginSuccessful
source: User.
tr_tr: Giriş başarılı.

# AuthSessionNotFound
source: Session not found.
ar_sa: Session غير موجود.
de_de: Session nicht gefunden.
es_es: Session no encontrado.
fr_fr: Session non trouvé(e).
it_it: Session non trovato/a.
tr_tr: Oturum bulunamadı.

source: Data retrieved successfully.
ar_sa: بيانات تم استرجاعه بنجاح.
de_de: Daten erfolgreich abgerufen.
es_es: Datos recuperado con éxito.
fr_fr: Données récupéré(e) avec succès.
it_it: Dati recuperato/a con successo.
tr_tr: Veriler başarıyla getirildi.

source: Active users retrieved successfully.
ar_sa: نشط users تم استرجاعه بنجاح.
de_de: Aktiv users erfolgreich abgerufen.
es_es: Activo users recuperado con éxito.
fr_fr: Actif users récupéré(e) avec succès.
it_it: Attivo users recuperato/a con successo.
tr_tr: Aktif kullanıcılar başarıyla getirildi.

# General.OperationSuccessful
source: Operation successful.
ar_sa: العملية ناجحة.
de_de: Operation erfolgreich.
es_es: Operación exitosa.
fr_fr: Opération réussie.
it_it: Operazione riuscita.
tr_tr: İşlem başarılı.

# UserService.UserNotFound
source: User not found.
ar_sa: مستخدم غير موجود.
de_de: Benutzer nicht gefunden.
es_es: Usuario no encontrado.
fr_fr: Utilisateur non trouvé(e).
it_it: Utente non trovato/a.
tr_tr: Kullanıcı bulunamadı.

# UserService.UserCreated
source: User created successfully.
ar_sa: مستخدم تم إنشاؤه بنجاح.
de_de: Benutzer erfolgreich erstellt.
es_es: Usuario creado con éxito.
fr_fr: Utilisateur créé(e) avec succès.
it_it: Utente creato/a con successo.
tr_tr: Kullanıcı başarıyla oluşturuldu.

# UserService.UserUpdated
source: User updated successfully.
ar_sa: مستخدم تم تحديثه بنجاح.
de_de: Benutzer erfolgreich aktualisiert.
es_es: Usuario actualizado con éxito.
fr_fr: Utilisateur mis(e) à jour avec succès.
it_it: Utente aggiornato/a con successo.
tr_tr: Kullanıcı başarıyla güncellendi.

# UserService.UserDeleted
source: User deleted successfully.
ar_sa: مستخدم تم حذفه بنجاح.
de_de: Benutzer erfolgreich gelöscht.
es_es: Usuario eliminado con éxito.
fr_fr: Utilisateur supprimé(e) avec succès.
it_it: Utente eliminato/a con successo.
tr_tr: Kullanıcı başarıyla silindi.

# UserService.UserRetrieved
source: User retrieved successfully.
ar_sa: مستخدم تم استرجاعه بنجاح.
de_de: Benutzer erfolgreich abgerufen.
es_es: Usuario recuperado con éxito.
fr_fr: Utilisateur récupéré(e) avec succès.
it_it: Utente recuperato/a con successo.
tr_tr: Kullanıcı başarıyla getirildi.

# UserService.UsersRetrieved
source: Users retrieved successfully.
ar_sa: مستخدمين تم استرجاعه بنجاح.
de_de: Benutzer erfolgreich abgerufen.
es_es: Usuarios recuperado con éxito.
fr_fr: Utilisateurs récupéré(e) avec succès.
it_it: Utenti recuperato/a con successo.
tr_tr: Kullanıcılar başarıyla getirildi.

# General.ValidationError
source: Validation error occurred.
ar_sa: حدث خطأ في التحقق.
de_de: Validierungsfehler aufgetreten.
es_es: Ocurrió un error de validación.
fr_fr: Une erreur de validation s'est produite.
it_it: Si è verificato un errore di convalida.
tr_tr: Doğrulama hatası oluştu.

# General.InternalServerError
source: An internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Ein interner Serverfehler ist aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Dahili sunucu hatası oluştu.

# General.Unauthorized
source: Unauthorized access.
ar_sa: دخول غير مصرح به.
de_de: Unbefugter Zugriff.
es_es: Acceso no autorizado.
fr_fr: Accès non autorisé.
it_it: Accesso non autorizzato.
tr_tr: Yetkisiz erişim.

# General.Forbidden
source: Access forbidden.
ar_sa: الوصول ممنوع.
de_de: Zugriff verweigert.
es_es: Acceso prohibido.
fr_fr: Accès interdit.
it_it: Accesso negato.
tr_tr: Erişim yasak.

# General.AccountInactive
source: Your account is not active.
ar_sa: حسابك غير نشط.
de_de: Ihr Konto ist nicht aktiv.
es_es: Su cuenta no está activa.
fr_fr: Votre compte n'est pas actif.
it_it: Il tuo account non è attivo.
tr_tr: Hesabınız aktif değil.

# CityService.CitiesRetrieved
source: Cities retrieved successfully.
ar_sa: مدن تم استرجاعه بنجاح.
de_de: Städte erfolgreich abgerufen.
es_es: Ciudades recuperado con éxito.
fr_fr: Villes récupéré(e) avec succès.
it_it: Città recuperato/a con successo.
tr_tr: Şehirler başarıyla getirildi.

# CityService.CityNotFound
source: City not found.
ar_sa: مدينة غير موجود.
de_de: Stadt nicht gefunden.
es_es: Ciudad no encontrado.
fr_fr: Ville non trouvé(e).
it_it: Città non trovato/a.
tr_tr: Şehir bulunamadı.

# CityService.CityRetrieved
source: City retrieved successfully.
ar_sa: مدينة تم استرجاعه بنجاح.
de_de: Stadt erfolgreich abgerufen.
es_es: Ciudad recuperado con éxito.
fr_fr: Ville récupéré(e) avec succès.
it_it: Città recuperato/a con successo.
tr_tr: Şehir başarıyla getirildi.

# CityService.CityCreated
source: City created successfully.
ar_sa: مدينة تم إنشاؤه بنجاح.
de_de: Stadt erfolgreich erstellt.
es_es: Ciudad creado con éxito.
fr_fr: Ville créé(e) avec succès.
it_it: Città creato/a con successo.
tr_tr: Şehir başarıyla oluşturuldu.

# CityService.CityUpdated
source: City updated successfully.
ar_sa: مدينة تم تحديثه بنجاح.
de_de: Stadt erfolgreich aktualisiert.
es_es: Ciudad actualizado con éxito.
fr_fr: Ville mis(e) à jour avec succès.
it_it: Città aggiornato/a con successo.
tr_tr: Şehir başarıyla güncellendi.

# CityService.CityDeleted
source: City deleted successfully.
ar_sa: مدينة تم حذفه بنجاح.
de_de: Stadt erfolgreich gelöscht.
es_es: Ciudad eliminado con éxito.
fr_fr: Ville supprimé(e) avec succès.
it_it: Città eliminato/a con successo.
tr_tr: Şehir başarıyla silindi.

# CityService.ErrorRetrievingCities
source: An error occurred while retrieving cities.
ar_sa: حدث خطأ أثناء استرجاع cities.
de_de: Fehler beim Abrufen von cities.
es_es: Ocurrió un error al recuperar cities.
fr_fr: Une erreur est survenue lors de la récupération de cities.
it_it: Si è verificato un errore durante il recupero di cities.
tr_tr: Şehirler getirilirken bir hata oluştu.

# CityService.ErrorRetrievingCity
source: An error occurred while retrieving the city.
ar_sa: حدث خطأ أثناء استرجاع the city.
de_de: Fehler beim Abrufen von the city.
es_es: Ocurrió un error al recuperar the city.
fr_fr: Une erreur est survenue lors de la récupération de the city.
it_it: Si è verificato un errore durante il recupero di the city.
tr_tr: Şehir getirilirken bir hata oluştu.

# CityService.ErrorCreatingCity
source: An error occurred while creating the city.
ar_sa: حدث خطأ أثناء إنشاء the city.
de_de: Fehler beim Erstellen von the city.
es_es: Ocurrió un error al crear the city.
fr_fr: Une erreur est survenue lors de la création de the city.
it_it: Si è verificato un errore durante la creazione di the city.
tr_tr: Şehir oluşturulurken bir hata oluştu.

# CityService.ErrorUpdatingCity
source: An error occurred while updating the city.
ar_sa: حدث خطأ أثناء تحديث the city.
de_de: Fehler beim Aktualisieren von the city.
es_es: Ocurrió un error al actualizar the city.
fr_fr: Une erreur est survenue lors de la mise à jour de the city.
it_it: Si è verificato un errore durante l'aggiornamento di the city.
tr_tr: Şehir güncellenirken bir hata oluştu.

# CityService.ErrorDeletingCity
source: An error occurred while deleting the city.
ar_sa: حدث خطأ أثناء حذف the city.
de_de: Fehler beim Löschen von the city.
es_es: Ocurrió un error al eliminar the city.
fr_fr: Une erreur est survenue lors de la suppression de the city.
it_it: Si è verificato un errore durante l'eliminazione di the city.
tr_tr: Şehir silinirken bir hata oluştu.

# CityService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# CityService.GetAllCitiesExceptionMessage
source: An error occurred while retrieving cities: {0}
ar_sa: حدث خطأ أثناء استرجاع cities: {0}
de_de: Fehler beim Abrufen von cities: {0}
es_es: Ocurrió un error al recuperar cities: {0}
fr_fr: Une erreur est survenue lors de la récupération de cities: {0}
it_it: Si è verificato un errore durante il recupero di cities: {0}
tr_tr: Şehirler getirilirken bir hata oluştu: {0}

# CityService.GetCityByIdExceptionMessage
source: An error occurred while retrieving the city: {0}
ar_sa: حدث خطأ أثناء استرجاع the city: {0}
de_de: Fehler beim Abrufen von the city: {0}
es_es: Ocurrió un error al recuperar the city: {0}
fr_fr: Une erreur est survenue lors de la récupération de the city: {0}
it_it: Si è verificato un errore durante il recupero di the city: {0}
tr_tr: Şehir getirilirken bir hata oluştu: {0}

# CityService.CreateCityExceptionMessage
source: An error occurred while creating the city: {0}
ar_sa: حدث خطأ أثناء إنشاء the city: {0}
de_de: Fehler beim Erstellen von the city: {0}
es_es: Ocurrió un error al crear the city: {0}
fr_fr: Une erreur est survenue lors de la création de the city: {0}
it_it: Si è verificato un errore durante la creazione di the city: {0}
tr_tr: Şehir oluşturulurken bir hata oluştu: {0}

# CityService.UpdateCityExceptionMessage
source: An error occurred while updating the city: {0}
ar_sa: حدث خطأ أثناء تحديث the city: {0}
de_de: Fehler beim Aktualisieren von the city: {0}
es_es: Ocurrió un error al actualizar the city: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the city: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the city: {0}
tr_tr: Şehir güncellenirken bir hata oluştu: {0}

# CityService.DeleteCityExceptionMessage
source: An error occurred while deleting the city: {0}
ar_sa: حدث خطأ أثناء حذف the city: {0}
de_de: Fehler beim Löschen von the city: {0}
es_es: Ocurrió un error al eliminar the city: {0}
fr_fr: Une erreur est survenue lors de la suppression de the city: {0}
it_it: Si è verificato un errore durante l'eliminazione di the city: {0}
tr_tr: Şehir silinirken bir hata oluştu: {0}

# CityController.InvalidModelState
source: Invalid model state.
ar_sa: حالة النموذج غير صالحة.
de_de: Ungültiger Modellstatus.
es_es: Estado del modelo no válido.
fr_fr: État du modèle invalide.
it_it: Stato del modello non valido.
tr_tr: Geçersiz model durumu.

# CityController.InvalidModelStateExceptionMessage
source: Model validation error: {0}
ar_sa: خطأ في التحقق من النموذج: {0}
de_de: Modellvalidierungsfehler: {0}
es_es: Error de validación del modelo: {0}
fr_fr: Erreur de validation du modèle: {0}
it_it: Errore di convalida del modello: {0}
tr_tr: Model doğrulama hatası: {0}

# CountryService.CountriesRetrieved
source: Countries retrieved successfully.
ar_sa: بلدان تم استرجاعه بنجاح.
de_de: Länder erfolgreich abgerufen.
es_es: Países recuperado con éxito.
fr_fr: Pays récupéré(e) avec succès.
it_it: Paesi recuperato/a con successo.
tr_tr: Ülkeler başarıyla getirildi.

# CountryService.CountryNotFound
source: Country not found.
ar_sa: بلد غير موجود.
de_de: Land nicht gefunden.
es_es: País no encontrado.
fr_fr: Pays non trouvé(e).
it_it: Paese non trovato/a.
tr_tr: Ülke bulunamadı.

# CountryService.CountryRetrieved
source: Country retrieved successfully.
ar_sa: بلد تم استرجاعه بنجاح.
de_de: Land erfolgreich abgerufen.
es_es: País recuperado con éxito.
fr_fr: Pays récupéré(e) avec succès.
it_it: Paese recuperato/a con successo.
tr_tr: Ülke başarıyla getirildi.

# CountryService.CountryCreated
source: Country created successfully.
ar_sa: بلد تم إنشاؤه بنجاح.
de_de: Land erfolgreich erstellt.
es_es: País creado con éxito.
fr_fr: Pays créé(e) avec succès.
it_it: Paese creato/a con successo.
tr_tr: Ülke başarıyla oluşturuldu.

# CountryService.CountryUpdated
source: Country updated successfully.
ar_sa: بلد تم تحديثه بنجاح.
de_de: Land erfolgreich aktualisiert.
es_es: País actualizado con éxito.
fr_fr: Pays mis(e) à jour avec succès.
it_it: Paese aggiornato/a con successo.
tr_tr: Ülke başarıyla güncellendi.

# CountryService.CountryDeleted
source: Country deleted successfully.
ar_sa: بلد تم حذفه بنجاح.
de_de: Land erfolgreich gelöscht.
es_es: País eliminado con éxito.
fr_fr: Pays supprimé(e) avec succès.
it_it: Paese eliminato/a con successo.
tr_tr: Ülke başarıyla silindi.

# CountryService.ErrorRetrievingCountries
source: An error occurred while retrieving countries.
ar_sa: حدث خطأ أثناء استرجاع countries.
de_de: Fehler beim Abrufen von countries.
es_es: Ocurrió un error al recuperar countries.
fr_fr: Une erreur est survenue lors de la récupération de countries.
it_it: Si è verificato un errore durante il recupero di countries.
tr_tr: Ülkeler getirilirken bir hata oluştu.

# CountryService.ErrorRetrievingCountry
source: An error occurred while retrieving the country.
ar_sa: حدث خطأ أثناء استرجاع the country.
de_de: Fehler beim Abrufen von the country.
es_es: Ocurrió un error al recuperar the country.
fr_fr: Une erreur est survenue lors de la récupération de the country.
it_it: Si è verificato un errore durante il recupero di the country.
tr_tr: Ülke getirilirken bir hata oluştu.

# CountryService.ErrorCreatingCountry
source: An error occurred while creating the country.
ar_sa: حدث خطأ أثناء إنشاء the country.
de_de: Fehler beim Erstellen von the country.
es_es: Ocurrió un error al crear the country.
fr_fr: Une erreur est survenue lors de la création de the country.
it_it: Si è verificato un errore durante la creazione di the country.
tr_tr: Ülke oluşturulurken bir hata oluştu.

# CountryService.ErrorUpdatingCountry
source: An error occurred while updating the country.
ar_sa: حدث خطأ أثناء تحديث the country.
de_de: Fehler beim Aktualisieren von the country.
es_es: Ocurrió un error al actualizar the country.
fr_fr: Une erreur est survenue lors de la mise à jour de the country.
it_it: Si è verificato un errore durante l'aggiornamento di the country.
tr_tr: Ülke güncellenirken bir hata oluştu.

# CountryService.ErrorDeletingCountry
source: An error occurred while deleting the country.
ar_sa: حدث خطأ أثناء حذف the country.
de_de: Fehler beim Löschen von the country.
es_es: Ocurrió un error al eliminar the country.
fr_fr: Une erreur est survenue lors de la suppression de the country.
it_it: Si è verificato un errore durante l'eliminazione di the country.
tr_tr: Ülke silinirken bir hata oluştu.

# CountryService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# CountryService.GetAllCountriesExceptionMessage
source: An error occurred while retrieving countries: {0}
ar_sa: حدث خطأ أثناء استرجاع countries: {0}
de_de: Fehler beim Abrufen von countries: {0}
es_es: Ocurrió un error al recuperar countries: {0}
fr_fr: Une erreur est survenue lors de la récupération de countries: {0}
it_it: Si è verificato un errore durante il recupero di countries: {0}
tr_tr: Ülkeler getirilirken bir hata oluştu: {0}

# CountryService.GetCountryByIdExceptionMessage
source: An error occurred while retrieving the country: {0}
ar_sa: حدث خطأ أثناء استرجاع the country: {0}
de_de: Fehler beim Abrufen von the country: {0}
es_es: Ocurrió un error al recuperar the country: {0}
fr_fr: Une erreur est survenue lors de la récupération de the country: {0}
it_it: Si è verificato un errore durante il recupero di the country: {0}
tr_tr: Ülke getirilirken bir hata oluştu: {0}

# CountryService.CreateCountryExceptionMessage
source: An error occurred while creating the country: {0}
ar_sa: حدث خطأ أثناء إنشاء the country: {0}
de_de: Fehler beim Erstellen von the country: {0}
es_es: Ocurrió un error al crear the country: {0}
fr_fr: Une erreur est survenue lors de la création de the country: {0}
it_it: Si è verificato un errore durante la creazione di the country: {0}
tr_tr: Ülke oluşturulurken bir hata oluştu: {0}

# CountryService.UpdateCountryExceptionMessage
source: An error occurred while updating the country: {0}
ar_sa: حدث خطأ أثناء تحديث the country: {0}
de_de: Fehler beim Aktualisieren von the country: {0}
es_es: Ocurrió un error al actualizar the country: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the country: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the country: {0}
tr_tr: Ülke güncellenirken bir hata oluştu: {0}

# CountryService.DeleteCountryExceptionMessage
source: An error occurred while deleting the country: {0}
ar_sa: حدث خطأ أثناء حذف the country: {0}
de_de: Fehler beim Löschen von the country: {0}
es_es: Ocurrió un error al eliminar the country: {0}
fr_fr: Une erreur est survenue lors de la suppression de the country: {0}
it_it: Si è verificato un errore durante l'eliminazione di the country: {0}
tr_tr: Ülke silinirken bir hata oluştu: {0}

# CountryController.InvalidModelState
source: Invalid model state.
ar_sa: حالة النموذج غير صالحة.
de_de: Ungültiger Modellstatus.
es_es: Estado del modelo no válido.
fr_fr: État du modèle invalide.
it_it: Stato del modello non valido.
tr_tr: Geçersiz model durumu.

# CountryController.InvalidModelStateExceptionMessage
source: Model validation error: {0}
ar_sa: خطأ في التحقق من النموذج: {0}
de_de: Modellvalidierungsfehler: {0}
es_es: Error de validación del modelo: {0}
fr_fr: Erreur de validation du modèle: {0}
it_it: Errore di convalida del modello: {0}
tr_tr: Model doğrulama hatası: {0}

# DistrictService.DistrictsRetrieved
source: Districts retrieved successfully.
ar_sa: مناطق تم استرجاعه بنجاح.
de_de: Bezirke erfolgreich abgerufen.
es_es: Distritos recuperado con éxito.
fr_fr: Districts récupéré(e) avec succès.
it_it: Distretti recuperato/a con successo.
tr_tr: İlçeler başarıyla getirildi.

# DistrictService.DistrictNotFound
source: District not found.
ar_sa: منطقة غير موجود.
de_de: Bezirk nicht gefunden.
es_es: Distrito no encontrado.
fr_fr: District non trouvé(e).
it_it: Distretto non trovato/a.
tr_tr: İlçe bulunamadı.

# DistrictService.DistrictRetrieved
source: District retrieved successfully.
ar_sa: منطقة تم استرجاعه بنجاح.
de_de: Bezirk erfolgreich abgerufen.
es_es: Distrito recuperado con éxito.
fr_fr: District récupéré(e) avec succès.
it_it: Distretto recuperato/a con successo.
tr_tr: İlçe başarıyla getirildi.

# DistrictService.DistrictCreated
source: District created successfully.
ar_sa: منطقة تم إنشاؤه بنجاح.
de_de: Bezirk erfolgreich erstellt.
es_es: Distrito creado con éxito.
fr_fr: District créé(e) avec succès.
it_it: Distretto creato/a con successo.
tr_tr: İlçe başarıyla oluşturuldu.

# DistrictService.DistrictUpdated
source: District updated successfully.
ar_sa: منطقة تم تحديثه بنجاح.
de_de: Bezirk erfolgreich aktualisiert.
es_es: Distrito actualizado con éxito.
fr_fr: District mis(e) à jour avec succès.
it_it: Distretto aggiornato/a con successo.
tr_tr: İlçe başarıyla güncellendi.
