Repository: cannasif-ship-it/verii_crm_api
Catalog: Resources/Messages.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, it_it, tr_tr

# ProductPricingGroupByService.UpdateProductPricingGroupByExceptionMessage
source: An error occurred while updating the Product Pricing Group By: {0}
ar_sa: حدث خطأ أثناء تحديث the منتج تسعير مجموعة By: {0}
de_de: Fehler beim Aktualisieren von the Produkt Preisgestaltung Gruppe By: {0}
es_es: Ocurrió un error al actualizar the Producto Precios Grupo By: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Produit Tarification Groupe By: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Prodotto Prezzi Gruppo By: {0}
tr_tr: Product Pricing Group By güncellenirken bir hata oluştu: {0}

# UserDiscountLimitService.UserDiscountLimitsRetrieved
source: User discount limits retrieved successfully.
ar_sa: مستخدم discount limits تم استرجاعه بنجاح.
de_de: Benutzer discount limits erfolgreich abgerufen.
es_es: Usuario discount limits recuperado con éxito.
fr_fr: Utilisateur discount limits récupéré(e) avec succès.
it_it: Utente discount limits recuperato/a con successo.
tr_tr: Kullanıcı indirim limitleri başarıyla getirildi.

# UserDiscountLimitService.UserDiscountLimitNotFound
source: User discount limit not found.
ar_sa: مستخدم discount limit غير موجود.
de_de: Benutzer discount limit nicht gefunden.
es_es: Usuario discount limit no encontrado.
fr_fr: Utilisateur discount limit non trouvé(e).
it_it: Utente discount limit non trovato/a.
tr_tr: Kullanıcı indirim limiti bulunamadı.

# UserDiscountLimitService.UserDiscountLimitRetrieved
source: User discount limit retrieved successfully.
ar_sa: مستخدم discount limit تم استرجاعه بنجاح.
de_de: Benutzer discount limit erfolgreich abgerufen.
es_es: Usuario discount limit recuperado con éxito.
fr_fr: Utilisateur discount limit récupéré(e) avec succès.
it_it: Utente discount limit recuperato/a con successo.
tr_tr: Kullanıcı indirim limiti başarıyla getirildi.

# UserDiscountLimitService.UserDiscountLimitCreated
source: User discount limit created successfully.
ar_sa: مستخدم discount limit تم إنشاؤه بنجاح.
de_de: Benutzer discount limit erfolgreich erstellt.
es_es: Usuario discount limit creado con éxito.
fr_fr: Utilisateur discount limit créé(e) avec succès.
it_it: Utente discount limit creato/a con successo.
tr_tr: Kullanıcı indirim limiti başarıyla oluşturuldu.

# UserDiscountLimitService.UserDiscountLimitUpdated
source: User discount limit updated successfully.
ar_sa: مستخدم discount limit تم تحديثه بنجاح.
de_de: Benutzer discount limit erfolgreich aktualisiert.
es_es: Usuario discount limit actualizado con éxito.
fr_fr: Utilisateur discount limit mis(e) à jour avec succès.
it_it: Utente discount limit aggiornato/a con successo.
tr_tr: Kullanıcı indirim limiti başarıyla güncellendi.

# UserDiscountLimitService.UserDiscountLimitDeleted
source: User discount limit deleted successfully.
ar_sa: مستخدم discount limit تم حذفه بنجاح.
de_de: Benutzer discount limit erfolgreich gelöscht.
es_es: Usuario discount limit eliminado con éxito.
fr_fr: Utilisateur discount limit supprimé(e) avec succès.
it_it: Utente discount limit eliminato/a con successo.
tr_tr: Kullanıcı indirim limiti başarıyla silindi.

# UserDiscountLimitService.UserDiscountLimitExistsChecked
source: User discount limit existence checked successfully.
tr_tr: Kullanıcı indirim limiti varlığı başarıyla kontrol edildi.

# UserDiscountLimitService.AlreadyExists
source: UserDiscountLimit for salesperson {0} and group {1} already exists.
tr_tr: Satış temsilcisi {0} ve grup {1} için kullanıcı indirim limiti zaten mevcut.

# UserDiscountLimitService.CreateExceptionMessage
source: An error occurred while creating the User Discount Limit: {0}
ar_sa: حدث خطأ أثناء إنشاء the مستخدم خصم Limit: {0}
de_de: Fehler beim Erstellen von the Benutzer Rabatt Limit: {0}
es_es: Ocurrió un error al crear the Usuario Descuento Limit: {0}
fr_fr: Une erreur est survenue lors de la création de the Utilisateur Remise Limit: {0}
it_it: Si è verificato un errore durante la creazione di the Utente Sconto Limit: {0}
tr_tr: User Discount Limit oluşturulurken bir hata oluştu: {0}

# UserDiscountLimitService.DeleteExceptionMessage
source: An error occurred while deleting the User Discount Limit: {0}
ar_sa: حدث خطأ أثناء حذف the مستخدم خصم Limit: {0}
de_de: Fehler beim Löschen von the Benutzer Rabatt Limit: {0}
es_es: Ocurrió un error al eliminar the Usuario Descuento Limit: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Utilisateur Remise Limit: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Utente Sconto Limit: {0}
tr_tr: User Discount Limit silinirken bir hata oluştu: {0}

# UserDiscountLimitService.ExistsBySalespersonAndGroupExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# UserDiscountLimitService.ExistsExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# UserDiscountLimitService.GetAllExceptionMessage
source: An error occurred while retrieving User Discount Limits: {0}
ar_sa: حدث خطأ أثناء استرجاع مستخدم خصم Limits: {0}
de_de: Fehler beim Abrufen von Benutzer Rabatt Limits: {0}
es_es: Ocurrió un error al recuperar Usuario Descuento Limits: {0}
fr_fr: Une erreur est survenue lors de la récupération de Utilisateur Remise Limits: {0}
it_it: Si è verificato un errore durante il recupero di Utente Sconto Limits: {0}
tr_tr: User Discount Limitler getirilirken bir hata oluştu: {0}

# UserDiscountLimitService.GetByErpProductGroupCodeExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# UserDiscountLimitService.GetByIdExceptionMessage
source: An error occurred while retrieving the User Discount Limit: {0}
ar_sa: حدث خطأ أثناء استرجاع the مستخدم خصم Limit: {0}
de_de: Fehler beim Abrufen von the Benutzer Rabatt Limit: {0}
es_es: Ocurrió un error al recuperar the Usuario Descuento Limit: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Utilisateur Remise Limit: {0}
it_it: Si è verificato un errore durante il recupero di the Utente Sconto Limit: {0}
tr_tr: User Discount Limit getirilirken bir hata oluştu: {0}

# UserDiscountLimitService.GetBySalespersonAndGroupExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# UserDiscountLimitService.GetBySalespersonIdExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# UserDiscountLimitService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# UserDiscountLimitService.UpdateExceptionMessage
source: An error occurred while updating the User Discount Limit: {0}
ar_sa: حدث خطأ أثناء تحديث the مستخدم خصم Limit: {0}
de_de: Fehler beim Aktualisieren von the Benutzer Rabatt Limit: {0}
es_es: Ocurrió un error al actualizar the Usuario Descuento Limit: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Utilisateur Remise Limit: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Utente Sconto Limit: {0}
tr_tr: User Discount Limit güncellenirken bir hata oluştu: {0}

# UserService.UserAlreadyExists
source: User already exists.
tr_tr: Kullanıcı zaten mevcut.

# ErpService.CariRecordsRetrieved
source: Cari records retrieved successfully.
ar_sa: Cari records تم استرجاعه بنجاح.
de_de: Cari records erfolgreich abgerufen.
es_es: Cari records recuperado con éxito.
fr_fr: Cari records récupéré(e) avec succès.
it_it: Cari records recuperato/a con successo.
tr_tr: Cari kayıtları başarıyla getirildi.

# ErpService.ErrorRetrievingCariRecords
source: An error occurred while retrieving Cari records.
ar_sa: حدث خطأ أثناء استرجاع Cari records.
de_de: Fehler beim Abrufen von Cari records.
es_es: Ocurrió un error al recuperar Cari records.
fr_fr: Une erreur est survenue lors de la récupération de Cari records.
it_it: Si è verificato un errore durante il recupero di Cari records.
tr_tr: Cari kayıtları getirilirken bir hata oluştu.

# ErpService.DepoRecordsRetrieved
source: Depo records retrieved successfully.
ar_sa: Depo records تم استرجاعه بنجاح.
de_de: Depo records erfolgreich abgerufen.
es_es: Depo records recuperado con éxito.
fr_fr: Depo records récupéré(e) avec succès.
it_it: Depo records recuperato/a con successo.
tr_tr: Depo kayıtları başarıyla getirildi.

# ErpService.ErrorRetrievingDepoRecords
source: An error occurred while retrieving Depo records.
ar_sa: حدث خطأ أثناء استرجاع Depo records.
de_de: Fehler beim Abrufen von Depo records.
es_es: Ocurrió un error al recuperar Depo records.
fr_fr: Une erreur est survenue lors de la récupération de Depo records.
it_it: Si è verificato un errore durante il recupero di Depo records.
tr_tr: Depo kayıtları getirilirken bir hata oluştu.

# ErpService.StokRecordsRetrieved
source: Stok records retrieved successfully.
ar_sa: Stok records تم استرجاعه بنجاح.
de_de: Stok records erfolgreich abgerufen.
es_es: Stok records recuperado con éxito.
fr_fr: Stok records récupéré(e) avec succès.
it_it: Stok records recuperato/a con successo.
tr_tr: Stok kayıtları başarıyla getirildi.

# ErpService.ErrorRetrievingStokRecords
source: An error occurred while retrieving Stok records.
ar_sa: حدث خطأ أثناء استرجاع Stok records.
de_de: Fehler beim Abrufen von Stok records.
es_es: Ocurrió un error al recuperar Stok records.
fr_fr: Une erreur est survenue lors de la récupération de Stok records.
it_it: Si è verificato un errore durante il recupero di Stok records.
tr_tr: Stok kayıtları getirilirken bir hata oluştu.

# ErpService.ProjeRecordsRetrieved
source: Proje records retrieved successfully.
ar_sa: Proje records تم استرجاعه بنجاح.
de_de: Proje records erfolgreich abgerufen.
es_es: Proje records recuperado con éxito.
fr_fr: Proje records récupéré(e) avec succès.
it_it: Proje records recuperato/a con successo.
tr_tr: Proje kayıtları başarıyla getirildi.

# ErpService.ErrorRetrievingProjeRecords
source: An error occurred while retrieving Proje records.
ar_sa: حدث خطأ أثناء استرجاع Proje records.
de_de: Fehler beim Abrufen von Proje records.
es_es: Ocurrió un error al recuperar Proje records.
fr_fr: Une erreur est survenue lors de la récupération de Proje records.
it_it: Si è verificato un errore durante il recupero di Proje records.
tr_tr: Proje kayıtları getirilirken bir hata oluştu.

# ErpService.OnHandQuantityRetrieved
source: OnHand Quantity records retrieved successfully.
ar_sa: OnHand كمية records تم استرجاعه بنجاح.
de_de: OnHand Menge records erfolgreich abgerufen.
es_es: OnHand Cantidad records recuperado con éxito.
fr_fr: OnHand Quantité records récupéré(e) avec succès.
it_it: OnHand Quantità records recuperato/a con successo.
tr_tr: Eldeki miktar kayıtları başarıyla getirildi.

# ErpService.ErrorRetrievingOnHandQuantityRecords
source: An error occurred while retrieving OnHand Quantity records.
ar_sa: حدث خطأ أثناء استرجاع OnHand كمية records.
de_de: Fehler beim Abrufen von OnHand Menge records.
es_es: Ocurrió un error al recuperar OnHand Cantidad records.
fr_fr: Une erreur est survenue lors de la récupération de OnHand Quantité records.
it_it: Si è verificato un errore durante il recupero di OnHand Quantità records.
tr_tr: Eldeki miktar kayıtları getirilirken bir hata oluştu.

# ErpService.ProductPricingRetrieved
source: Product pricing retrieved successfully.
ar_sa: منتج pricing تم استرجاعه بنجاح.
de_de: Produkt pricing erfolgreich abgerufen.
es_es: Producto pricing recuperado con éxito.
fr_fr: Produit pricing récupéré(e) avec succès.
it_it: Prodotto pricing recuperato/a con successo.
tr_tr: Ürün fiyatlandırması başarıyla getirildi.

# ErpService.ErpConnectionSuccessful
source: ERP connection successful.
tr_tr: ERP bağlantısı başarılı.

# ErpService.ErpConnectionFailed
source: ERP connection failed.
tr_tr: ERP bağlantısı başarısız.

# ErpService.BranchCodeRetrieved
source: Erp retrieved successfully.
ar_sa: Erp تم استرجاعه بنجاح.
de_de: Erp erfolgreich abgerufen.
es_es: Erp recuperado con éxito.
fr_fr: Erp récupéré(e) avec succès.
it_it: Erp recuperato/a con successo.
tr_tr: Erp başarıyla getirildi.

# ErpService.ExchangeRateRecordsRetrieved
source: Erps retrieved successfully.
ar_sa: Erps تم استرجاعه بنجاح.
de_de: Erps erfolgreich abgerufen.
es_es: Erps recuperado con éxito.
fr_fr: Erps récupéré(e) avec succès.
it_it: Erps recuperato/a con successo.
tr_tr: Erpler başarıyla getirildi.

# ErpService.GetAllErpShippingAddressExceptionMessage
source: An error occurred while retrieving Erps: {0}
ar_sa: حدث خطأ أثناء استرجاع Erps: {0}
de_de: Fehler beim Abrufen von Erps: {0}
es_es: Ocurrió un error al recuperar Erps: {0}
fr_fr: Une erreur est survenue lors de la récupération de Erps: {0}
it_it: Si è verificato un errore durante il recupero di Erps: {0}
tr_tr: Erpler getirilirken bir hata oluştu: {0}

# ErpService.GetAllExchangeRateExceptionMessage
source: An error occurred while retrieving Erps: {0}
ar_sa: حدث خطأ أثناء استرجاع Erps: {0}
de_de: Fehler beim Abrufen von Erps: {0}
es_es: Ocurrió un error al recuperar Erps: {0}
fr_fr: Une erreur est survenue lors de la récupération de Erps: {0}
it_it: Si è verificato un errore durante il recupero di Erps: {0}
tr_tr: Erpler getirilirken bir hata oluştu: {0}

# ErpService.GetAllStokExceptionMessage
source: An error occurred while retrieving Erps: {0}
ar_sa: حدث خطأ أثناء استرجاع Erps: {0}
de_de: Fehler beim Abrufen von Erps: {0}
es_es: Ocurrió un error al recuperar Erps: {0}
fr_fr: Une erreur est survenue lors de la récupération de Erps: {0}
it_it: Si è verificato un errore durante il recupero di Erps: {0}
tr_tr: Erpler getirilirken bir hata oluştu: {0}

# ErpService.GetAllStokGroupExceptionMessage
source: An error occurred while retrieving Erps: {0}
ar_sa: حدث خطأ أثناء استرجاع Erps: {0}
de_de: Fehler beim Abrufen von Erps: {0}
es_es: Ocurrió un error al recuperar Erps: {0}
fr_fr: Une erreur est survenue lors de la récupération de Erps: {0}
it_it: Si è verificato un errore durante il recupero di Erps: {0}
tr_tr: Erpler getirilirken bir hata oluştu: {0}

# ErpService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# ErpService.StokGroupRecordsRetrieved
source: Erps retrieved successfully.
ar_sa: Erps تم استرجاعه بنجاح.
de_de: Erps erfolgreich abgerufen.
es_es: Erps recuperado con éxito.
fr_fr: Erps récupéré(e) avec succès.
it_it: Erps recuperato/a con successo.
tr_tr: Erpler başarıyla getirildi.

# PaymentTypeService.PaymentTypesRetrieved
source: Payment types retrieved successfully.
ar_sa: دفعة types تم استرجاعه بنجاح.
de_de: Zahlung types erfolgreich abgerufen.
es_es: Pago types recuperado con éxito.
fr_fr: Paiement types récupéré(e) avec succès.
it_it: Pagamento types recuperato/a con successo.
tr_tr: Ödeme tipleri başarıyla getirildi.

# PaymentTypeService.PaymentTypeNotFound
source: Payment type not found.
ar_sa: دفعة type غير موجود.
de_de: Zahlung type nicht gefunden.
es_es: Pago type no encontrado.
fr_fr: Paiement type non trouvé(e).
it_it: Pagamento type non trovato/a.
tr_tr: Ödeme tipi bulunamadı.

# PaymentTypeService.PaymentTypeRetrieved
source: Payment type retrieved successfully.
ar_sa: دفعة type تم استرجاعه بنجاح.
de_de: Zahlung type erfolgreich abgerufen.
es_es: Pago type recuperado con éxito.
fr_fr: Paiement type récupéré(e) avec succès.
it_it: Pagamento type recuperato/a con successo.
tr_tr: Ödeme tipi başarıyla getirildi.

# PaymentTypeService.PaymentTypeCreated
source: Payment type created successfully.
ar_sa: دفعة type تم إنشاؤه بنجاح.
de_de: Zahlung type erfolgreich erstellt.
es_es: Pago type creado con éxito.
fr_fr: Paiement type créé(e) avec succès.
it_it: Pagamento type creato/a con successo.
tr_tr: Ödeme tipi başarıyla oluşturuldu.

# PaymentTypeService.PaymentTypeUpdated
source: Payment type updated successfully.
ar_sa: دفعة type تم تحديثه بنجاح.
de_de: Zahlung type erfolgreich aktualisiert.
es_es: Pago type actualizado con éxito.
fr_fr: Paiement type mis(e) à jour avec succès.
it_it: Pagamento type aggiornato/a con successo.
tr_tr: Ödeme tipi başarıyla güncellendi.

# PaymentTypeService.PaymentTypeDeleted
source: Payment type deleted successfully.
ar_sa: دفعة type تم حذفه بنجاح.
de_de: Zahlung type erfolgreich gelöscht.
es_es: Pago type eliminado con éxito.
fr_fr: Paiement type supprimé(e) avec succès.
it_it: Pagamento type eliminato/a con successo.
tr_tr: Ödeme tipi başarıyla silindi.

# PaymentTypeService.CreatePaymentTypeExceptionMessage
source: An error occurred while creating the Payment Type: {0}
ar_sa: حدث خطأ أثناء إنشاء the دفعة نوع: {0}
de_de: Fehler beim Erstellen von the Zahlung Typ: {0}
es_es: Ocurrió un error al crear the Pago Tipo: {0}
fr_fr: Une erreur est survenue lors de la création de the Paiement Type: {0}
it_it: Si è verificato un errore durante la creazione di the Pagamento Tipo: {0}
tr_tr: Payment Type oluşturulurken bir hata oluştu: {0}

# PaymentTypeService.DeletePaymentTypeExceptionMessage
source: An error occurred while deleting the Payment Type: {0}
ar_sa: حدث خطأ أثناء حذف the دفعة نوع: {0}
de_de: Fehler beim Löschen von the Zahlung Typ: {0}
es_es: Ocurrió un error al eliminar the Pago Tipo: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Paiement Type: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Pagamento Tipo: {0}
tr_tr: Payment Type silinirken bir hata oluştu: {0}

# PaymentTypeService.GetAllPaymentTypesExceptionMessage
source: An error occurred while retrieving Payment Types: {0}
ar_sa: حدث خطأ أثناء استرجاع دفعة Types: {0}
de_de: Fehler beim Abrufen von Zahlung Types: {0}
es_es: Ocurrió un error al recuperar Pago Types: {0}
fr_fr: Une erreur est survenue lors de la récupération de Paiement Types: {0}
it_it: Si è verificato un errore durante il recupero di Pagamento Types: {0}
tr_tr: Payment Typeler getirilirken bir hata oluştu: {0}

# PaymentTypeService.GetPaymentTypeByIdExceptionMessage
source: An error occurred while retrieving the Payment Type: {0}
ar_sa: حدث خطأ أثناء استرجاع the دفعة نوع: {0}
de_de: Fehler beim Abrufen von the Zahlung Typ: {0}
es_es: Ocurrió un error al recuperar the Pago Tipo: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Paiement Type: {0}
it_it: Si è verificato un errore durante il recupero di the Pagamento Tipo: {0}
tr_tr: Payment Type getirilirken bir hata oluştu: {0}

# PaymentTypeService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# PaymentTypeService.UpdatePaymentTypeExceptionMessage
source: An error occurred while updating the Payment Type: {0}
ar_sa: حدث خطأ أثناء تحديث the دفعة نوع: {0}
de_de: Fehler beim Aktualisieren von the Zahlung Typ: {0}
es_es: Ocurrió un error al actualizar the Pago Tipo: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Paiement Type: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Pagamento Tipo: {0}
tr_tr: Payment Type güncellenirken bir hata oluştu: {0}

# ShippingAddressService.ShippingAddressesRetrieved
source: Shipping addresses retrieved successfully.
ar_sa: Shipping addresses تم استرجاعه بنجاح.
de_de: Shipping addresses erfolgreich abgerufen.
es_es: Shipping addresses recuperado con éxito.
fr_fr: Shipping addresses récupéré(e) avec succès.
it_it: Shipping addresses recuperato/a con successo.
tr_tr: Sevk adresleri başarıyla getirildi.

# ShippingAddressService.ShippingAddressNotFound
source: Shipping address not found.
ar_sa: Shipping address غير موجود.
de_de: Shipping address nicht gefunden.
es_es: Shipping address no encontrado.
fr_fr: Shipping address non trouvé(e).
it_it: Shipping address non trovato/a.
tr_tr: Sevk adresi bulunamadı.

# ShippingAddressService.ShippingAddressRetrieved
source: Shipping address retrieved successfully.
ar_sa: Shipping address تم استرجاعه بنجاح.
de_de: Shipping address erfolgreich abgerufen.
es_es: Shipping address recuperado con éxito.
fr_fr: Shipping address récupéré(e) avec succès.
it_it: Shipping address recuperato/a con successo.
tr_tr: Sevk adresi başarıyla getirildi.

# ShippingAddressService.ShippingAddressCreated
source: Shipping address created successfully.
ar_sa: Shipping address تم إنشاؤه بنجاح.
de_de: Shipping address erfolgreich erstellt.
es_es: Shipping address creado con éxito.
fr_fr: Shipping address créé(e) avec succès.
it_it: Shipping address creato/a con successo.
tr_tr: Sevk adresi başarıyla oluşturuldu.

# ShippingAddressService.ShippingAddressUpdated
source: Shipping address updated successfully.
ar_sa: Shipping address تم تحديثه بنجاح.
de_de: Shipping address erfolgreich aktualisiert.
es_es: Shipping address actualizado con éxito.
fr_fr: Shipping address mis(e) à jour avec succès.
it_it: Shipping address aggiornato/a con successo.
tr_tr: Sevk adresi başarıyla güncellendi.

# ShippingAddressService.ShippingAddressDeleted
source: Shipping address deleted successfully.
ar_sa: Shipping address تم حذفه بنجاح.
de_de: Shipping address erfolgreich gelöscht.
es_es: Shipping address eliminado con éxito.
fr_fr: Shipping address supprimé(e) avec succès.
it_it: Shipping address eliminato/a con successo.
tr_tr: Sevk adresi başarıyla silindi.

# ShippingAddressService.ShippingAddressesByCustomerRetrieved
source: Customer shipping addresses retrieved successfully.
ar_sa: عميل shipping addresses تم استرجاعه بنجاح.
de_de: Kunde shipping addresses erfolgreich abgerufen.
es_es: Cliente shipping addresses recuperado con éxito.
fr_fr: Client shipping addresses récupéré(e) avec succès.
it_it: Cliente shipping addresses recuperato/a con successo.
tr_tr: Müşteri sevk adresleri başarıyla getirildi.

# ShippingAddressService.CreateShippingAddressExceptionMessage
source: An error occurred while creating the Shipping Address: {0}
ar_sa: حدث خطأ أثناء إنشاء the Shipping عنوان: {0}
de_de: Fehler beim Erstellen von the Shipping Adresse: {0}
es_es: Ocurrió un error al crear the Shipping Dirección: {0}
fr_fr: Une erreur est survenue lors de la création de the Shipping Adresse: {0}
it_it: Si è verificato un errore durante la creazione di the Shipping Indirizzo: {0}
tr_tr: Shipping Address oluşturulurken bir hata oluştu: {0}

# ShippingAddressService.DeleteShippingAddressExceptionMessage
source: An error occurred while deleting the Shipping Address: {0}
ar_sa: حدث خطأ أثناء حذف the Shipping عنوان: {0}
de_de: Fehler beim Löschen von the Shipping Adresse: {0}
es_es: Ocurrió un error al eliminar the Shipping Dirección: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Shipping Adresse: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Shipping Indirizzo: {0}
tr_tr: Shipping Address silinirken bir hata oluştu: {0}

# ShippingAddressService.GetAllShippingAddressesExceptionMessage
source: An error occurred while retrieving Shipping Addresss: {0}
ar_sa: حدث خطأ أثناء استرجاع Shipping Addresss: {0}
de_de: Fehler beim Abrufen von Shipping Addresss: {0}
es_es: Ocurrió un error al recuperar Shipping Addresss: {0}
fr_fr: Une erreur est survenue lors de la récupération de Shipping Addresss: {0}
it_it: Si è verificato un errore durante il recupero di Shipping Addresss: {0}
tr_tr: Shipping Addressler getirilirken bir hata oluştu: {0}
