Repository: cannasif-ship-it/verii_crm_api
Catalog: Resources/Messages.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, it_it, tr_tr

# PricingRuleSalesmanService.SalesmanNotFound
source: Pricing Rule Salesman not found.
ar_sa: تسعير Rule Salesman غير موجود.
de_de: Preisgestaltung Rule Salesman nicht gefunden.
es_es: Precios Rule Salesman no encontrado.
fr_fr: Tarification Rule Salesman non trouvé(e).
it_it: Prezzi Rule Salesman non trovato/a.
tr_tr: Pricing Rule Salesman bulunamadı.

# PricingRuleSalesmanService.SalesmanRetrieved
source: Pricing Rule Salesman retrieved successfully.
ar_sa: تسعير Rule Salesman تم استرجاعه بنجاح.
de_de: Preisgestaltung Rule Salesman erfolgreich abgerufen.
es_es: Precios Rule Salesman recuperado con éxito.
fr_fr: Tarification Rule Salesman récupéré(e) avec succès.
it_it: Prezzi Rule Salesman recuperato/a con successo.
tr_tr: Pricing Rule Salesman başarıyla getirildi.

# PricingRuleSalesmanService.SalesmanUpdated
source: Pricing Rule Salesman updated successfully.
ar_sa: تسعير Rule Salesman تم تحديثه بنجاح.
de_de: Preisgestaltung Rule Salesman erfolgreich aktualisiert.
es_es: Precios Rule Salesman actualizado con éxito.
fr_fr: Tarification Rule Salesman mis(e) à jour avec succès.
it_it: Prezzi Rule Salesman aggiornato/a con successo.
tr_tr: Pricing Rule Salesman başarıyla güncellendi.

# PricingRuleSalesmanService.SalesmenRetrieved
source: Pricing Rule Salesman retrieved successfully.
ar_sa: تسعير Rule Salesman تم استرجاعه بنجاح.
de_de: Preisgestaltung Rule Salesman erfolgreich abgerufen.
es_es: Precios Rule Salesman recuperado con éxito.
fr_fr: Tarification Rule Salesman récupéré(e) avec succès.
it_it: Prezzi Rule Salesman recuperato/a con successo.
tr_tr: Pricing Rule Salesman başarıyla getirildi.

# PricingRuleSalesmanService.UpdateSalesmanExceptionMessage
source: An error occurred while updating the Pricing Rule Salesman: {0}
ar_sa: حدث خطأ أثناء تحديث the تسعير Rule Salesman: {0}
de_de: Fehler beim Aktualisieren von the Preisgestaltung Rule Salesman: {0}
es_es: Ocurrió un error al actualizar the Precios Rule Salesman: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Tarification Rule Salesman: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Prezzi Rule Salesman: {0}
tr_tr: Pricing Rule Salesman güncellenirken bir hata oluştu: {0}

# QuotationExchangeRateService.CreateRateExceptionMessage
source: An error occurred while creating the Quotation Exchange Rate: {0}
ar_sa: حدث خطأ أثناء إنشاء the عرض سعر Exchange Rate: {0}
de_de: Fehler beim Erstellen von the Angebot Exchange Rate: {0}
es_es: Ocurrió un error al crear the Cotización Exchange Rate: {0}
fr_fr: Une erreur est survenue lors de la création de the Devis Exchange Rate: {0}
it_it: Si è verificato un errore durante la creazione di the Preventivo Exchange Rate: {0}
tr_tr: Quotation Exchange Rate oluşturulurken bir hata oluştu: {0}

# QuotationExchangeRateService.DeleteRateExceptionMessage
source: An error occurred while deleting the Quotation Exchange Rate: {0}
ar_sa: حدث خطأ أثناء حذف the عرض سعر Exchange Rate: {0}
de_de: Fehler beim Löschen von the Angebot Exchange Rate: {0}
es_es: Ocurrió un error al eliminar the Cotización Exchange Rate: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Devis Exchange Rate: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Preventivo Exchange Rate: {0}
tr_tr: Quotation Exchange Rate silinirken bir hata oluştu: {0}

# QuotationExchangeRateService.GetAllRatesExceptionMessage
source: An error occurred while retrieving Quotation Exchange Rates: {0}
ar_sa: حدث خطأ أثناء استرجاع عرض سعر Exchange Rates: {0}
de_de: Fehler beim Abrufen von Angebot Exchange Rates: {0}
es_es: Ocurrió un error al recuperar Cotización Exchange Rates: {0}
fr_fr: Une erreur est survenue lors de la récupération de Devis Exchange Rates: {0}
it_it: Si è verificato un errore durante il recupero di Preventivo Exchange Rates: {0}
tr_tr: Quotation Exchange Rateler getirilirken bir hata oluştu: {0}

# QuotationExchangeRateService.GetRateByIdExceptionMessage
source: An error occurred while retrieving the Quotation Exchange Rate: {0}
ar_sa: حدث خطأ أثناء استرجاع the عرض سعر Exchange Rate: {0}
de_de: Fehler beim Abrufen von the Angebot Exchange Rate: {0}
es_es: Ocurrió un error al recuperar the Cotización Exchange Rate: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Devis Exchange Rate: {0}
it_it: Si è verificato un errore durante il recupero di the Preventivo Exchange Rate: {0}
tr_tr: Quotation Exchange Rate getirilirken bir hata oluştu: {0}

# QuotationExchangeRateService.GetRatesByQuotationIdExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# QuotationExchangeRateService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# QuotationExchangeRateService.RateCreated
source: Quotation Exchange Rate created successfully.
ar_sa: عرض سعر Exchange Rate تم إنشاؤه بنجاح.
de_de: Angebot Exchange Rate erfolgreich erstellt.
es_es: Cotización Exchange Rate creado con éxito.
fr_fr: Devis Exchange Rate créé(e) avec succès.
it_it: Preventivo Exchange Rate creato/a con successo.
tr_tr: Quotation Exchange Rate başarıyla oluşturuldu.

# QuotationExchangeRateService.RateDeleted
source: Quotation Exchange Rate deleted successfully.
ar_sa: عرض سعر Exchange Rate تم حذفه بنجاح.
de_de: Angebot Exchange Rate erfolgreich gelöscht.
es_es: Cotización Exchange Rate eliminado con éxito.
fr_fr: Devis Exchange Rate supprimé(e) avec succès.
it_it: Preventivo Exchange Rate eliminato/a con successo.
tr_tr: Quotation Exchange Rate başarıyla silindi.

# QuotationExchangeRateService.RateNotFound
source: Quotation Exchange Rate not found.
ar_sa: عرض سعر Exchange Rate غير موجود.
de_de: Angebot Exchange Rate nicht gefunden.
es_es: Cotización Exchange Rate no encontrado.
fr_fr: Devis Exchange Rate non trouvé(e).
it_it: Preventivo Exchange Rate non trovato/a.
tr_tr: Quotation Exchange Rate bulunamadı.

# QuotationExchangeRateService.RateRetrieved
source: Quotation Exchange Rate retrieved successfully.
ar_sa: عرض سعر Exchange Rate تم استرجاعه بنجاح.
de_de: Angebot Exchange Rate erfolgreich abgerufen.
es_es: Cotización Exchange Rate recuperado con éxito.
fr_fr: Devis Exchange Rate récupéré(e) avec succès.
it_it: Preventivo Exchange Rate recuperato/a con successo.
tr_tr: Quotation Exchange Rate başarıyla getirildi.

# QuotationExchangeRateService.RateUpdated
source: Quotation Exchange Rate updated successfully.
ar_sa: عرض سعر Exchange Rate تم تحديثه بنجاح.
de_de: Angebot Exchange Rate erfolgreich aktualisiert.
es_es: Cotización Exchange Rate actualizado con éxito.
fr_fr: Devis Exchange Rate mis(e) à jour avec succès.
it_it: Preventivo Exchange Rate aggiornato/a con successo.
tr_tr: Quotation Exchange Rate başarıyla güncellendi.

# QuotationExchangeRateService.RatesRetrieved
source: Quotation Exchange Rates retrieved successfully.
ar_sa: عرض سعر Exchange Rates تم استرجاعه بنجاح.
de_de: Angebot Exchange Rates erfolgreich abgerufen.
es_es: Cotización Exchange Rates recuperado con éxito.
fr_fr: Devis Exchange Rates récupéré(e) avec succès.
it_it: Preventivo Exchange Rates recuperato/a con successo.
tr_tr: Quotation Exchange Rateler başarıyla getirildi.

# QuotationExchangeRateService.UpdateRateExceptionMessage
source: An error occurred while updating the Quotation Exchange Rate: {0}
ar_sa: حدث خطأ أثناء تحديث the عرض سعر Exchange Rate: {0}
de_de: Fehler beim Aktualisieren von the Angebot Exchange Rate: {0}
es_es: Ocurrió un error al actualizar the Cotización Exchange Rate: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Devis Exchange Rate: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Preventivo Exchange Rate: {0}
tr_tr: Quotation Exchange Rate güncellenirken bir hata oluştu: {0}

# StockDetailService.CreateStockDetailExceptionMessage
source: An error occurred while creating the Stock Detail: {0}
ar_sa: حدث خطأ أثناء إنشاء the مخزون Detail: {0}
de_de: Fehler beim Erstellen von the Lagerbestand Detail: {0}
es_es: Ocurrió un error al crear the Stock Detail: {0}
fr_fr: Une erreur est survenue lors de la création de the Stock Detail: {0}
it_it: Si è verificato un errore durante la creazione di the Scorte Detail: {0}
tr_tr: Stock Detail oluşturulurken bir hata oluştu: {0}

# StockDetailService.DeleteStockDetailExceptionMessage
source: An error occurred while deleting the Stock Detail: {0}
ar_sa: حدث خطأ أثناء حذف the مخزون Detail: {0}
de_de: Fehler beim Löschen von the Lagerbestand Detail: {0}
es_es: Ocurrió un error al eliminar the Stock Detail: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Stock Detail: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Scorte Detail: {0}
tr_tr: Stock Detail silinirken bir hata oluştu: {0}

# StockDetailService.GetAllStockDetailsExceptionMessage
source: An error occurred while retrieving Stock Details: {0}
ar_sa: حدث خطأ أثناء استرجاع مخزون Details: {0}
de_de: Fehler beim Abrufen von Lagerbestand Details: {0}
es_es: Ocurrió un error al recuperar Stock Details: {0}
fr_fr: Une erreur est survenue lors de la récupération de Stock Details: {0}
it_it: Si è verificato un errore durante il recupero di Scorte Details: {0}
tr_tr: Stock Detailler getirilirken bir hata oluştu: {0}

# StockDetailService.GetStockDetailByIdExceptionMessage
source: An error occurred while retrieving the Stock Detail: {0}
ar_sa: حدث خطأ أثناء استرجاع the مخزون Detail: {0}
de_de: Fehler beim Abrufen von the Lagerbestand Detail: {0}
es_es: Ocurrió un error al recuperar the Stock Detail: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Stock Detail: {0}
it_it: Si è verificato un errore durante il recupero di the Scorte Detail: {0}
tr_tr: Stock Detail getirilirken bir hata oluştu: {0}

# StockDetailService.GetStockDetailByStockIdExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# StockDetailService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# StockDetailService.StockDetailAlreadyExists
source: Stock Detail already exists.
tr_tr: Stock Detail zaten mevcut.

# StockDetailService.StockDetailCreated
source: Stock Detail created successfully.
ar_sa: مخزون Detail تم إنشاؤه بنجاح.
de_de: Lagerbestand Detail erfolgreich erstellt.
es_es: Stock Detail creado con éxito.
fr_fr: Stock Detail créé(e) avec succès.
it_it: Scorte Detail creato/a con successo.
tr_tr: Stock Detail başarıyla oluşturuldu.

# StockDetailService.StockDetailDeleted
source: Stock Detail deleted successfully.
ar_sa: مخزون Detail تم حذفه بنجاح.
de_de: Lagerbestand Detail erfolgreich gelöscht.
es_es: Stock Detail eliminado con éxito.
fr_fr: Stock Detail supprimé(e) avec succès.
it_it: Scorte Detail eliminato/a con successo.
tr_tr: Stock Detail başarıyla silindi.

# StockDetailService.StockDetailNotFound
source: Stock Detail not found.
ar_sa: مخزون Detail غير موجود.
de_de: Lagerbestand Detail nicht gefunden.
es_es: Stock Detail no encontrado.
fr_fr: Stock Detail non trouvé(e).
it_it: Scorte Detail non trovato/a.
tr_tr: Stock Detail bulunamadı.

# StockDetailService.StockDetailRetrieved
source: Stock Detail retrieved successfully.
ar_sa: مخزون Detail تم استرجاعه بنجاح.
de_de: Lagerbestand Detail erfolgreich abgerufen.
es_es: Stock Detail recuperado con éxito.
fr_fr: Stock Detail récupéré(e) avec succès.
it_it: Scorte Detail recuperato/a con successo.
tr_tr: Stock Detail başarıyla getirildi.

# StockDetailService.StockDetailUpdated
source: Stock Detail updated successfully.
ar_sa: مخزون Detail تم تحديثه بنجاح.
de_de: Lagerbestand Detail erfolgreich aktualisiert.
es_es: Stock Detail actualizado con éxito.
fr_fr: Stock Detail mis(e) à jour avec succès.
it_it: Scorte Detail aggiornato/a con successo.
tr_tr: Stock Detail başarıyla güncellendi.

# StockDetailService.StockDetailsRetrieved
source: Stock Details retrieved successfully.
ar_sa: مخزون Details تم استرجاعه بنجاح.
de_de: Lagerbestand Details erfolgreich abgerufen.
es_es: Stock Details recuperado con éxito.
fr_fr: Stock Details récupéré(e) avec succès.
it_it: Scorte Details recuperato/a con successo.
tr_tr: Stock Detailler başarıyla getirildi.

# StockDetailService.StockNotFound
source: Stock Detail not found.
ar_sa: مخزون Detail غير موجود.
de_de: Lagerbestand Detail nicht gefunden.
es_es: Stock Detail no encontrado.
fr_fr: Stock Detail non trouvé(e).
it_it: Scorte Detail non trovato/a.
tr_tr: Stock Detail bulunamadı.

# StockDetailService.UpdateStockDetailExceptionMessage
source: An error occurred while updating the Stock Detail: {0}
ar_sa: حدث خطأ أثناء تحديث the مخزون Detail: {0}
de_de: Fehler beim Aktualisieren von the Lagerbestand Detail: {0}
es_es: Ocurrió un error al actualizar the Stock Detail: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Stock Detail: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Scorte Detail: {0}
tr_tr: Stock Detail güncellenirken bir hata oluştu: {0}

source: Quotation not found.
ar_sa: عرض سعر غير موجود.
de_de: Angebot nicht gefunden.
es_es: Cotización no encontrado.
fr_fr: Devis non trouvé(e).
it_it: Preventivo non trovato/a.
tr_tr: Teklif bulunamadı.

source: User discount limit retrieved.
tr_tr: Kullanıcı indirim limiti getirildi.

source: Operation successful.
ar_sa: العملية ناجحة.
de_de: Operation erfolgreich.
es_es: Operación exitosa.
fr_fr: Opération réussie.
it_it: Operazione riuscita.
tr_tr: İşlem başarılı.

source: Validation error.
tr_tr: Doğrulama hatası.

# PasswordResetEmailSubject
source: Password Reset.
tr_tr: Şifre Sıfırlama.

# DemandService.DemandsRetrieved
source: Demands retrieved successfully.
ar_sa: عروض أسعار تم استرجاعه بنجاح.
de_de: Bedarfe erfolgreich abgerufen.
es_es: Cotizaciones recuperado con éxito.
it_it: Preventivi recuperato/a con successo.
tr_tr: Talepler başarıyla getirildi.

# DemandService.DemandNotFound
source: Demand not found.
ar_sa: طلب غير موجود.
de_de: Bedarf nicht gefunden.
es_es: Demanda no encontrado.
it_it: Richiesta non trovato/a.
tr_tr: Talep bulunamadı.

# DemandService.DemandRetrieved
source: Demand retrieved successfully.
ar_sa: طلب تم استرجاعه بنجاح.
de_de: Bedarf erfolgreich abgerufen.
es_es: Demanda recuperado con éxito.
it_it: Richiesta recuperato/a con successo.
tr_tr: Talep başarıyla getirildi.

# DemandService.DemandCreated
source: Demand created successfully.
ar_sa: طلب تم إنشاؤه بنجاح.
de_de: Bedarf erfolgreich erstellt.
es_es: Demanda creado con éxito.
it_it: Richiesta creato/a con successo.
tr_tr: Talep başarıyla oluşturuldu.

# DemandService.DemandUpdated
source: Demand updated successfully.
ar_sa: طلب تم تحديثه بنجاح.
de_de: Bedarf erfolgreich aktualisiert.
es_es: Demanda actualizado con éxito.
it_it: Richiesta aggiornato/a con successo.
tr_tr: Talep başarıyla güncellendi.

# DemandService.DemandDeleted
source: Demand deleted successfully.
ar_sa: طلب تم حذفه بنجاح.
de_de: Bedarf erfolgreich gelöscht.
es_es: Demanda eliminado con éxito.
it_it: Richiesta eliminato/a con successo.
tr_tr: Talep başarıyla silindi.

# DemandService.DemandsByPotentialCustomerRetrieved
source: Demands by potential customer retrieved successfully.
ar_sa: عروض أسعار by potential customer تم استرجاعه بنجاح.
de_de: Bedarfe by potential customer erfolgreich abgerufen.
es_es: Cotizaciones by potential customer recuperado con éxito.
it_it: Preventivi by potential customer recuperato/a con successo.
tr_tr: Potansiyel müşteri teklifleri başarıyla getirildi.

# DemandService.DemandsByRepresentativeRetrieved
source: Demands by representative retrieved successfully.
ar_sa: عروض أسعار by representative تم استرجاعه بنجاح.
de_de: Bedarfe by representative erfolgreich abgerufen.
es_es: Cotizaciones by representative recuperado con éxito.
it_it: Preventivi by representative recuperato/a con successo.
tr_tr: Temsilci teklifleri başarıyla getirildi.

# DemandService.DemandsByStatusRetrieved
source: Demands by status retrieved successfully.
ar_sa: عروض أسعار by status تم استرجاعه بنجاح.
de_de: Bedarfe by status erfolgreich abgerufen.
es_es: Cotizaciones by status recuperado con éxito.
it_it: Preventivi by status recuperato/a con successo.
tr_tr: Durum teklifleri başarıyla getirildi.

# DemandService.PendingApprovalEmailSubject
source: You Have a Record Pending Approval
tr_tr: Onay Bekleyen Kaydınız Bulunmaktadır

# DemandService.ApprovalActionNotFound
source: Demand not found.
ar_sa: طلب غير موجود.
de_de: Bedarf nicht gefunden.
es_es: Demanda no encontrado.
it_it: Richiesta non trovato/a.
tr_tr: Demand bulunamadı.

# DemandService.ApprovalFlowAlreadyExists
source: Demand already exists.
tr_tr: Demand zaten mevcut.

# DemandService.ApprovalFlowNotFound
source: Demand not found.
ar_sa: طلب غير موجود.
de_de: Bedarf nicht gefunden.
es_es: Demanda no encontrado.
it_it: Richiesta non trovato/a.
tr_tr: Demand bulunamadı.

# DemandService.ApprovalFlowStepsNotFound
source: Demand not found.
ar_sa: طلب غير موجود.
de_de: Bedarf nicht gefunden.
es_es: Demanda no encontrado.
it_it: Richiesta non trovato/a.
tr_tr: Demand bulunamadı.

# DemandService.ApprovalRequestNotFound
source: Demand not found.
ar_sa: طلب غير موجود.
de_de: Bedarf nicht gefunden.
es_es: Demanda no encontrado.
it_it: Richiesta non trovato/a.
tr_tr: Demand bulunamadı.

# DemandService.ApprovalRoleNotFound
source: Demand not found.
ar_sa: طلب غير موجود.
de_de: Bedarf nicht gefunden.
es_es: Demanda no encontrado.
it_it: Richiesta non trovato/a.
tr_tr: Demand bulunamadı.

# DemandService.ApprovalUsersNotFound
source: Demand not found.
ar_sa: طلب غير موجود.
de_de: Bedarf nicht gefunden.
es_es: Demanda no encontrado.
it_it: Richiesta non trovato/a.
tr_tr: Demand bulunamadı.

# DemandService.ApproveExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# DemandService.CreateDemandBulkExceptionMessage
source: An error occurred while creating the Demand: {0}
ar_sa: حدث خطأ أثناء إنشاء the طلب: {0}
de_de: Fehler beim Erstellen von the Bedarf: {0}
es_es: Ocurrió un error al crear the Demanda: {0}
it_it: Si è verificato un errore durante la creazione di the Richiesta: {0}
tr_tr: Demand oluşturulurken bir hata oluştu: {0}

# DemandService.CreateDemandExceptionMessage
source: An error occurred while creating the Demand: {0}
ar_sa: حدث خطأ أثناء إنشاء the طلب: {0}
de_de: Fehler beim Erstellen von the Bedarf: {0}
es_es: Ocurrió un error al crear the Demanda: {0}
it_it: Si è verificato un errore durante la creazione di the Richiesta: {0}
tr_tr: Demand oluşturulurken bir hata oluştu: {0}

# DemandService.CreateRevisionOfDemandExceptionMessage
source: An error occurred while creating the Demand: {0}
ar_sa: حدث خطأ أثناء إنشاء the طلب: {0}
de_de: Fehler beim Erstellen von the Bedarf: {0}
es_es: Ocurrió un error al crear the Demanda: {0}
it_it: Si è verificato un errore durante la creazione di the Richiesta: {0}
tr_tr: Demand oluşturulurken bir hata oluştu: {0}

# DemandService.DeleteDemandExceptionMessage
source: An error occurred while deleting the Demand: {0}
ar_sa: حدث خطأ أثناء حذف the طلب: {0}
de_de: Fehler beim Löschen von the Bedarf: {0}
es_es: Ocurrió un error al eliminar the Demanda: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Richiesta: {0}
tr_tr: Demand silinirken bir hata oluştu: {0}

# DemandService.GetAllDemandsExceptionMessage
source: An error occurred while retrieving Demands: {0}
ar_sa: حدث خطأ أثناء استرجاع عروض أسعار: {0}
de_de: Fehler beim Abrufen von Bedarfe: {0}
es_es: Ocurrió un error al recuperar Cotizaciones: {0}
it_it: Si è verificato un errore durante il recupero di Preventivi: {0}
tr_tr: Demandler getirilirken bir hata oluştu: {0}

# DemandService.GetPriceOfProductExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# DemandService.GetPriceRuleOfDemandExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# DemandService.GetDemandByIdExceptionMessage
source: An error occurred while retrieving the Demand: {0}
ar_sa: حدث خطأ أثناء استرجاع the طلب: {0}
de_de: Fehler beim Abrufen von the Bedarf: {0}
es_es: Ocurrió un error al recuperar the Demanda: {0}
it_it: Si è verificato un errore durante il recupero di the Richiesta: {0}
tr_tr: Demand getirilirken bir hata oluştu: {0}

# DemandService.GetDemandsByPotentialCustomerExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# DemandService.GetDemandsByRepresentativeExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# DemandService.GetDemandsByStatusExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# DemandService.GetWaitingApprovalsExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# DemandService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# DemandService.PriceOfProductRetrieved
source: Demand retrieved successfully.
ar_sa: طلب تم استرجاعه بنجاح.
de_de: Bedarf erfolgreich abgerufen.
es_es: Demanda recuperado con éxito.
it_it: Richiesta recuperato/a con successo.
tr_tr: Demand başarıyla getirildi.

# DemandService.DemandExistsExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# DemandService.DemandRevisionCreated
source: Demand created successfully.
ar_sa: طلب تم إنشاؤه بنجاح.
de_de: Bedarf erfolgreich erstellt.
es_es: Demanda creado con éxito.
it_it: Richiesta creato/a con successo.
tr_tr: Demand başarıyla oluşturuldu.

# DemandService.RejectExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# DemandService.StartApprovalFlowExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# DemandService.UpdateDemandExceptionMessage
source: An error occurred while updating the Demand: {0}
ar_sa: حدث خطأ أثناء تحديث the طلب: {0}
de_de: Fehler beim Aktualisieren von the Bedarf: {0}
es_es: Ocurrió un error al actualizar the Demanda: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Richiesta: {0}
tr_tr: Demand güncellenirken bir hata oluştu: {0}

# DemandService.UserNotFound
source: Demand not found.
ar_sa: طلب غير موجود.
de_de: Bedarf nicht gefunden.
es_es: Demanda no encontrado.
it_it: Richiesta non trovato/a.
tr_tr: Demand bulunamadı.

# DemandService.WaitingApprovalsRetrieved
source: Demands retrieved successfully.
ar_sa: عروض أسعار تم استرجاعه بنجاح.
de_de: Bedarfe erfolgreich abgerufen.
es_es: Cotizaciones recuperado con éxito.
it_it: Preventivi recuperato/a con successo.
tr_tr: Demandler başarıyla getirildi.

# OrderService.OrdersRetrieved
source: Orders retrieved successfully.
ar_sa: عروض أسعار تم استرجاعه بنجاح.
de_de: Bestellunge erfolgreich abgerufen.
es_es: Cotizaciones recuperado con éxito.
it_it: Preventivi recuperato/a con successo.
tr_tr: Siparişler başarıyla getirildi.

# OrderService.OrderNotFound
source: Order not found.
ar_sa: أمر غير موجود.
de_de: Bestellung nicht gefunden.
es_es: Pedido no encontrado.
it_it: Ordine non trovato/a.
tr_tr: Sipariş bulunamadı.

# OrderService.OrderRetrieved
source: Order retrieved successfully.
ar_sa: أمر تم استرجاعه بنجاح.
de_de: Bestellung erfolgreich abgerufen.
es_es: Pedido recuperado con éxito.
it_it: Ordine recuperato/a con successo.
tr_tr: Sipariş başarıyla getirildi.
