Repository: cannasif-ship-it/verii_crm_api
Catalog: Resources/Messages.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, it_it, tr_tr

# ActivityTypeService.CreateActivityTypeExceptionMessage
source: An error occurred while creating the Activity Type: {0}
ar_sa: حدث خطأ أثناء إنشاء the نشاط نوع: {0}
de_de: Fehler beim Erstellen von the Aktivität Typ: {0}
es_es: Ocurrió un error al crear the Actividad Tipo: {0}
fr_fr: Une erreur est survenue lors de la création de the Activité Type: {0}
it_it: Si è verificato un errore durante la creazione di the Attività Tipo: {0}
tr_tr: Activity Type oluşturulurken bir hata oluştu: {0}

# ActivityTypeService.DeleteActivityTypeExceptionMessage
source: An error occurred while deleting the Activity Type: {0}
ar_sa: حدث خطأ أثناء حذف the نشاط نوع: {0}
de_de: Fehler beim Löschen von the Aktivität Typ: {0}
es_es: Ocurrió un error al eliminar the Actividad Tipo: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Activité Type: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Attività Tipo: {0}
tr_tr: Activity Type silinirken bir hata oluştu: {0}

# ActivityTypeService.GetActivityTypeByIdExceptionMessage
source: An error occurred while retrieving the Activity Type: {0}
ar_sa: حدث خطأ أثناء استرجاع the نشاط نوع: {0}
de_de: Fehler beim Abrufen von the Aktivität Typ: {0}
es_es: Ocurrió un error al recuperar the Actividad Tipo: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Activité Type: {0}
it_it: Si è verificato un errore durante il recupero di the Attività Tipo: {0}
tr_tr: Activity Type getirilirken bir hata oluştu: {0}

# ActivityTypeService.GetAllActivityTypesExceptionMessage
source: An error occurred while retrieving Activity Types: {0}
ar_sa: حدث خطأ أثناء استرجاع نشاط Types: {0}
de_de: Fehler beim Abrufen von Aktivität Types: {0}
es_es: Ocurrió un error al recuperar Actividad Types: {0}
fr_fr: Une erreur est survenue lors de la récupération de Activité Types: {0}
it_it: Si è verificato un errore durante il recupero di Attività Types: {0}
tr_tr: Activity Typeler getirilirken bir hata oluştu: {0}

# ActivityTypeService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# ActivityTypeService.UpdateActivityTypeExceptionMessage
source: An error occurred while updating the Activity Type: {0}
ar_sa: حدث خطأ أثناء تحديث the نشاط نوع: {0}
de_de: Fehler beim Aktualisieren von the Aktivität Typ: {0}
es_es: Ocurrió un error al actualizar the Actividad Tipo: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Activité Type: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Attività Tipo: {0}
tr_tr: Activity Type güncellenirken bir hata oluştu: {0}

# DocumentSerialTypeService.CreateTypeExceptionMessage
source: An error occurred while creating the Document Serial Type: {0}
ar_sa: حدث خطأ أثناء إنشاء the مستند تسلسل نوع: {0}
de_de: Fehler beim Erstellen von the Dokument Serie Typ: {0}
es_es: Ocurrió un error al crear the Documento Serie Tipo: {0}
fr_fr: Une erreur est survenue lors de la création de the Document Série Type: {0}
it_it: Si è verificato un errore durante la creazione di the Documento Serie Tipo: {0}
tr_tr: Document Serial Type oluşturulurken bir hata oluştu: {0}

# DocumentSerialTypeService.DeleteTypeExceptionMessage
source: An error occurred while deleting the Document Serial Type: {0}
ar_sa: حدث خطأ أثناء حذف the مستند تسلسل نوع: {0}
de_de: Fehler beim Löschen von the Dokument Serie Typ: {0}
es_es: Ocurrió un error al eliminar the Documento Serie Tipo: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Document Série Type: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Documento Serie Tipo: {0}
tr_tr: Document Serial Type silinirken bir hata oluştu: {0}

# DocumentSerialTypeService.DocumentSerialTypeNotFound
source: Document Serial Type not found.
ar_sa: نوع تسلسل المستند غير موجود.
de_de: Dokumentserientyp nicht gefunden.
es_es: Tipo de serie de documento no encontrado.
fr_fr: Type de série de document non trouvé(e).
it_it: Tipo di serie documento non trovato/a.
tr_tr: Document Serial Type bulunamadı.

# DocumentSerialTypeService.DocumentSerialTypesRetrieved
source: Document Serial Types retrieved successfully.
ar_sa: مستند تسلسل Types تم استرجاعه بنجاح.
de_de: Dokument Serie Types erfolgreich abgerufen.
es_es: Documento Serie Types recuperado con éxito.
fr_fr: Document Série Types récupéré(e) avec succès.
it_it: Documento Serie Types recuperato/a con successo.
tr_tr: Document Serial Typeler başarıyla getirildi.

# DocumentSerialTypeService.GenerateDocumentSerialExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# DocumentSerialTypeService.GetAllTypesExceptionMessage
source: An error occurred while retrieving Document Serial Types: {0}
ar_sa: حدث خطأ أثناء استرجاع مستند تسلسل Types: {0}
de_de: Fehler beim Abrufen von Dokument Serie Types: {0}
es_es: Ocurrió un error al recuperar Documento Serie Types: {0}
fr_fr: Une erreur est survenue lors de la récupération de Document Série Types: {0}
it_it: Si è verificato un errore durante il recupero di Documento Serie Types: {0}
tr_tr: Document Serial Typeler getirilirken bir hata oluştu: {0}

# DocumentSerialTypeService.GetTypeByIdExceptionMessage
source: An error occurred while retrieving the Document Serial Type: {0}
ar_sa: حدث خطأ أثناء استرجاع the مستند تسلسل نوع: {0}
de_de: Fehler beim Abrufen von the Dokument Serie Typ: {0}
es_es: Ocurrió un error al recuperar the Documento Serie Tipo: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Document Série Type: {0}
it_it: Si è verificato un errore durante il recupero di the Documento Serie Tipo: {0}
tr_tr: Document Serial Type getirilirken bir hata oluştu: {0}

# DocumentSerialTypeService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# DocumentSerialTypeService.TypeCreated
source: Document Serial Type created successfully.
ar_sa: نوع تسلسل المستند تم إنشاؤه بنجاح.
de_de: Dokumentserientyp erfolgreich erstellt.
es_es: Tipo de serie de documento creado con éxito.
fr_fr: Type de série de document créé(e) avec succès.
it_it: Tipo di serie documento creato/a con successo.
tr_tr: Document Serial Type başarıyla oluşturuldu.

# DocumentSerialTypeService.TypeDeleted
source: Document Serial Type deleted successfully.
ar_sa: نوع تسلسل المستند تم حذفه بنجاح.
de_de: Dokumentserientyp erfolgreich gelöscht.
es_es: Tipo de serie de documento eliminado con éxito.
fr_fr: Type de série de document supprimé(e) avec succès.
it_it: Tipo di serie documento eliminato/a con successo.
tr_tr: Document Serial Type başarıyla silindi.

# DocumentSerialTypeService.TypeNotFound
source: Document Serial Type not found.
ar_sa: نوع تسلسل المستند غير موجود.
de_de: Dokumentserientyp nicht gefunden.
es_es: Tipo de serie de documento no encontrado.
fr_fr: Type de série de document non trouvé(e).
it_it: Tipo di serie documento non trovato/a.
tr_tr: Document Serial Type bulunamadı.

# DocumentSerialTypeService.TypeRetrieved
source: Document Serial Type retrieved successfully.
ar_sa: نوع تسلسل المستند تم استرجاعه بنجاح.
de_de: Dokumentserientyp erfolgreich abgerufen.
es_es: Tipo de serie de documento recuperado con éxito.
fr_fr: Type de série de document récupéré(e) avec succès.
it_it: Tipo di serie documento recuperato/a con successo.
tr_tr: Document Serial Type başarıyla getirildi.

# DocumentSerialTypeService.TypeUpdated
source: Document Serial Type updated successfully.
ar_sa: نوع تسلسل المستند تم تحديثه بنجاح.
de_de: Dokumentserientyp erfolgreich aktualisiert.
es_es: Tipo de serie de documento actualizado con éxito.
fr_fr: Type de série de document mis(e) à jour avec succès.
it_it: Tipo di serie documento aggiornato/a con successo.
tr_tr: Document Serial Type başarıyla güncellendi.

# DocumentSerialTypeService.TypesRetrieved
source: Document Serial Types retrieved successfully.
ar_sa: مستند تسلسل Types تم استرجاعه بنجاح.
de_de: Dokument Serie Types erfolgreich abgerufen.
es_es: Documento Serie Types recuperado con éxito.
fr_fr: Document Série Types récupéré(e) avec succès.
it_it: Documento Serie Types recuperato/a con successo.
tr_tr: Document Serial Typeler başarıyla getirildi.

# DocumentSerialTypeService.UpdateTypeExceptionMessage
source: An error occurred while updating the Document Serial Type: {0}
ar_sa: حدث خطأ أثناء تحديث the مستند تسلسل نوع: {0}
de_de: Fehler beim Aktualisieren von the Dokument Serie Typ: {0}
es_es: Ocurrió un error al actualizar the Documento Serie Tipo: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Document Série Type: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Documento Serie Tipo: {0}
tr_tr: Document Serial Type güncellenirken bir hata oluştu: {0}

# JwtService.MissingSecretKeyExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# JwtService.TokenGenerationExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# PricingRuleHeaderService.CreateHeaderExceptionMessage
source: An error occurred while creating the Pricing Rule Header: {0}
ar_sa: حدث خطأ أثناء إنشاء the تسعير Rule Header: {0}
de_de: Fehler beim Erstellen von the Preisgestaltung Rule Header: {0}
es_es: Ocurrió un error al crear the Precios Rule Header: {0}
fr_fr: Une erreur est survenue lors de la création de the Tarification Rule Header: {0}
it_it: Si è verificato un errore durante la creazione di the Prezzi Rule Header: {0}
tr_tr: Pricing Rule Header oluşturulurken bir hata oluştu: {0}

# PricingRuleHeaderService.DeleteHeaderExceptionMessage
source: An error occurred while deleting the Pricing Rule Header: {0}
ar_sa: حدث خطأ أثناء حذف the تسعير Rule Header: {0}
de_de: Fehler beim Löschen von the Preisgestaltung Rule Header: {0}
es_es: Ocurrió un error al eliminar the Precios Rule Header: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Tarification Rule Header: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Prezzi Rule Header: {0}
tr_tr: Pricing Rule Header silinirken bir hata oluştu: {0}

# PricingRuleHeaderService.GetAllHeadersExceptionMessage
source: An error occurred while retrieving Pricing Rule Headers: {0}
ar_sa: حدث خطأ أثناء استرجاع تسعير Rule Headers: {0}
de_de: Fehler beim Abrufen von Preisgestaltung Rule Headers: {0}
es_es: Ocurrió un error al recuperar Precios Rule Headers: {0}
fr_fr: Une erreur est survenue lors de la récupération de Tarification Rule Headers: {0}
it_it: Si è verificato un errore durante il recupero di Prezzi Rule Headers: {0}
tr_tr: Pricing Rule Headerler getirilirken bir hata oluştu: {0}

# PricingRuleHeaderService.GetHeaderByIdExceptionMessage
source: An error occurred while retrieving the Pricing Rule Header: {0}
ar_sa: حدث خطأ أثناء استرجاع the تسعير Rule Header: {0}
de_de: Fehler beim Abrufen von the Preisgestaltung Rule Header: {0}
es_es: Ocurrió un error al recuperar the Precios Rule Header: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Tarification Rule Header: {0}
it_it: Si è verificato un errore durante il recupero di the Prezzi Rule Header: {0}
tr_tr: Pricing Rule Header getirilirken bir hata oluştu: {0}

# PricingRuleHeaderService.HeaderCreated
source: Pricing Rule Header created successfully.
ar_sa: تسعير Rule Header تم إنشاؤه بنجاح.
de_de: Preisgestaltung Rule Header erfolgreich erstellt.
es_es: Precios Rule Header creado con éxito.
fr_fr: Tarification Rule Header créé(e) avec succès.
it_it: Prezzi Rule Header creato/a con successo.
tr_tr: Pricing Rule Header başarıyla oluşturuldu.

# PricingRuleHeaderService.HeaderDeleted
source: Pricing Rule Header deleted successfully.
ar_sa: تسعير Rule Header تم حذفه بنجاح.
de_de: Preisgestaltung Rule Header erfolgreich gelöscht.
es_es: Precios Rule Header eliminado con éxito.
fr_fr: Tarification Rule Header supprimé(e) avec succès.
it_it: Prezzi Rule Header eliminato/a con successo.
tr_tr: Pricing Rule Header başarıyla silindi.

# PricingRuleHeaderService.HeaderNotFound
source: Pricing Rule Header not found.
ar_sa: تسعير Rule Header غير موجود.
de_de: Preisgestaltung Rule Header nicht gefunden.
es_es: Precios Rule Header no encontrado.
fr_fr: Tarification Rule Header non trouvé(e).
it_it: Prezzi Rule Header non trovato/a.
tr_tr: Pricing Rule Header bulunamadı.

# PricingRuleHeaderService.HeaderRetrieved
source: Pricing Rule Header retrieved successfully.
ar_sa: تسعير Rule Header تم استرجاعه بنجاح.
de_de: Preisgestaltung Rule Header erfolgreich abgerufen.
es_es: Precios Rule Header recuperado con éxito.
fr_fr: Tarification Rule Header récupéré(e) avec succès.
it_it: Prezzi Rule Header recuperato/a con successo.
tr_tr: Pricing Rule Header başarıyla getirildi.

# PricingRuleHeaderService.HeaderUpdated
source: Pricing Rule Header updated successfully.
ar_sa: تسعير Rule Header تم تحديثه بنجاح.
de_de: Preisgestaltung Rule Header erfolgreich aktualisiert.
es_es: Precios Rule Header actualizado con éxito.
fr_fr: Tarification Rule Header mis(e) à jour avec succès.
it_it: Prezzi Rule Header aggiornato/a con successo.
tr_tr: Pricing Rule Header başarıyla güncellendi.

# PricingRuleHeaderService.HeadersRetrieved
source: Pricing Rule Headers retrieved successfully.
ar_sa: تسعير Rule Headers تم استرجاعه بنجاح.
de_de: Preisgestaltung Rule Headers erfolgreich abgerufen.
es_es: Precios Rule Headers recuperado con éxito.
fr_fr: Tarification Rule Headers récupéré(e) avec succès.
it_it: Prezzi Rule Headers recuperato/a con successo.
tr_tr: Pricing Rule Headerler başarıyla getirildi.

# PricingRuleHeaderService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# PricingRuleHeaderService.UpdateHeaderExceptionMessage
source: An error occurred while updating the Pricing Rule Header: {0}
ar_sa: حدث خطأ أثناء تحديث the تسعير Rule Header: {0}
de_de: Fehler beim Aktualisieren von the Preisgestaltung Rule Header: {0}
es_es: Ocurrió un error al actualizar the Precios Rule Header: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Tarification Rule Header: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Prezzi Rule Header: {0}
tr_tr: Pricing Rule Header güncellenirken bir hata oluştu: {0}

# PricingRuleLineService.CreateLineExceptionMessage
source: An error occurred while creating the Pricing Rule Line: {0}
ar_sa: حدث خطأ أثناء إنشاء the تسعير Rule Line: {0}
de_de: Fehler beim Erstellen von the Preisgestaltung Rule Line: {0}
es_es: Ocurrió un error al crear the Precios Rule Line: {0}
fr_fr: Une erreur est survenue lors de la création de the Tarification Rule Line: {0}
it_it: Si è verificato un errore durante la creazione di the Prezzi Rule Line: {0}
tr_tr: Pricing Rule Line oluşturulurken bir hata oluştu: {0}

# PricingRuleLineService.DeleteLineExceptionMessage
source: An error occurred while deleting the Pricing Rule Line: {0}
ar_sa: حدث خطأ أثناء حذف the تسعير Rule Line: {0}
de_de: Fehler beim Löschen von the Preisgestaltung Rule Line: {0}
es_es: Ocurrió un error al eliminar the Precios Rule Line: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Tarification Rule Line: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Prezzi Rule Line: {0}
tr_tr: Pricing Rule Line silinirken bir hata oluştu: {0}

# PricingRuleLineService.GetAllLinesExceptionMessage
source: An error occurred while retrieving Pricing Rule Lines: {0}
ar_sa: حدث خطأ أثناء استرجاع تسعير Rule Lines: {0}
de_de: Fehler beim Abrufen von Preisgestaltung Rule Lines: {0}
es_es: Ocurrió un error al recuperar Precios Rule Lines: {0}
fr_fr: Une erreur est survenue lors de la récupération de Tarification Rule Lines: {0}
it_it: Si è verificato un errore durante il recupero di Prezzi Rule Lines: {0}
tr_tr: Pricing Rule Lineler getirilirken bir hata oluştu: {0}

# PricingRuleLineService.GetLineByIdExceptionMessage
source: An error occurred while retrieving the Pricing Rule Line: {0}
ar_sa: حدث خطأ أثناء استرجاع the تسعير Rule Line: {0}
de_de: Fehler beim Abrufen von the Preisgestaltung Rule Line: {0}
es_es: Ocurrió un error al recuperar the Precios Rule Line: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Tarification Rule Line: {0}
it_it: Si è verificato un errore durante il recupero di the Prezzi Rule Line: {0}
tr_tr: Pricing Rule Line getirilirken bir hata oluştu: {0}

# PricingRuleLineService.GetLinesByHeaderIdExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# PricingRuleLineService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# PricingRuleLineService.LineCreated
source: Pricing Rule Line created successfully.
ar_sa: تسعير Rule Line تم إنشاؤه بنجاح.
de_de: Preisgestaltung Rule Line erfolgreich erstellt.
es_es: Precios Rule Line creado con éxito.
fr_fr: Tarification Rule Line créé(e) avec succès.
it_it: Prezzi Rule Line creato/a con successo.
tr_tr: Pricing Rule Line başarıyla oluşturuldu.

# PricingRuleLineService.LineDeleted
source: Pricing Rule Line deleted successfully.
ar_sa: تسعير Rule Line تم حذفه بنجاح.
de_de: Preisgestaltung Rule Line erfolgreich gelöscht.
es_es: Precios Rule Line eliminado con éxito.
fr_fr: Tarification Rule Line supprimé(e) avec succès.
it_it: Prezzi Rule Line eliminato/a con successo.
tr_tr: Pricing Rule Line başarıyla silindi.

# PricingRuleLineService.LineNotFound
source: Pricing Rule Line not found.
ar_sa: تسعير Rule Line غير موجود.
de_de: Preisgestaltung Rule Line nicht gefunden.
es_es: Precios Rule Line no encontrado.
fr_fr: Tarification Rule Line non trouvé(e).
it_it: Prezzi Rule Line non trovato/a.
tr_tr: Pricing Rule Line bulunamadı.

# PricingRuleLineService.LineRetrieved
source: Pricing Rule Line retrieved successfully.
ar_sa: تسعير Rule Line تم استرجاعه بنجاح.
de_de: Preisgestaltung Rule Line erfolgreich abgerufen.
es_es: Precios Rule Line recuperado con éxito.
fr_fr: Tarification Rule Line récupéré(e) avec succès.
it_it: Prezzi Rule Line recuperato/a con successo.
tr_tr: Pricing Rule Line başarıyla getirildi.

# PricingRuleLineService.LineUpdated
source: Pricing Rule Line updated successfully.
ar_sa: تسعير Rule Line تم تحديثه بنجاح.
de_de: Preisgestaltung Rule Line erfolgreich aktualisiert.
es_es: Precios Rule Line actualizado con éxito.
fr_fr: Tarification Rule Line mis(e) à jour avec succès.
it_it: Prezzi Rule Line aggiornato/a con successo.
tr_tr: Pricing Rule Line başarıyla güncellendi.

# PricingRuleLineService.LinesRetrieved
source: Pricing Rule Lines retrieved successfully.
ar_sa: تسعير Rule Lines تم استرجاعه بنجاح.
de_de: Preisgestaltung Rule Lines erfolgreich abgerufen.
es_es: Precios Rule Lines recuperado con éxito.
fr_fr: Tarification Rule Lines récupéré(e) avec succès.
it_it: Prezzi Rule Lines recuperato/a con successo.
tr_tr: Pricing Rule Lineler başarıyla getirildi.

# PricingRuleLineService.UpdateLineExceptionMessage
source: An error occurred while updating the Pricing Rule Line: {0}
ar_sa: حدث خطأ أثناء تحديث the تسعير Rule Line: {0}
de_de: Fehler beim Aktualisieren von the Preisgestaltung Rule Line: {0}
es_es: Ocurrió un error al actualizar the Precios Rule Line: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Tarification Rule Line: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Prezzi Rule Line: {0}
tr_tr: Pricing Rule Line güncellenirken bir hata oluştu: {0}

# PricingRuleSalesmanService.CreateSalesmanExceptionMessage
source: An error occurred while creating the Pricing Rule Salesman: {0}
ar_sa: حدث خطأ أثناء إنشاء the تسعير Rule Salesman: {0}
de_de: Fehler beim Erstellen von the Preisgestaltung Rule Salesman: {0}
es_es: Ocurrió un error al crear the Precios Rule Salesman: {0}
fr_fr: Une erreur est survenue lors de la création de the Tarification Rule Salesman: {0}
it_it: Si è verificato un errore durante la creazione di the Prezzi Rule Salesman: {0}
tr_tr: Pricing Rule Salesman oluşturulurken bir hata oluştu: {0}

# PricingRuleSalesmanService.DeleteSalesmanExceptionMessage
source: An error occurred while deleting the Pricing Rule Salesman: {0}
ar_sa: حدث خطأ أثناء حذف the تسعير Rule Salesman: {0}
de_de: Fehler beim Löschen von the Preisgestaltung Rule Salesman: {0}
es_es: Ocurrió un error al eliminar the Precios Rule Salesman: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Tarification Rule Salesman: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Prezzi Rule Salesman: {0}
tr_tr: Pricing Rule Salesman silinirken bir hata oluştu: {0}

# PricingRuleSalesmanService.GetAllSalesmenExceptionMessage
source: An error occurred while retrieving Pricing Rule Salesmans: {0}
ar_sa: حدث خطأ أثناء استرجاع تسعير Rule Salesmans: {0}
de_de: Fehler beim Abrufen von Preisgestaltung Rule Salesmans: {0}
es_es: Ocurrió un error al recuperar Precios Rule Salesmans: {0}
fr_fr: Une erreur est survenue lors de la récupération de Tarification Rule Salesmans: {0}
it_it: Si è verificato un errore durante il recupero di Prezzi Rule Salesmans: {0}
tr_tr: Pricing Rule Salesmanler getirilirken bir hata oluştu: {0}

# PricingRuleSalesmanService.GetSalesmanByIdExceptionMessage
source: An error occurred while retrieving the Pricing Rule Salesman: {0}
ar_sa: حدث خطأ أثناء استرجاع the تسعير Rule Salesman: {0}
de_de: Fehler beim Abrufen von the Preisgestaltung Rule Salesman: {0}
es_es: Ocurrió un error al recuperar the Precios Rule Salesman: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Tarification Rule Salesman: {0}
it_it: Si è verificato un errore durante il recupero di the Prezzi Rule Salesman: {0}
tr_tr: Pricing Rule Salesman getirilirken bir hata oluştu: {0}

# PricingRuleSalesmanService.GetSalesmenByHeaderIdExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# PricingRuleSalesmanService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# PricingRuleSalesmanService.SalesmanCreated
source: Pricing Rule Salesman created successfully.
ar_sa: تسعير Rule Salesman تم إنشاؤه بنجاح.
de_de: Preisgestaltung Rule Salesman erfolgreich erstellt.
es_es: Precios Rule Salesman creado con éxito.
fr_fr: Tarification Rule Salesman créé(e) avec succès.
it_it: Prezzi Rule Salesman creato/a con successo.
tr_tr: Pricing Rule Salesman başarıyla oluşturuldu.

# PricingRuleSalesmanService.SalesmanDeleted
source: Pricing Rule Salesman deleted successfully.
ar_sa: تسعير Rule Salesman تم حذفه بنجاح.
de_de: Preisgestaltung Rule Salesman erfolgreich gelöscht.
es_es: Precios Rule Salesman eliminado con éxito.
fr_fr: Tarification Rule Salesman supprimé(e) avec succès.
it_it: Prezzi Rule Salesman eliminato/a con successo.
tr_tr: Pricing Rule Salesman başarıyla silindi.
