Repository: cannasif-ship-it/verii_crm_api
Catalog: Resources/Messages.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, it_it, tr_tr

# StockImageService.ImageAdded
source: Image added successfully.
tr_tr: Görsel başarıyla eklendi.

# StockImageService.ImageDeleted
source: Image deleted successfully.
ar_sa: صورة تم حذفه بنجاح.
de_de: Bild erfolgreich gelöscht.
es_es: Imagen eliminado con éxito.
fr_fr: Image supprimé(e) avec succès.
it_it: Immagine eliminato/a con successo.
tr_tr: Görsel başarıyla silindi.

# StockImageService.PrimaryImageSet
source: Primary image set successfully.
tr_tr: Ana görsel başarıyla ayarlandı.

# StockImageService.ImageNotFound
source: Image not found.
ar_sa: صورة غير موجود.
de_de: Bild nicht gefunden.
es_es: Imagen no encontrado.
fr_fr: Image non trouvé(e).
it_it: Immagine non trovato/a.
tr_tr: Görsel bulunamadı.

# StockImageService.ImagesRetrieved
source: Images retrieved successfully.
ar_sa: صور تم استرجاعه بنجاح.
de_de: Bilder erfolgreich abgerufen.
es_es: Imágenes recuperado con éxito.
fr_fr: Images récupéré(e) avec succès.
it_it: Immagini recuperato/a con successo.
tr_tr: Görseller başarıyla getirildi.

# StockImageService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# StockImageService.AddImagesExceptionMessage
source: An error occurred while adding images: {0}
tr_tr: Görseller eklenirken bir hata oluştu: {0}

# StockImageService.GetByStockIdExceptionMessage
source: An error occurred while retrieving images: {0}
ar_sa: حدث خطأ أثناء استرجاع images: {0}
de_de: Fehler beim Abrufen von images: {0}
es_es: Ocurrió un error al recuperar images: {0}
fr_fr: Une erreur est survenue lors de la récupération de images: {0}
it_it: Si è verificato un errore durante il recupero di images: {0}
tr_tr: Görseller getirilirken bir hata oluştu: {0}

# StockImageService.DeleteExceptionMessage
source: An error occurred while deleting image: {0}
ar_sa: حدث خطأ أثناء حذف image: {0}
de_de: Fehler beim Löschen von image: {0}
es_es: Ocurrió un error al eliminar image: {0}
fr_fr: Une erreur est survenue lors de la suppression de image: {0}
it_it: Si è verificato un errore durante l'eliminazione di image: {0}
tr_tr: Görsel silinirken bir hata oluştu: {0}

# StockImageService.SetPrimaryExceptionMessage
source: An error occurred while setting primary image: {0}
tr_tr: Ana görsel ayarlanırken bir hata oluştu: {0}

# StockImageService.UploadImagesExceptionMessage
source: An error occurred while uploading images: {0}
tr_tr: Görseller yüklenirken bir hata oluştu: {0}

# StockRelationService.RelationAdded
source: Stock relation added successfully.
tr_tr: Ürün ilişkisi başarıyla eklendi.

# StockRelationService.RelationRemoved
source: Stock relation removed successfully.
tr_tr: Ürün ilişkisi başarıyla kaldırıldı.

# StockRelationService.DuplicateRelation
source: This stock relation already exists.
tr_tr: Bu ürün ilişkisi zaten mevcut.

# StockRelationService.RelationNotFound
source: Stock relation not found.
ar_sa: مخزون relation غير موجود.
de_de: Lagerbestand relation nicht gefunden.
es_es: Stock relation no encontrado.
fr_fr: Stock relation non trouvé(e).
it_it: Scorte relation non trovato/a.
tr_tr: Ürün ilişkisi bulunamadı.

# StockRelationService.RelationsRetrieved
source: Stock relations retrieved successfully.
ar_sa: مخزون relations تم استرجاعه بنجاح.
de_de: Lagerbestand relations erfolgreich abgerufen.
es_es: Stock relations recuperado con éxito.
fr_fr: Stock relations récupéré(e) avec succès.
it_it: Scorte relations recuperato/a con successo.
tr_tr: Ürün ilişkileri başarıyla getirildi.

# StockRelationService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# StockRelationService.CreateExceptionMessage
source: An error occurred while creating stock relation: {0}
ar_sa: حدث خطأ أثناء إنشاء stock relation: {0}
de_de: Fehler beim Erstellen von stock relation: {0}
es_es: Ocurrió un error al crear stock relation: {0}
fr_fr: Une erreur est survenue lors de la création de stock relation: {0}
it_it: Si è verificato un errore durante la creazione di stock relation: {0}
tr_tr: Ürün ilişkisi oluşturulurken bir hata oluştu: {0}

# StockRelationService.GetByStockIdExceptionMessage
source: An error occurred while retrieving stock relations: {0}
ar_sa: حدث خطأ أثناء استرجاع stock relations: {0}
de_de: Fehler beim Abrufen von stock relations: {0}
es_es: Ocurrió un error al recuperar stock relations: {0}
fr_fr: Une erreur est survenue lors de la récupération de stock relations: {0}
it_it: Si è verificato un errore durante il recupero di stock relations: {0}
tr_tr: Ürün ilişkileri getirilirken bir hata oluştu: {0}

# StockRelationService.DeleteExceptionMessage
source: An error occurred while deleting stock relation: {0}
ar_sa: حدث خطأ أثناء حذف stock relation: {0}
de_de: Fehler beim Löschen von stock relation: {0}
es_es: Ocurrió un error al eliminar stock relation: {0}
fr_fr: Une erreur est survenue lors de la suppression de stock relation: {0}
it_it: Si è verificato un errore durante l'eliminazione di stock relation: {0}
tr_tr: Ürün ilişkisi silinirken bir hata oluştu: {0}

# StockService.StocksRetrieved
source: Stocks retrieved successfully.
ar_sa: Stocks تم استرجاعه بنجاح.
de_de: Stocks erfolgreich abgerufen.
es_es: Stocks recuperado con éxito.
fr_fr: Stocks récupéré(e) avec succès.
it_it: Stocks recuperato/a con successo.
tr_tr: Stoklar başarıyla getirildi.

# StockService.StockRetrieved
source: Stock retrieved successfully.
ar_sa: مخزون تم استرجاعه بنجاح.
de_de: Lagerbestand erfolgreich abgerufen.
es_es: Stock recuperado con éxito.
fr_fr: Stock récupéré(e) avec succès.
it_it: Scorte recuperato/a con successo.
tr_tr: Stok başarıyla getirildi.

# StockService.StockNotFound
source: Stock not found.
ar_sa: مخزون غير موجود.
de_de: Lagerbestand nicht gefunden.
es_es: Stock no encontrado.
fr_fr: Stock non trouvé(e).
it_it: Scorte non trovato/a.
tr_tr: Stok bulunamadı.

# StockService.StockCreated
source: Stock created successfully.
ar_sa: مخزون تم إنشاؤه بنجاح.
de_de: Lagerbestand erfolgreich erstellt.
es_es: Stock creado con éxito.
fr_fr: Stock créé(e) avec succès.
it_it: Scorte creato/a con successo.
tr_tr: Stok başarıyla oluşturuldu.

# StockService.StockUpdated
source: Stock updated successfully.
ar_sa: مخزون تم تحديثه بنجاح.
de_de: Lagerbestand erfolgreich aktualisiert.
es_es: Stock actualizado con éxito.
fr_fr: Stock mis(e) à jour avec succès.
it_it: Scorte aggiornato/a con successo.
tr_tr: Stok başarıyla güncellendi.

# StockService.StockDeleted
source: Stock deleted successfully.
ar_sa: مخزون تم حذفه بنجاح.
de_de: Lagerbestand erfolgreich gelöscht.
es_es: Stock eliminado con éxito.
fr_fr: Stock supprimé(e) avec succès.
it_it: Scorte eliminato/a con successo.
tr_tr: Stok başarıyla silindi.

# StockService.ErpStockCodeAlreadyExists
source: This ERP stock code already exists.
tr_tr: Bu ERP stok kodu zaten mevcut.

# StockService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# StockService.GetAllStocksExceptionMessage
source: An error occurred while retrieving stocks: {0}
ar_sa: حدث خطأ أثناء استرجاع stocks: {0}
de_de: Fehler beim Abrufen von stocks: {0}
es_es: Ocurrió un error al recuperar stocks: {0}
fr_fr: Une erreur est survenue lors de la récupération de stocks: {0}
it_it: Si è verificato un errore durante il recupero di stocks: {0}
tr_tr: Stoklar getirilirken bir hata oluştu: {0}

# StockService.GetStockByIdExceptionMessage
source: An error occurred while retrieving stock: {0}
ar_sa: حدث خطأ أثناء استرجاع stock: {0}
de_de: Fehler beim Abrufen von stock: {0}
es_es: Ocurrió un error al recuperar stock: {0}
fr_fr: Une erreur est survenue lors de la récupération de stock: {0}
it_it: Si è verificato un errore durante il recupero di stock: {0}
tr_tr: Stok getirilirken bir hata oluştu: {0}

# StockService.CreateStockExceptionMessage
source: An error occurred while creating stock: {0}
ar_sa: حدث خطأ أثناء إنشاء stock: {0}
de_de: Fehler beim Erstellen von stock: {0}
es_es: Ocurrió un error al crear stock: {0}
fr_fr: Une erreur est survenue lors de la création de stock: {0}
it_it: Si è verificato un errore durante la creazione di stock: {0}
tr_tr: Stok oluşturulurken bir hata oluştu: {0}

# StockService.UpdateStockExceptionMessage
source: An error occurred while updating stock: {0}
ar_sa: حدث خطأ أثناء تحديث stock: {0}
de_de: Fehler beim Aktualisieren von stock: {0}
es_es: Ocurrió un error al actualizar stock: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de stock: {0}
it_it: Si è verificato un errore durante l'aggiornamento di stock: {0}
tr_tr: Stok güncellenirken bir hata oluştu: {0}

# StockService.DeleteStockExceptionMessage
source: An error occurred while deleting stock: {0}
ar_sa: حدث خطأ أثناء حذف stock: {0}
de_de: Fehler beim Löschen von stock: {0}
es_es: Ocurrió un error al eliminar stock: {0}
fr_fr: Une erreur est survenue lors de la suppression de stock: {0}
it_it: Si è verificato un errore durante l'eliminazione di stock: {0}
tr_tr: Stok silinirken bir hata oluştu: {0}

# ApprovalActionService.ApprovalActionsRetrieved
source: Approval actions retrieved successfully.
ar_sa: موافقة actions تم استرجاعه بنجاح.
de_de: Genehmigung actions erfolgreich abgerufen.
es_es: Aprobación actions recuperado con éxito.
fr_fr: Approbation actions récupéré(e) avec succès.
it_it: Approvazione actions recuperato/a con successo.
tr_tr: Onay aksiyonları başarıyla getirildi.

# ApprovalActionService.ApprovalActionRetrieved
source: Approval action retrieved successfully.
ar_sa: موافقة action تم استرجاعه بنجاح.
de_de: Genehmigung action erfolgreich abgerufen.
es_es: Aprobación action recuperado con éxito.
fr_fr: Approbation action récupéré(e) avec succès.
it_it: Approvazione action recuperato/a con successo.
tr_tr: Onay aksiyonu başarıyla getirildi.

# ApprovalActionService.ApprovalActionNotFound
source: Approval action not found.
ar_sa: موافقة action غير موجود.
de_de: Genehmigung action nicht gefunden.
es_es: Aprobación action no encontrado.
fr_fr: Approbation action non trouvé(e).
it_it: Approvazione action non trovato/a.
tr_tr: Onay aksiyonu bulunamadı.

# ApprovalActionService.ApprovalActionCreated
source: Approval action created successfully.
ar_sa: موافقة action تم إنشاؤه بنجاح.
de_de: Genehmigung action erfolgreich erstellt.
es_es: Aprobación action creado con éxito.
fr_fr: Approbation action créé(e) avec succès.
it_it: Approvazione action creato/a con successo.
tr_tr: Onay aksiyonu başarıyla oluşturuldu.

# ApprovalActionService.ApprovalActionUpdated
source: Approval action updated successfully.
ar_sa: موافقة action تم تحديثه بنجاح.
de_de: Genehmigung action erfolgreich aktualisiert.
es_es: Aprobación action actualizado con éxito.
fr_fr: Approbation action mis(e) à jour avec succès.
it_it: Approvazione action aggiornato/a con successo.
tr_tr: Onay aksiyonu başarıyla güncellendi.

# ApprovalActionService.ApprovalActionDeleted
source: Approval action deleted successfully.
ar_sa: موافقة action تم حذفه بنجاح.
de_de: Genehmigung action erfolgreich gelöscht.
es_es: Aprobación action eliminado con éxito.
fr_fr: Approbation action supprimé(e) avec succès.
it_it: Approvazione action eliminato/a con successo.
tr_tr: Onay aksiyonu başarıyla silindi.

# ApprovalActionService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# ApprovalActionService.GetAllApprovalActionsExceptionMessage
source: An error occurred while retrieving approval actions: {0}
ar_sa: حدث خطأ أثناء استرجاع approval actions: {0}
de_de: Fehler beim Abrufen von approval actions: {0}
es_es: Ocurrió un error al recuperar approval actions: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval actions: {0}
it_it: Si è verificato un errore durante il recupero di approval actions: {0}
tr_tr: Onay aksiyonları getirilirken bir hata oluştu: {0}

# ApprovalActionService.GetApprovalActionByIdExceptionMessage
source: An error occurred while retrieving approval action: {0}
ar_sa: حدث خطأ أثناء استرجاع approval action: {0}
de_de: Fehler beim Abrufen von approval action: {0}
es_es: Ocurrió un error al recuperar approval action: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval action: {0}
it_it: Si è verificato un errore durante il recupero di approval action: {0}
tr_tr: Onay aksiyonu getirilirken bir hata oluştu: {0}

# ApprovalActionService.CreateApprovalActionExceptionMessage
source: An error occurred while creating approval action: {0}
ar_sa: حدث خطأ أثناء إنشاء approval action: {0}
de_de: Fehler beim Erstellen von approval action: {0}
es_es: Ocurrió un error al crear approval action: {0}
fr_fr: Une erreur est survenue lors de la création de approval action: {0}
it_it: Si è verificato un errore durante la creazione di approval action: {0}
tr_tr: Onay aksiyonu oluşturulurken bir hata oluştu: {0}

# ApprovalActionService.UpdateApprovalActionExceptionMessage
source: An error occurred while updating approval action: {0}
ar_sa: حدث خطأ أثناء تحديث approval action: {0}
de_de: Fehler beim Aktualisieren von approval action: {0}
es_es: Ocurrió un error al actualizar approval action: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de approval action: {0}
it_it: Si è verificato un errore durante l'aggiornamento di approval action: {0}
tr_tr: Onay aksiyonu güncellenirken bir hata oluştu: {0}

# ApprovalActionService.DeleteApprovalActionExceptionMessage
source: An error occurred while deleting approval action: {0}
ar_sa: حدث خطأ أثناء حذف approval action: {0}
de_de: Fehler beim Löschen von approval action: {0}
es_es: Ocurrió un error al eliminar approval action: {0}
fr_fr: Une erreur est survenue lors de la suppression de approval action: {0}
it_it: Si è verificato un errore durante l'eliminazione di approval action: {0}
tr_tr: Onay aksiyonu silinirken bir hata oluştu: {0}

# ApprovalFlowService.ApprovalFlowsRetrieved
source: Approval flows retrieved successfully.
ar_sa: موافقة flows تم استرجاعه بنجاح.
de_de: Genehmigung flows erfolgreich abgerufen.
es_es: Aprobación flows recuperado con éxito.
fr_fr: Approbation flows récupéré(e) avec succès.
it_it: Approvazione flows recuperato/a con successo.
tr_tr: Onay akışları başarıyla getirildi.

# ApprovalFlowService.ApprovalFlowRetrieved
source: Approval flow retrieved successfully.
ar_sa: موافقة flow تم استرجاعه بنجاح.
de_de: Genehmigung flow erfolgreich abgerufen.
es_es: Aprobación flow recuperado con éxito.
fr_fr: Approbation flow récupéré(e) avec succès.
it_it: Approvazione flow recuperato/a con successo.
tr_tr: Onay akışı başarıyla getirildi.

# ApprovalFlowService.ApprovalFlowNotFound
source: Approval flow not found.
ar_sa: موافقة flow غير موجود.
de_de: Genehmigung flow nicht gefunden.
es_es: Aprobación flow no encontrado.
fr_fr: Approbation flow non trouvé(e).
it_it: Approvazione flow non trovato/a.
tr_tr: Onay akışı bulunamadı.

# ApprovalFlowService.ApprovalFlowCreated
source: Approval flow created successfully.
ar_sa: موافقة flow تم إنشاؤه بنجاح.
de_de: Genehmigung flow erfolgreich erstellt.
es_es: Aprobación flow creado con éxito.
fr_fr: Approbation flow créé(e) avec succès.
it_it: Approvazione flow creato/a con successo.
tr_tr: Onay akışı başarıyla oluşturuldu.

# ApprovalFlowService.ApprovalFlowUpdated
source: Approval flow updated successfully.
ar_sa: موافقة flow تم تحديثه بنجاح.
de_de: Genehmigung flow erfolgreich aktualisiert.
es_es: Aprobación flow actualizado con éxito.
fr_fr: Approbation flow mis(e) à jour avec succès.
it_it: Approvazione flow aggiornato/a con successo.
tr_tr: Onay akışı başarıyla güncellendi.

# ApprovalFlowService.ApprovalFlowDeleted
source: Approval flow deleted successfully.
ar_sa: موافقة flow تم حذفه بنجاح.
de_de: Genehmigung flow erfolgreich gelöscht.
es_es: Aprobación flow eliminado con éxito.
fr_fr: Approbation flow supprimé(e) avec succès.
it_it: Approvazione flow eliminato/a con successo.
tr_tr: Onay akışı başarıyla silindi.

# ApprovalFlowService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# ApprovalFlowService.GetAllApprovalFlowsExceptionMessage
source: An error occurred while retrieving approval flows: {0}
ar_sa: حدث خطأ أثناء استرجاع approval flows: {0}
de_de: Fehler beim Abrufen von approval flows: {0}
es_es: Ocurrió un error al recuperar approval flows: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval flows: {0}
it_it: Si è verificato un errore durante il recupero di approval flows: {0}
tr_tr: Onay akışları getirilirken bir hata oluştu: {0}

# ApprovalFlowService.GetApprovalFlowByIdExceptionMessage
source: An error occurred while retrieving approval flow: {0}
ar_sa: حدث خطأ أثناء استرجاع approval flow: {0}
de_de: Fehler beim Abrufen von approval flow: {0}
es_es: Ocurrió un error al recuperar approval flow: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval flow: {0}
it_it: Si è verificato un errore durante il recupero di approval flow: {0}
tr_tr: Onay akışı getirilirken bir hata oluştu: {0}

# ApprovalFlowService.CreateApprovalFlowExceptionMessage
source: An error occurred while creating approval flow: {0}
ar_sa: حدث خطأ أثناء إنشاء approval flow: {0}
de_de: Fehler beim Erstellen von approval flow: {0}
es_es: Ocurrió un error al crear approval flow: {0}
fr_fr: Une erreur est survenue lors de la création de approval flow: {0}
it_it: Si è verificato un errore durante la creazione di approval flow: {0}
tr_tr: Onay akışı oluşturulurken bir hata oluştu: {0}

# ApprovalFlowService.UpdateApprovalFlowExceptionMessage
source: An error occurred while updating approval flow: {0}
ar_sa: حدث خطأ أثناء تحديث approval flow: {0}
de_de: Fehler beim Aktualisieren von approval flow: {0}
es_es: Ocurrió un error al actualizar approval flow: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de approval flow: {0}
it_it: Si è verificato un errore durante l'aggiornamento di approval flow: {0}
tr_tr: Onay akışı güncellenirken bir hata oluştu: {0}

# ApprovalFlowService.DeleteApprovalFlowExceptionMessage
source: An error occurred while deleting approval flow: {0}
ar_sa: حدث خطأ أثناء حذف approval flow: {0}
de_de: Fehler beim Löschen von approval flow: {0}
es_es: Ocurrió un error al eliminar approval flow: {0}
fr_fr: Une erreur est survenue lors de la suppression de approval flow: {0}
it_it: Si è verificato un errore durante l'eliminazione di approval flow: {0}
tr_tr: Onay akışı silinirken bir hata oluştu: {0}

# ApprovalFlowStepService.ApprovalFlowStepsRetrieved
source: Approval flow steps retrieved successfully.
ar_sa: موافقة flow steps تم استرجاعه بنجاح.
de_de: Genehmigung flow steps erfolgreich abgerufen.
es_es: Aprobación flow steps recuperado con éxito.
fr_fr: Approbation flow steps récupéré(e) avec succès.
it_it: Approvazione flow steps recuperato/a con successo.
tr_tr: Onay akış adımları başarıyla getirildi.

# ApprovalFlowStepService.ApprovalFlowStepRetrieved
source: Approval flow step retrieved successfully.
ar_sa: موافقة flow step تم استرجاعه بنجاح.
de_de: Genehmigung flow step erfolgreich abgerufen.
es_es: Aprobación flow step recuperado con éxito.
fr_fr: Approbation flow step récupéré(e) avec succès.
it_it: Approvazione flow step recuperato/a con successo.
tr_tr: Onay akış adımı başarıyla getirildi.

# ApprovalFlowStepService.ApprovalFlowStepNotFound
source: Approval flow step not found.
ar_sa: موافقة flow step غير موجود.
de_de: Genehmigung flow step nicht gefunden.
es_es: Aprobación flow step no encontrado.
fr_fr: Approbation flow step non trouvé(e).
it_it: Approvazione flow step non trovato/a.
tr_tr: Onay akış adımı bulunamadı.

# ApprovalFlowStepService.ApprovalFlowStepCreated
source: Approval flow step created successfully.
ar_sa: موافقة flow step تم إنشاؤه بنجاح.
de_de: Genehmigung flow step erfolgreich erstellt.
es_es: Aprobación flow step creado con éxito.
fr_fr: Approbation flow step créé(e) avec succès.
it_it: Approvazione flow step creato/a con successo.
tr_tr: Onay akış adımı başarıyla oluşturuldu.

# ApprovalFlowStepService.ApprovalFlowStepUpdated
source: Approval flow step updated successfully.
ar_sa: موافقة flow step تم تحديثه بنجاح.
de_de: Genehmigung flow step erfolgreich aktualisiert.
es_es: Aprobación flow step actualizado con éxito.
fr_fr: Approbation flow step mis(e) à jour avec succès.
it_it: Approvazione flow step aggiornato/a con successo.
tr_tr: Onay akış adımı başarıyla güncellendi.

# ApprovalFlowStepService.ApprovalFlowStepDeleted
source: Approval flow step deleted successfully.
ar_sa: موافقة flow step تم حذفه بنجاح.
de_de: Genehmigung flow step erfolgreich gelöscht.
es_es: Aprobación flow step eliminado con éxito.
fr_fr: Approbation flow step supprimé(e) avec succès.
it_it: Approvazione flow step eliminato/a con successo.
tr_tr: Onay akış adımı başarıyla silindi.

# ApprovalFlowStepService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# ApprovalFlowStepService.GetAllApprovalFlowStepsExceptionMessage
source: An error occurred while retrieving approval flow steps: {0}
ar_sa: حدث خطأ أثناء استرجاع approval flow steps: {0}
de_de: Fehler beim Abrufen von approval flow steps: {0}
es_es: Ocurrió un error al recuperar approval flow steps: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval flow steps: {0}
it_it: Si è verificato un errore durante il recupero di approval flow steps: {0}
tr_tr: Onay akış adımları getirilirken bir hata oluştu: {0}

# ApprovalFlowStepService.GetApprovalFlowStepByIdExceptionMessage
source: An error occurred while retrieving approval flow step: {0}
ar_sa: حدث خطأ أثناء استرجاع approval flow step: {0}
de_de: Fehler beim Abrufen von approval flow step: {0}
es_es: Ocurrió un error al recuperar approval flow step: {0}
fr_fr: Une erreur est survenue lors de la récupération de approval flow step: {0}
it_it: Si è verificato un errore durante il recupero di approval flow step: {0}
tr_tr: Onay akış adımı getirilirken bir hata oluştu: {0}

# ApprovalFlowStepService.CreateApprovalFlowStepExceptionMessage
source: An error occurred while creating approval flow step: {0}
ar_sa: حدث خطأ أثناء إنشاء approval flow step: {0}
de_de: Fehler beim Erstellen von approval flow step: {0}
es_es: Ocurrió un error al crear approval flow step: {0}
fr_fr: Une erreur est survenue lors de la création de approval flow step: {0}
it_it: Si è verificato un errore durante la creazione di approval flow step: {0}
tr_tr: Onay akış adımı oluşturulurken bir hata oluştu: {0}
