Repository: cannasif-ship-it/verii_crm_api
Catalog: Resources/Messages.*.resx
Languages: ar_sa, de_de, es_es, fr_fr, it_it, tr_tr

# ShippingAddressService.GetShippingAddressByIdExceptionMessage
source: An error occurred while retrieving the Shipping Address: {0}
ar_sa: حدث خطأ أثناء استرجاع the Shipping عنوان: {0}
de_de: Fehler beim Abrufen von the Shipping Adresse: {0}
es_es: Ocurrió un error al recuperar the Shipping Dirección: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Shipping Adresse: {0}
it_it: Si è verificato un errore durante il recupero di the Shipping Indirizzo: {0}
tr_tr: Shipping Address getirilirken bir hata oluştu: {0}

# ShippingAddressService.GetShippingAddressesByCustomerIdExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# ShippingAddressService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# ShippingAddressService.UpdateShippingAddressExceptionMessage
source: An error occurred while updating the Shipping Address: {0}
ar_sa: حدث خطأ أثناء تحديث the Shipping عنوان: {0}
de_de: Fehler beim Aktualisieren von the Shipping Adresse: {0}
es_es: Ocurrió un error al actualizar the Shipping Dirección: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Shipping Adresse: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Shipping Indirizzo: {0}
tr_tr: Shipping Address güncellenirken bir hata oluştu: {0}

# QuotationService.QuotationsRetrieved
source: Quotations retrieved successfully.
ar_sa: عروض أسعار تم استرجاعه بنجاح.
de_de: Angebote erfolgreich abgerufen.
es_es: Cotizaciones recuperado con éxito.
fr_fr: Devis récupéré(e) avec succès.
it_it: Preventivi recuperato/a con successo.
tr_tr: Teklifler başarıyla getirildi.

# QuotationService.QuotationNotFound
source: Quotation not found.
ar_sa: عرض سعر غير موجود.
de_de: Angebot nicht gefunden.
es_es: Cotización no encontrado.
fr_fr: Devis non trouvé(e).
it_it: Preventivo non trovato/a.
tr_tr: Teklif bulunamadı.

# QuotationService.QuotationRetrieved
source: Quotation retrieved successfully.
ar_sa: عرض سعر تم استرجاعه بنجاح.
de_de: Angebot erfolgreich abgerufen.
es_es: Cotización recuperado con éxito.
fr_fr: Devis récupéré(e) avec succès.
it_it: Preventivo recuperato/a con successo.
tr_tr: Teklif başarıyla getirildi.

# QuotationService.QuotationCreated
source: Quotation created successfully.
ar_sa: عرض سعر تم إنشاؤه بنجاح.
de_de: Angebot erfolgreich erstellt.
es_es: Cotización creado con éxito.
fr_fr: Devis créé(e) avec succès.
it_it: Preventivo creato/a con successo.
tr_tr: Teklif başarıyla oluşturuldu.

# QuotationService.QuotationUpdated
source: Quotation updated successfully.
ar_sa: عرض سعر تم تحديثه بنجاح.
de_de: Angebot erfolgreich aktualisiert.
es_es: Cotización actualizado con éxito.
fr_fr: Devis mis(e) à jour avec succès.
it_it: Preventivo aggiornato/a con successo.
tr_tr: Teklif başarıyla güncellendi.

# QuotationService.QuotationDeleted
source: Quotation deleted successfully.
ar_sa: عرض سعر تم حذفه بنجاح.
de_de: Angebot erfolgreich gelöscht.
es_es: Cotización eliminado con éxito.
fr_fr: Devis supprimé(e) avec succès.
it_it: Preventivo eliminato/a con successo.
tr_tr: Teklif başarıyla silindi.

# QuotationService.QuotationsByPotentialCustomerRetrieved
source: Quotations by potential customer retrieved successfully.
ar_sa: عروض أسعار by potential customer تم استرجاعه بنجاح.
de_de: Angebote by potential customer erfolgreich abgerufen.
es_es: Cotizaciones by potential customer recuperado con éxito.
fr_fr: Devis by potential customer récupéré(e) avec succès.
it_it: Preventivi by potential customer recuperato/a con successo.
tr_tr: Potansiyel müşteri teklifleri başarıyla getirildi.

# QuotationService.QuotationsByRepresentativeRetrieved
source: Quotations by representative retrieved successfully.
ar_sa: عروض أسعار by representative تم استرجاعه بنجاح.
de_de: Angebote by representative erfolgreich abgerufen.
es_es: Cotizaciones by representative recuperado con éxito.
fr_fr: Devis by representative récupéré(e) avec succès.
it_it: Preventivi by representative recuperato/a con successo.
tr_tr: Temsilci teklifleri başarıyla getirildi.

# QuotationService.QuotationsByStatusRetrieved
source: Quotations by status retrieved successfully.
ar_sa: عروض أسعار by status تم استرجاعه بنجاح.
de_de: Angebote by status erfolgreich abgerufen.
es_es: Cotizaciones by status recuperado con éxito.
fr_fr: Devis by status récupéré(e) avec succès.
it_it: Preventivi by status recuperato/a con successo.
tr_tr: Durum teklifleri başarıyla getirildi.

# QuotationService.PendingApprovalEmailSubject
source: You Have a Record Pending Approval
tr_tr: Onay Bekleyen Kaydınız Bulunmaktadır

# QuotationService.ApprovalActionNotFound
source: Quotation not found.
ar_sa: عرض سعر غير موجود.
de_de: Angebot nicht gefunden.
es_es: Cotización no encontrado.
fr_fr: Devis non trouvé(e).
it_it: Preventivo non trovato/a.
tr_tr: Quotation bulunamadı.

# QuotationService.ApprovalFlowAlreadyExists
source: Quotation already exists.
tr_tr: Quotation zaten mevcut.

# QuotationService.ApprovalFlowNotFound
source: Quotation not found.
ar_sa: عرض سعر غير موجود.
de_de: Angebot nicht gefunden.
es_es: Cotización no encontrado.
fr_fr: Devis non trouvé(e).
it_it: Preventivo non trovato/a.
tr_tr: Quotation bulunamadı.

# QuotationService.ApprovalFlowStepsNotFound
source: Quotation not found.
ar_sa: عرض سعر غير موجود.
de_de: Angebot nicht gefunden.
es_es: Cotización no encontrado.
fr_fr: Devis non trouvé(e).
it_it: Preventivo non trovato/a.
tr_tr: Quotation bulunamadı.

# QuotationService.ApprovalRequestNotFound
source: Quotation not found.
ar_sa: عرض سعر غير موجود.
de_de: Angebot nicht gefunden.
es_es: Cotización no encontrado.
fr_fr: Devis non trouvé(e).
it_it: Preventivo non trovato/a.
tr_tr: Quotation bulunamadı.

# QuotationService.ApprovalRoleNotFound
source: Quotation not found.
ar_sa: عرض سعر غير موجود.
de_de: Angebot nicht gefunden.
es_es: Cotización no encontrado.
fr_fr: Devis non trouvé(e).
it_it: Preventivo non trovato/a.
tr_tr: Quotation bulunamadı.

# QuotationService.ApprovalUsersNotFound
source: Quotation not found.
ar_sa: عرض سعر غير موجود.
de_de: Angebot nicht gefunden.
es_es: Cotización no encontrado.
fr_fr: Devis non trouvé(e).
it_it: Preventivo non trovato/a.
tr_tr: Quotation bulunamadı.

# QuotationService.ApproveExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# QuotationService.CreateQuotationBulkExceptionMessage
source: An error occurred while creating the Quotation: {0}
ar_sa: حدث خطأ أثناء إنشاء the عرض سعر: {0}
de_de: Fehler beim Erstellen von the Angebot: {0}
es_es: Ocurrió un error al crear the Cotización: {0}
fr_fr: Une erreur est survenue lors de la création de the Devis: {0}
it_it: Si è verificato un errore durante la creazione di the Preventivo: {0}
tr_tr: Quotation oluşturulurken bir hata oluştu: {0}

# QuotationService.CreateQuotationExceptionMessage
source: An error occurred while creating the Quotation: {0}
ar_sa: حدث خطأ أثناء إنشاء the عرض سعر: {0}
de_de: Fehler beim Erstellen von the Angebot: {0}
es_es: Ocurrió un error al crear the Cotización: {0}
fr_fr: Une erreur est survenue lors de la création de the Devis: {0}
it_it: Si è verificato un errore durante la creazione di the Preventivo: {0}
tr_tr: Quotation oluşturulurken bir hata oluştu: {0}

# QuotationService.CreateRevisionOfQuotationExceptionMessage
source: An error occurred while creating the Quotation: {0}
ar_sa: حدث خطأ أثناء إنشاء the عرض سعر: {0}
de_de: Fehler beim Erstellen von the Angebot: {0}
es_es: Ocurrió un error al crear the Cotización: {0}
fr_fr: Une erreur est survenue lors de la création de the Devis: {0}
it_it: Si è verificato un errore durante la creazione di the Preventivo: {0}
tr_tr: Quotation oluşturulurken bir hata oluştu: {0}

# QuotationService.DeleteQuotationExceptionMessage
source: An error occurred while deleting the Quotation: {0}
ar_sa: حدث خطأ أثناء حذف the عرض سعر: {0}
de_de: Fehler beim Löschen von the Angebot: {0}
es_es: Ocurrió un error al eliminar the Cotización: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Devis: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Preventivo: {0}
tr_tr: Quotation silinirken bir hata oluştu: {0}

# QuotationService.GetAllQuotationsExceptionMessage
source: An error occurred while retrieving Quotations: {0}
ar_sa: حدث خطأ أثناء استرجاع عروض أسعار: {0}
de_de: Fehler beim Abrufen von Angebote: {0}
es_es: Ocurrió un error al recuperar Cotizaciones: {0}
fr_fr: Une erreur est survenue lors de la récupération de Devis: {0}
it_it: Si è verificato un errore durante il recupero di Preventivi: {0}
tr_tr: Quotationler getirilirken bir hata oluştu: {0}

# QuotationService.GetPriceOfProductExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# QuotationService.GetPriceRuleOfQuotationExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# QuotationService.GetQuotationByIdExceptionMessage
source: An error occurred while retrieving the Quotation: {0}
ar_sa: حدث خطأ أثناء استرجاع the عرض سعر: {0}
de_de: Fehler beim Abrufen von the Angebot: {0}
es_es: Ocurrió un error al recuperar the Cotización: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Devis: {0}
it_it: Si è verificato un errore durante il recupero di the Preventivo: {0}
tr_tr: Quotation getirilirken bir hata oluştu: {0}

# QuotationService.GetQuotationsByPotentialCustomerExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# QuotationService.GetQuotationsByRepresentativeExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# QuotationService.GetQuotationsByStatusExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# QuotationService.GetWaitingApprovalsExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# QuotationService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# QuotationService.PriceOfProductRetrieved
source: Quotation retrieved successfully.
ar_sa: عرض سعر تم استرجاعه بنجاح.
de_de: Angebot erfolgreich abgerufen.
es_es: Cotización recuperado con éxito.
fr_fr: Devis récupéré(e) avec succès.
it_it: Preventivo recuperato/a con successo.
tr_tr: Quotation başarıyla getirildi.

# QuotationService.QuotationExistsExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# QuotationService.QuotationRevisionCreated
source: Quotation created successfully.
ar_sa: عرض سعر تم إنشاؤه بنجاح.
de_de: Angebot erfolgreich erstellt.
es_es: Cotización creado con éxito.
fr_fr: Devis créé(e) avec succès.
it_it: Preventivo creato/a con successo.
tr_tr: Quotation başarıyla oluşturuldu.

# QuotationService.RejectExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# QuotationService.StartApprovalFlowExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# QuotationService.UpdateQuotationExceptionMessage
source: An error occurred while updating the Quotation: {0}
ar_sa: حدث خطأ أثناء تحديث the عرض سعر: {0}
de_de: Fehler beim Aktualisieren von the Angebot: {0}
es_es: Ocurrió un error al actualizar the Cotización: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Devis: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Preventivo: {0}
tr_tr: Quotation güncellenirken bir hata oluştu: {0}

# QuotationService.UserNotFound
source: Quotation not found.
ar_sa: عرض سعر غير موجود.
de_de: Angebot nicht gefunden.
es_es: Cotización no encontrado.
fr_fr: Devis non trouvé(e).
it_it: Preventivo non trovato/a.
tr_tr: Quotation bulunamadı.

# QuotationService.WaitingApprovalsRetrieved
source: Quotations retrieved successfully.
ar_sa: عروض أسعار تم استرجاعه بنجاح.
de_de: Angebote erfolgreich abgerufen.
es_es: Cotizaciones recuperado con éxito.
fr_fr: Devis récupéré(e) avec succès.
it_it: Preventivi recuperato/a con successo.
tr_tr: Quotationler başarıyla getirildi.

# QuotationLineService.QuotationLinesRetrieved
source: Quotation lines retrieved successfully.
ar_sa: عرض سعر lines تم استرجاعه بنجاح.
de_de: Angebot lines erfolgreich abgerufen.
es_es: Cotización lines recuperado con éxito.
fr_fr: Devis lines récupéré(e) avec succès.
it_it: Preventivo lines recuperato/a con successo.
tr_tr: Teklif satırları başarıyla getirildi.

# QuotationLineService.QuotationLineNotFound
source: Quotation line not found.
ar_sa: عرض سعر line غير موجود.
de_de: Angebot line nicht gefunden.
es_es: Cotización line no encontrado.
fr_fr: Devis line non trouvé(e).
it_it: Preventivo line non trovato/a.
tr_tr: Teklif satırı bulunamadı.

# QuotationLineService.QuotationLineRetrieved
source: Quotation line retrieved successfully.
ar_sa: عرض سعر line تم استرجاعه بنجاح.
de_de: Angebot line erfolgreich abgerufen.
es_es: Cotización line recuperado con éxito.
fr_fr: Devis line récupéré(e) avec succès.
it_it: Preventivo line recuperato/a con successo.
tr_tr: Teklif satırı başarıyla getirildi.

# QuotationLineService.QuotationLineCreated
source: Quotation line created successfully.
ar_sa: عرض سعر line تم إنشاؤه بنجاح.
de_de: Angebot line erfolgreich erstellt.
es_es: Cotización line creado con éxito.
fr_fr: Devis line créé(e) avec succès.
it_it: Preventivo line creato/a con successo.
tr_tr: Teklif satırı başarıyla oluşturuldu.

# QuotationLineService.QuotationLineUpdated
source: Quotation line updated successfully.
ar_sa: عرض سعر line تم تحديثه بنجاح.
de_de: Angebot line erfolgreich aktualisiert.
es_es: Cotización line actualizado con éxito.
fr_fr: Devis line mis(e) à jour avec succès.
it_it: Preventivo line aggiornato/a con successo.
tr_tr: Teklif satırı başarıyla güncellendi.

# QuotationLineService.QuotationLineDeleted
source: Quotation line deleted successfully.
ar_sa: عرض سعر line تم حذفه بنجاح.
de_de: Angebot line erfolgreich gelöscht.
es_es: Cotización line eliminado con éxito.
fr_fr: Devis line supprimé(e) avec succès.
it_it: Preventivo line eliminato/a con successo.
tr_tr: Teklif satırı başarıyla silindi.

# QuotationLineService.ErrorRetrievingQuotationLines
source: An error occurred while retrieving quotation lines.
ar_sa: حدث خطأ أثناء استرجاع quotation lines.
de_de: Fehler beim Abrufen von quotation lines.
es_es: Ocurrió un error al recuperar quotation lines.
fr_fr: Une erreur est survenue lors de la récupération de quotation lines.
it_it: Si è verificato un errore durante il recupero di quotation lines.
tr_tr: Teklif satırları getirilirken bir hata oluştu.

# QuotationLineService.ErrorRetrievingQuotationLine
source: An error occurred while retrieving the quotation line.
ar_sa: حدث خطأ أثناء استرجاع the quotation line.
de_de: Fehler beim Abrufen von the quotation line.
es_es: Ocurrió un error al recuperar the quotation line.
fr_fr: Une erreur est survenue lors de la récupération de the quotation line.
it_it: Si è verificato un errore durante il recupero di the quotation line.
tr_tr: Teklif satırı getirilirken bir hata oluştu.

# QuotationLineService.ErrorCreatingQuotationLine
source: An error occurred while creating the quotation line.
ar_sa: حدث خطأ أثناء إنشاء the quotation line.
de_de: Fehler beim Erstellen von the quotation line.
es_es: Ocurrió un error al crear the quotation line.
fr_fr: Une erreur est survenue lors de la création de the quotation line.
it_it: Si è verificato un errore durante la creazione di the quotation line.
tr_tr: Teklif satırı oluşturulurken bir hata oluştu.

# QuotationLineService.ErrorUpdatingQuotationLine
source: An error occurred while updating the quotation line.
ar_sa: حدث خطأ أثناء تحديث the quotation line.
de_de: Fehler beim Aktualisieren von the quotation line.
es_es: Ocurrió un error al actualizar the quotation line.
fr_fr: Une erreur est survenue lors de la mise à jour de the quotation line.
it_it: Si è verificato un errore durante l'aggiornamento di the quotation line.
tr_tr: Teklif satırı güncellenirken bir hata oluştu.

# QuotationLineService.ErrorDeletingQuotationLine
source: An error occurred while deleting the quotation line.
ar_sa: حدث خطأ أثناء حذف the quotation line.
de_de: Fehler beim Löschen von the quotation line.
es_es: Ocurrió un error al eliminar the quotation line.
fr_fr: Une erreur est survenue lors de la suppression de the quotation line.
it_it: Si è verificato un errore durante l'eliminazione di the quotation line.
tr_tr: Teklif satırı silinirken bir hata oluştu.

# QuotationLineService.QuotationLinesByQuotationRetrieved
source: Quotation lines by quotation retrieved successfully.
ar_sa: عرض سعر lines by quotation تم استرجاعه بنجاح.
de_de: Angebot lines by quotation erfolgreich abgerufen.
es_es: Cotización lines by quotation recuperado con éxito.
fr_fr: Devis lines by quotation récupéré(e) avec succès.
it_it: Preventivo lines by quotation recuperato/a con successo.
tr_tr: Teklife göre teklif satırları başarıyla getirildi.

# QuotationLineService.CreateExceptionMessage
source: An error occurred while creating the Quotation Line: {0}
ar_sa: حدث خطأ أثناء إنشاء the عرض سعر Line: {0}
de_de: Fehler beim Erstellen von the Angebot Line: {0}
es_es: Ocurrió un error al crear the Cotización Line: {0}
fr_fr: Une erreur est survenue lors de la création de the Devis Line: {0}
it_it: Si è verificato un errore durante la creazione di the Preventivo Line: {0}
tr_tr: Quotation Line oluşturulurken bir hata oluştu: {0}

# QuotationLineService.DeleteExceptionMessage
source: An error occurred while deleting the Quotation Line: {0}
ar_sa: حدث خطأ أثناء حذف the عرض سعر Line: {0}
de_de: Fehler beim Löschen von the Angebot Line: {0}
es_es: Ocurrió un error al eliminar the Cotización Line: {0}
fr_fr: Une erreur est survenue lors de la suppression de the Devis Line: {0}
it_it: Si è verificato un errore durante l'eliminazione di the Preventivo Line: {0}
tr_tr: Quotation Line silinirken bir hata oluştu: {0}

# QuotationLineService.GetAllExceptionMessage
source: An error occurred while retrieving Quotation Lines: {0}
ar_sa: حدث خطأ أثناء استرجاع عرض سعر Lines: {0}
de_de: Fehler beim Abrufen von Angebot Lines: {0}
es_es: Ocurrió un error al recuperar Cotización Lines: {0}
fr_fr: Une erreur est survenue lors de la récupération de Devis Lines: {0}
it_it: Si è verificato un errore durante il recupero di Preventivo Lines: {0}
tr_tr: Quotation Lineler getirilirken bir hata oluştu: {0}

# QuotationLineService.GetByIdExceptionMessage
source: An error occurred while retrieving the Quotation Line: {0}
ar_sa: حدث خطأ أثناء استرجاع the عرض سعر Line: {0}
de_de: Fehler beim Abrufen von the Angebot Line: {0}
es_es: Ocurrió un error al recuperar the Cotización Line: {0}
fr_fr: Une erreur est survenue lors de la récupération de the Devis Line: {0}
it_it: Si è verificato un errore durante il recupero di the Preventivo Line: {0}
tr_tr: Quotation Line getirilirken bir hata oluştu: {0}

# QuotationLineService.GetByQuotationIdExceptionMessage
source: An error occurred: {0}
tr_tr: Bir hata oluştu: {0}

# QuotationLineService.InternalServerError
source: Internal server error occurred.
ar_sa: حدث خطأ داخلي في الخادم.
de_de: Interner Serverfehler aufgetreten.
es_es: Ocurrió un error interno del server.
fr_fr: Une erreur interne du serveur s'est produite.
it_it: Si è verificato un errore interno del server.
tr_tr: Sunucu hatası oluştu.

# QuotationLineService.UpdateExceptionMessage
source: An error occurred while updating the Quotation Line: {0}
ar_sa: حدث خطأ أثناء تحديث the عرض سعر Line: {0}
de_de: Fehler beim Aktualisieren von the Angebot Line: {0}
es_es: Ocurrió un error al actualizar the Cotización Line: {0}
fr_fr: Une erreur est survenue lors de la mise à jour de the Devis Line: {0}
it_it: Si è verificato un errore durante l'aggiornamento di the Preventivo Line: {0}
tr_tr: Quotation Line güncellenirken bir hata oluştu: {0}

# QuotationDocumentTypeService.QuotationDocumentTypesRetrieved
source: Quotation document types retrieved successfully.
ar_sa: عرض سعر document types تم استرجاعه بنجاح.
de_de: Angebot document types erfolgreich abgerufen.
es_es: Cotización document types recuperado con éxito.
fr_fr: Devis document types récupéré(e) avec succès.
it_it: Preventivo document types recuperato/a con successo.
tr_tr: Teklif doküman tipleri başarıyla getirildi.

# QuotationDocumentTypeService.QuotationDocumentTypeNotFound
source: Quotation document type not found.
ar_sa: عرض سعر document type غير موجود.
de_de: Angebot document type nicht gefunden.
es_es: Cotización document type no encontrado.
fr_fr: Devis document type non trouvé(e).
it_it: Preventivo document type non trovato/a.
tr_tr: Teklif doküman tipi bulunamadı.

# QuotationDocumentTypeService.QuotationDocumentTypeRetrieved
source: Quotation document type retrieved successfully.
ar_sa: عرض سعر document type تم استرجاعه بنجاح.
de_de: Angebot document type erfolgreich abgerufen.
es_es: Cotización document type recuperado con éxito.
fr_fr: Devis document type récupéré(e) avec succès.
it_it: Preventivo document type recuperato/a con successo.
tr_tr: Teklif doküman tipi başarıyla getirildi.

# QuotationDocumentTypeService.QuotationDocumentTypeCreated
source: Quotation document type created successfully.
ar_sa: عرض سعر document type تم إنشاؤه بنجاح.
de_de: Angebot document type erfolgreich erstellt.
es_es: Cotización document type creado con éxito.
fr_fr: Devis document type créé(e) avec succès.
it_it: Preventivo document type creato/a con successo.
tr_tr: Teklif doküman tipi başarıyla oluşturuldu.

# QuotationDocumentTypeService.QuotationDocumentTypeUpdated
source: Quotation document type updated successfully.
ar_sa: عرض سعر document type تم تحديثه بنجاح.
de_de: Angebot document type erfolgreich aktualisiert.
es_es: Cotización document type actualizado con éxito.
fr_fr: Devis document type mis(e) à jour avec succès.
it_it: Preventivo document type aggiornato/a con successo.
tr_tr: Teklif doküman tipi başarıyla güncellendi.

# QuotationDocumentTypeService.QuotationDocumentTypeDeleted
source: Quotation document type deleted successfully.
ar_sa: عرض سعر document type تم حذفه بنجاح.
de_de: Angebot document type erfolgreich gelöscht.
es_es: Cotización document type eliminado con éxito.
fr_fr: Devis document type supprimé(e) avec succès.
it_it: Preventivo document type eliminato/a con successo.
tr_tr: Teklif doküman tipi başarıyla silindi.

# QuotationDocumentTypeService.QuotationNumberGenerated
source: Quotation number generated successfully.
tr_tr: Teklif numarası başarıyla üretildi.

# ApprovalWorkflowService.ApprovalWorkflowsRetrieved
source: Approval workflows retrieved successfully.
ar_sa: موافقة workflows تم استرجاعه بنجاح.
de_de: Genehmigung workflows erfolgreich abgerufen.
es_es: Aprobación workflows recuperado con éxito.
fr_fr: Approbation workflows récupéré(e) avec succès.
it_it: Approvazione workflows recuperato/a con successo.
tr_tr: Onay iş akışları başarıyla getirildi.

# ApprovalWorkflowService.ApprovalWorkflowNotFound
source: Approval workflow not found.
ar_sa: موافقة workflow غير موجود.
de_de: Genehmigung workflow nicht gefunden.
es_es: Aprobación workflow no encontrado.
fr_fr: Approbation workflow non trouvé(e).
it_it: Approvazione workflow non trovato/a.
tr_tr: Onay iş akışı bulunamadı.
